TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{90C17AA4-2C03-4A74-A215-B08F3B065D28} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Sun Jun 17 14:52:02 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/drivers/adc/src/32b/f28x/f2802x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;       D:\ti\ccsv8\tools\compiler\ti-cgt-c2000_18.1.2.LTS\bin\opt2000.exe C:\\Users\\haowp\\AppData\\Local\\

    3353              
    3354              $C$DW$T$62      .dwtag  DW_TAG_typedef
    3355                      .dwattr $C$DW$T$62, DW_AT_name("ADC_TempSensorSrc_e")
    3356                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    3357                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3358              
    3359              $C$DW$344       .dwtag  DW_TAG_TI_far_type
    3360                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$62)
    3361              
    3362              $C$DW$T$63      .dwtag  DW_TAG_const_type
    3363                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$344)
    3364              
    3365              
    3366              $C$DW$T$64      .dwtag  DW_TAG_enumeration_type
    3367                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    3368              $C$DW$345       .dwtag  DW_TAG_enumerator
    3369                      .dwattr $C$DW$345, DW_AT_name("ADC_VoltageRefSrc_Int")
    3370                      .dwattr $C$DW$345, DW_AT_const_value(0x00)
    3371              
    3372              $C$DW$346       .dwtag  DW_TAG_enumerator
    3373                      .dwattr $C$DW$346, DW_AT_name("ADC_VoltageRefSrc_Ext")
    3374                      .dwattr $C$DW$346, DW_AT_const_value(0x08)
    3375              
    3376                      .dwendtag $C$DW$T$64
    3377              
    3378              $C$DW$T$65      .dwtag  DW_TAG_typedef
    3379                      .dwattr $C$DW$T$65, DW_AT_name("ADC_VoltageRefSrc_e")
    3380                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    3381                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3382              
    3383              $C$DW$347       .dwtag  DW_TAG_TI_far_type
    3384                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$65)
    3385              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{90C17AA4-2C03-4A74-A215-B08F3B065D28} PAGE   64

    3386              $C$DW$T$66      .dwtag  DW_TAG_const_type
    3387                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$347)
    3388              
    3389              
    3390              $C$DW$T$67      .dwtag  DW_TAG_enumeration_type
    3391                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
    3392              $C$DW$348       .dwtag  DW_TAG_enumerator
    3393                      .dwattr $C$DW$348, DW_AT_name("ADC_DivideSelect_ClkIn_by_1")
    3394                      .dwattr $C$DW$348, DW_AT_const_value(0x00)
    3395              
    3396              $C$DW$349       .dwtag  DW_TAG_enumerator
    3397                      .dwattr $C$DW$349, DW_AT_name("ADC_DivideSelect_ClkIn_by_2")
    3398                      .dwattr $C$DW$349, DW_AT_const_value(0x01)
    3399              
    3400                      .dwendtag $C$DW$T$67
    3401              
    3402              $C$DW$T$68      .dwtag  DW_TAG_typedef
    3403                      .dwattr $C$DW$T$68, DW_AT_name("ADC_DivideSelect_e")
    3404                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    3405                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3406              
    3407              $C$DW$350       .dwtag  DW_TAG_TI_far_type
    3408                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$68)
    3409              
    3410              $C$DW$T$69      .dwtag  DW_TAG_const_type
    3411                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$350)
    3412              
    3413              
    3414              $C$DW$T$74      .dwtag  DW_TAG_enumeration_type
    3415                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x01)
    3416              $C$DW$351       .dwtag  DW_TAG_enumerator
    3417                      .dwattr $C$DW$351, DW_AT_name("ADC_NoIntTriggersSOC")
    3418                      .dwattr $C$DW$351, DW_AT_const_value(0x00)
    3419              
    3420              $C$DW$352       .dwtag  DW_TAG_enumerator
    3421                      .dwattr $C$DW$352, DW_AT_name("ADC_Int1TriggersSOC")
    3422                      .dwattr $C$DW$352, DW_AT_const_value(0x01)
    3423              
    3424              $C$DW$353       .dwtag  DW_TAG_enumerator
    3425                      .dwattr $C$DW$353, DW_AT_name("ADC_Int2TriggersSOC")
    3426                      .dwattr $C$DW$353, DW_AT_const_value(0x02)
    3427              
    3428                      .dwendtag $C$DW$T$74
    3429              
    3430              $C$DW$T$75      .dwtag  DW_TAG_typedef
    3431                      .dwattr $C$DW$T$75, DW_AT_name("ADC_IntTriggerSOC_e")
    3432                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3433                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3434              
    3435              $C$DW$354       .dwtag  DW_TAG_TI_far_type
    3436                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$75)
    3437              
    3438              $C$DW$T$76      .dwtag  DW_TAG_const_type
    3439                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$354)
    3440              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{90C17AA4-2C03-4A74-A215-B08F3B065D28} PAGE   65

    3441              
    3442              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3443                      .dwattr $C$DW$T$27, DW_AT_name("_ADC_Obj_")
    3444                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x6650)
    3445              $C$DW$355       .dwtag  DW_TAG_member
    3446                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$21)
    3447                      .dwattr $C$DW$355, DW_AT_name("ADCRESULT")
    3448                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_ADCRESULT")
    3449                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3450                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3451              
    3452              $C$DW$356       .dwtag  DW_TAG_member
    3453                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$22)
    3454                      .dwattr $C$DW$356, DW_AT_name("resvd_1")
    3455                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_resvd_1")
    3456                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3457                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3458              
    3459              $C$DW$357       .dwtag  DW_TAG_member
    3460                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
    3461                      .dwattr $C$DW$357, DW_AT_name("ADCCTL1")
    3462                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_ADCCTL1")
    3463                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3464                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3465              
    3466              $C$DW$358       .dwtag  DW_TAG_member
    3467                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$20)
    3468                      .dwattr $C$DW$358, DW_AT_name("ADCCTL2")
    3469                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_ADCCTL2")
    3470                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3471                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3472              
    3473              $C$DW$359       .dwtag  DW_TAG_member
    3474                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$23)
    3475                      .dwattr $C$DW$359, DW_AT_name("rsvd_2")
    3476                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_rsvd_2")
    3477                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3478                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3479              
    3480              $C$DW$360       .dwtag  DW_TAG_member
    3481                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$20)
    3482                      .dwattr $C$DW$360, DW_AT_name("ADCINTFLG")
    3483                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_ADCINTFLG")
    3484                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3485                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3486              
    3487              $C$DW$361       .dwtag  DW_TAG_member
    3488                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    3489                      .dwattr $C$DW$361, DW_AT_name("ADCINTFLGCLR")
    3490                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3491                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3492                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3493              
    3494              $C$DW$362       .dwtag  DW_TAG_member
    3495                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{90C17AA4-2C03-4A74-A215-B08F3B065D28} PAGE   66

    3496                      .dwattr $C$DW$362, DW_AT_name("ADCINTOVF")
    3497                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_ADCINTOVF")
    3498                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3499                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3500              
    3501              $C$DW$363       .dwtag  DW_TAG_member
    3502                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
    3503                      .dwattr $C$DW$363, DW_AT_name("ADCINTOVFCLR")
    3504                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3505                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3506                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3507              
    3508              $C$DW$364       .dwtag  DW_TAG_member
    3509                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$24)
    3510                      .dwattr $C$DW$364, DW_AT_name("INTSELxNy")
    3511                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_INTSELxNy")
    3512                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3513                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3514              
    3515              $C$DW$365       .dwtag  DW_TAG_member
    3516                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$25)
    3517                      .dwattr $C$DW$365, DW_AT_name("rsvd_3")
    3518                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_rsvd_3")
    3519                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3520                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3521              
    3522              $C$DW$366       .dwtag  DW_TAG_member
    3523                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    3524                      .dwattr $C$DW$366, DW_AT_name("SOCPRICTRL")
    3525                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3526                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3527                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3528              
    3529              $C$DW$367       .dwtag  DW_TAG_member
    3530                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    3531                      .dwattr $C$DW$367, DW_AT_name("rsvd_4")
    3532                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_rsvd_4")
    3533                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3534                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3535              
    3536              $C$DW$368       .dwtag  DW_TAG_member
    3537                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    3538                      .dwattr $C$DW$368, DW_AT_name("ADCSAMPLEMODE")
    3539                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3540                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3541                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3542              
    3543              $C$DW$369       .dwtag  DW_TAG_member
    3544                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    3545                      .dwattr $C$DW$369, DW_AT_name("rsvd_5")
    3546                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_rsvd_5")
    3547                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3548                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3549              
    3550              $C$DW$370       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{90C17AA4-2C03-4A74-A215-B08F3B065D28} PAGE   67

    3551                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    3552                      .dwattr $C$DW$370, DW_AT_name("ADCINTSOCSEL1")
    3553                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3554                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3555                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3556              
    3557              $C$DW$371       .dwtag  DW_TAG_member
    3558                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
    3559                      .dwattr $C$DW$371, DW_AT_name("ADCINTSOCSEL2")
    3560                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3561                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3562                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3563              
    3564              $C$DW$372       .dwtag  DW_TAG_member
    3565                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$23)
    3566                      .dwattr $C$DW$372, DW_AT_name("rsvd_6")
    3567                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_rsvd_6")
    3568                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3569                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3570              
    3571              $C$DW$373       .dwtag  DW_TAG_member
    3572                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    3573                      .dwattr $C$DW$373, DW_AT_name("ADCSOCFLG1")
    3574                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3575                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3576                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3577              
    3578              $C$DW$374       .dwtag  DW_TAG_member
    3579                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    3580                      .dwattr $C$DW$374, DW_AT_name("rsvd_7")
    3581                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_rsvd_7")
    3582                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3583                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3584              
    3585              $C$DW$375       .dwtag  DW_TAG_member
    3586                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    3587                      .dwattr $C$DW$375, DW_AT_name("ADCSOCFRC1")
    3588                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3589                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3590                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3591              
    3592              $C$DW$376       .dwtag  DW_TAG_member
    3593                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    3594                      .dwattr $C$DW$376, DW_AT_name("rsvd_8")
    3595                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_rsvd_8")
    3596                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3597                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3598              
    3599              $C$DW$377       .dwtag  DW_TAG_member
    3600                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    3601                      .dwattr $C$DW$377, DW_AT_name("ADCSOCOVF1")
    3602                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3603                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3604                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3605              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{90C17AA4-2C03-4A74-A215-B08F3B065D28} PAGE   68

    3606              $C$DW$378       .dwtag  DW_TAG_member
    3607                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$20)
    3608                      .dwattr $C$DW$378, DW_AT_name("rsvd_9")
    3609                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_rsvd_9")
    3610                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3611                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3612              
    3613              $C$DW$379       .dwtag  DW_TAG_member
    3614                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
    3615                      .dwattr $C$DW$379, DW_AT_name("ADCSOCOVFCLR1")
    3616                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3617                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3618                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3619              
    3620              $C$DW$380       .dwtag  DW_TAG_member
    3621                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$20)
    3622                      .dwattr $C$DW$380, DW_AT_name("rsvd_10")
    3623                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_rsvd_10")
    3624                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3625                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3626              
    3627              $C$DW$381       .dwtag  DW_TAG_member
    3628                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$21)
    3629                      .dwattr $C$DW$381, DW_AT_name("ADCSOCxCTL")
    3630                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3631                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3632                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3633              
    3634              $C$DW$382       .dwtag  DW_TAG_member
    3635                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$21)
    3636                      .dwattr $C$DW$382, DW_AT_name("rsvd_11")
    3637                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_rsvd_11")
    3638                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3639                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3640              
    3641              $C$DW$383       .dwtag  DW_TAG_member
    3642                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$20)
    3643                      .dwattr $C$DW$383, DW_AT_name("ADCREFTRIM")
    3644                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3645                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3646                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3647              
    3648              $C$DW$384       .dwtag  DW_TAG_member
    3649                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$20)
    3650                      .dwattr $C$DW$384, DW_AT_name("ADCOFFTRIM")
    3651                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3652                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3653                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3654              
    3655              $C$DW$385       .dwtag  DW_TAG_member
    3656                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$26)
    3657                      .dwattr $C$DW$385, DW_AT_name("resvd_12")
    3658                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_resvd_12")
    3659                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3660                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{90C17AA4-2C03-4A74-A215-B08F3B065D28} PAGE   69

    3661              
    3662              $C$DW$386       .dwtag  DW_TAG_member
    3663                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$20)
    3664                      .dwattr $C$DW$386, DW_AT_name("ADCREV")
    3665                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_ADCREV")
    3666                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3667                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3668              
    3669                      .dwendtag $C$DW$T$27
    3670              
    3671              $C$DW$T$77      .dwtag  DW_TAG_typedef
    3672                      .dwattr $C$DW$T$77, DW_AT_name("ADC_Obj")
    3673                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$27)
    3674                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    3675              
    3676              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    3677                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$27)
    3678                      .dwattr $C$DW$T$70, DW_AT_address_class(0x20)
    3679              
    3680              $C$DW$T$71      .dwtag  DW_TAG_typedef
    3681                      .dwattr $C$DW$T$71, DW_AT_name("ADC_Handle")
    3682                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    3683                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3684              
    3685              $C$DW$387       .dwtag  DW_TAG_TI_far_type
    3686                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$71)
    3687              
    3688              $C$DW$T$78      .dwtag  DW_TAG_const_type
    3689                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$387)
    3690              
    3691              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3692                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3693              
    3694              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3695                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3696                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3697              
    3698              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3699                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3700                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3701                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3702              
    3703              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3704                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3705                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3706                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3707              
    3708              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3709                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3710                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3711                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3712              
    3713              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3714                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3715                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{90C17AA4-2C03-4A74-A215-B08F3B065D28} PAGE   70

    3716                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3717              
    3718              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3719                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3720                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3721                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3722              
    3723              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3724                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3725                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3726                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3727              
    3728              $C$DW$T$10      .dwtag  DW_TAG_base_type
