TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Sun Jun 17 14:52:08 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    9425                      .dwattr $C$DW$979, DW_AT_name("EST_State_RoverL")
    9426                      .dwattr $C$DW$979, DW_AT_const_value(0x02)
    9427              
    9428              $C$DW$980       .dwtag  DW_TAG_enumerator
    9429                      .dwattr $C$DW$980, DW_AT_name("EST_State_Rs")
    9430                      .dwattr $C$DW$980, DW_AT_const_value(0x03)
    9431              
    9432              $C$DW$981       .dwtag  DW_TAG_enumerator
    9433                      .dwattr $C$DW$981, DW_AT_name("EST_State_RampUp")
    9434                      .dwattr $C$DW$981, DW_AT_const_value(0x04)
    9435              
    9436              $C$DW$982       .dwtag  DW_TAG_enumerator
    9437                      .dwattr $C$DW$982, DW_AT_name("EST_State_IdRated")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  179

    9438                      .dwattr $C$DW$982, DW_AT_const_value(0x05)
    9439              
    9440              $C$DW$983       .dwtag  DW_TAG_enumerator
    9441                      .dwattr $C$DW$983, DW_AT_name("EST_State_RatedFlux_OL")
    9442                      .dwattr $C$DW$983, DW_AT_const_value(0x06)
    9443              
    9444              $C$DW$984       .dwtag  DW_TAG_enumerator
    9445                      .dwattr $C$DW$984, DW_AT_name("EST_State_RatedFlux")
    9446                      .dwattr $C$DW$984, DW_AT_const_value(0x07)
    9447              
    9448              $C$DW$985       .dwtag  DW_TAG_enumerator
    9449                      .dwattr $C$DW$985, DW_AT_name("EST_State_RampDown")
    9450                      .dwattr $C$DW$985, DW_AT_const_value(0x08)
    9451              
    9452              $C$DW$986       .dwtag  DW_TAG_enumerator
    9453                      .dwattr $C$DW$986, DW_AT_name("EST_State_LockRotor")
    9454                      .dwattr $C$DW$986, DW_AT_const_value(0x09)
    9455              
    9456              $C$DW$987       .dwtag  DW_TAG_enumerator
    9457                      .dwattr $C$DW$987, DW_AT_name("EST_State_Ls")
    9458                      .dwattr $C$DW$987, DW_AT_const_value(0x0a)
    9459              
    9460              $C$DW$988       .dwtag  DW_TAG_enumerator
    9461                      .dwattr $C$DW$988, DW_AT_name("EST_State_Rr")
    9462                      .dwattr $C$DW$988, DW_AT_const_value(0x0b)
    9463              
    9464              $C$DW$989       .dwtag  DW_TAG_enumerator
    9465                      .dwattr $C$DW$989, DW_AT_name("EST_State_MotorIdentified")
    9466                      .dwattr $C$DW$989, DW_AT_const_value(0x0c)
    9467              
    9468              $C$DW$990       .dwtag  DW_TAG_enumerator
    9469                      .dwattr $C$DW$990, DW_AT_name("EST_State_OnLine")
    9470                      .dwattr $C$DW$990, DW_AT_const_value(0x0d)
    9471              
    9472              $C$DW$991       .dwtag  DW_TAG_enumerator
    9473                      .dwattr $C$DW$991, DW_AT_name("EST_numStates")
    9474                      .dwattr $C$DW$991, DW_AT_const_value(0x0e)
    9475              
    9476                      .dwendtag $C$DW$T$172
    9477              
    9478              $C$DW$T$173     .dwtag  DW_TAG_typedef
    9479                      .dwattr $C$DW$T$173, DW_AT_name("EST_State_e")
    9480                      .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$172)
    9481                      .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    9482              
    9483              
    9484              $C$DW$T$177     .dwtag  DW_TAG_enumeration_type
    9485                      .dwattr $C$DW$T$177, DW_AT_byte_size(0x01)
    9486              $C$DW$992       .dwtag  DW_TAG_enumerator
    9487                      .dwattr $C$DW$992, DW_AT_name("CTRL_Type_PID_spd")
    9488                      .dwattr $C$DW$992, DW_AT_const_value(0x00)
    9489              
    9490              $C$DW$993       .dwtag  DW_TAG_enumerator
    9491                      .dwattr $C$DW$993, DW_AT_name("CTRL_Type_PID_Id")
    9492                      .dwattr $C$DW$993, DW_AT_const_value(0x01)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  180

    9493              
    9494              $C$DW$994       .dwtag  DW_TAG_enumerator
    9495                      .dwattr $C$DW$994, DW_AT_name("CTRL_Type_PID_Iq")
    9496                      .dwattr $C$DW$994, DW_AT_const_value(0x02)
    9497              
    9498                      .dwendtag $C$DW$T$177
    9499              
    9500              $C$DW$T$178     .dwtag  DW_TAG_typedef
    9501                      .dwattr $C$DW$T$178, DW_AT_name("CTRL_Type_e")
    9502                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$177)
    9503                      .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    9504              
    9505              $C$DW$995       .dwtag  DW_TAG_TI_far_type
    9506                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$178)
    9507              
    9508              $C$DW$T$179     .dwtag  DW_TAG_const_type
    9509                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$995)
    9510              
    9511              
    9512              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    9513                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    9514                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    9515              $C$DW$996       .dwtag  DW_TAG_member
    9516                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$24)
    9517                      .dwattr $C$DW$996, DW_AT_name("ADCRESULT")
    9518                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_ADCRESULT")
    9519                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9520                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9521              
    9522              $C$DW$997       .dwtag  DW_TAG_member
    9523                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$25)
    9524                      .dwattr $C$DW$997, DW_AT_name("resvd_1")
    9525                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_resvd_1")
    9526                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9527                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    9528              
    9529              $C$DW$998       .dwtag  DW_TAG_member
    9530                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$23)
    9531                      .dwattr $C$DW$998, DW_AT_name("ADCCTL1")
    9532                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_ADCCTL1")
    9533                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    9534                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9535              
    9536              $C$DW$999       .dwtag  DW_TAG_member
    9537                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$23)
    9538                      .dwattr $C$DW$999, DW_AT_name("ADCCTL2")
    9539                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_ADCCTL2")
    9540                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    9541                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9542              
    9543              $C$DW$1000      .dwtag  DW_TAG_member
    9544                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$26)
    9545                      .dwattr $C$DW$1000, DW_AT_name("rsvd_2")
    9546                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_rsvd_2")
    9547                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  181

    9548                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9549              
    9550              $C$DW$1001      .dwtag  DW_TAG_member
    9551                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$23)
    9552                      .dwattr $C$DW$1001, DW_AT_name("ADCINTFLG")
    9553                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_ADCINTFLG")
    9554                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    9555                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    9556              
    9557              $C$DW$1002      .dwtag  DW_TAG_member
    9558                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$23)
    9559                      .dwattr $C$DW$1002, DW_AT_name("ADCINTFLGCLR")
    9560                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    9561                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    9562                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9563              
    9564              $C$DW$1003      .dwtag  DW_TAG_member
    9565                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$23)
    9566                      .dwattr $C$DW$1003, DW_AT_name("ADCINTOVF")
    9567                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_ADCINTOVF")
    9568                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    9569                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9570              
    9571              $C$DW$1004      .dwtag  DW_TAG_member
    9572                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$23)
    9573                      .dwattr $C$DW$1004, DW_AT_name("ADCINTOVFCLR")
    9574                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    9575                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    9576                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9577              
    9578              $C$DW$1005      .dwtag  DW_TAG_member
    9579                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$27)
    9580                      .dwattr $C$DW$1005, DW_AT_name("INTSELxNy")
    9581                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_INTSELxNy")
    9582                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    9583                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9584              
    9585              $C$DW$1006      .dwtag  DW_TAG_member
    9586                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$28)
    9587                      .dwattr $C$DW$1006, DW_AT_name("rsvd_3")
    9588                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_rsvd_3")
    9589                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    9590                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9591              
    9592              $C$DW$1007      .dwtag  DW_TAG_member
    9593                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$23)
    9594                      .dwattr $C$DW$1007, DW_AT_name("SOCPRICTRL")
    9595                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_SOCPRICTRL")
    9596                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    9597                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9598              
    9599              $C$DW$1008      .dwtag  DW_TAG_member
    9600                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$23)
    9601                      .dwattr $C$DW$1008, DW_AT_name("rsvd_4")
    9602                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_rsvd_4")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  182

    9603                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    9604                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9605              
    9606              $C$DW$1009      .dwtag  DW_TAG_member
    9607                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$23)
    9608                      .dwattr $C$DW$1009, DW_AT_name("ADCSAMPLEMODE")
    9609                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    9610                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    9611                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9612              
    9613              $C$DW$1010      .dwtag  DW_TAG_member
    9614                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$23)
    9615                      .dwattr $C$DW$1010, DW_AT_name("rsvd_5")
    9616                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_rsvd_5")
    9617                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    9618                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    9619              
    9620              $C$DW$1011      .dwtag  DW_TAG_member
    9621                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$23)
    9622                      .dwattr $C$DW$1011, DW_AT_name("ADCINTSOCSEL1")
    9623                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    9624                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    9625                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9626              
    9627              $C$DW$1012      .dwtag  DW_TAG_member
    9628                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$23)
    9629                      .dwattr $C$DW$1012, DW_AT_name("ADCINTSOCSEL2")
    9630                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9631                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9632                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9633              
    9634              $C$DW$1013      .dwtag  DW_TAG_member
    9635                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$26)
    9636                      .dwattr $C$DW$1013, DW_AT_name("rsvd_6")
    9637                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_rsvd_6")
    9638                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    9639                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9640              
    9641              $C$DW$1014      .dwtag  DW_TAG_member
    9642                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$23)
    9643                      .dwattr $C$DW$1014, DW_AT_name("ADCSOCFLG1")
    9644                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    9645                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    9646                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9647              
    9648              $C$DW$1015      .dwtag  DW_TAG_member
    9649                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$23)
    9650                      .dwattr $C$DW$1015, DW_AT_name("rsvd_7")
    9651                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_rsvd_7")
    9652                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    9653                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9654              
    9655              $C$DW$1016      .dwtag  DW_TAG_member
    9656                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$23)
    9657                      .dwattr $C$DW$1016, DW_AT_name("ADCSOCFRC1")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  183

    9658                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    9659                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    9660                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9661              
    9662              $C$DW$1017      .dwtag  DW_TAG_member
    9663                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$23)
    9664                      .dwattr $C$DW$1017, DW_AT_name("rsvd_8")
    9665                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_rsvd_8")
    9666                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    9667                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9668              
    9669              $C$DW$1018      .dwtag  DW_TAG_member
    9670                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$23)
    9671                      .dwattr $C$DW$1018, DW_AT_name("ADCSOCOVF1")
    9672                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    9673                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    9674                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9675              
    9676              $C$DW$1019      .dwtag  DW_TAG_member
    9677                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$23)
    9678                      .dwattr $C$DW$1019, DW_AT_name("rsvd_9")
    9679                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_rsvd_9")
    9680                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9681                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9682              
    9683              $C$DW$1020      .dwtag  DW_TAG_member
    9684                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$23)
    9685                      .dwattr $C$DW$1020, DW_AT_name("ADCSOCOVFCLR1")
    9686                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9687                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9688                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9689              
    9690              $C$DW$1021      .dwtag  DW_TAG_member
    9691                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$23)
    9692                      .dwattr $C$DW$1021, DW_AT_name("rsvd_10")
    9693                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_rsvd_10")
    9694                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9695                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9696              
    9697              $C$DW$1022      .dwtag  DW_TAG_member
    9698                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$24)
    9699                      .dwattr $C$DW$1022, DW_AT_name("ADCSOCxCTL")
    9700                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9701                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9702                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9703              
    9704              $C$DW$1023      .dwtag  DW_TAG_member
    9705                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$24)
    9706                      .dwattr $C$DW$1023, DW_AT_name("rsvd_11")
    9707                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_rsvd_11")
    9708                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9709                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9710              
    9711              $C$DW$1024      .dwtag  DW_TAG_member
    9712                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  184

    9713                      .dwattr $C$DW$1024, DW_AT_name("ADCREFTRIM")
    9714                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9715                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    9716                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    9717              
    9718              $C$DW$1025      .dwtag  DW_TAG_member
    9719                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$23)
    9720                      .dwattr $C$DW$1025, DW_AT_name("ADCOFFTRIM")
    9721                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9722                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    9723                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    9724              
    9725              $C$DW$1026      .dwtag  DW_TAG_member
    9726                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$29)
    9727                      .dwattr $C$DW$1026, DW_AT_name("resvd_12")
    9728                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_resvd_12")
    9729                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    9730                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9731              
    9732              $C$DW$1027      .dwtag  DW_TAG_member
    9733                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$23)
    9734                      .dwattr $C$DW$1027, DW_AT_name("ADCREV")
    9735                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_ADCREV")
    9736                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9737                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9738              
    9739                      .dwendtag $C$DW$T$30
    9740              
    9741              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    9742                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$30)
    9743                      .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    9744              
    9745              $C$DW$T$90      .dwtag  DW_TAG_typedef
    9746                      .dwattr $C$DW$T$90, DW_AT_name("ADC_Handle")
    9747                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    9748                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    9749              
    9750              
    9751              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    9752                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    9753                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    9754              $C$DW$1028      .dwtag  DW_TAG_member
    9755                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$31)
    9756                      .dwattr $C$DW$1028, DW_AT_name("alpha_sf")
    9757                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_alpha_sf")
    9758                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9759                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9760              
    9761              $C$DW$1029      .dwtag  DW_TAG_member
    9762                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$31)
    9763                      .dwattr $C$DW$1029, DW_AT_name("beta_sf")
    9764                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_beta_sf")
    9765                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9766                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9767              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  185

    9768              $C$DW$1030      .dwtag  DW_TAG_member
    9769                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$32)
    9770                      .dwattr $C$DW$1030, DW_AT_name("numSensors")
    9771                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_numSensors")
    9772                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9773                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9774              
    9775                      .dwendtag $C$DW$T$33
    9776              
    9777              $C$DW$T$44      .dwtag  DW_TAG_typedef
    9778                      .dwattr $C$DW$T$44, DW_AT_name("CLARKE_Obj")
    9779                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    9780                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    9781              
    9782              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    9783                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    9784                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    9785              
    9786              $C$DW$T$43      .dwtag  DW_TAG_typedef
    9787                      .dwattr $C$DW$T$43, DW_AT_name("CLARKE_Handle")
    9788                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    9789                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    9790              
    9791              
    9792              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    9793                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    9794                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    9795              $C$DW$1031      .dwtag  DW_TAG_member
    9796                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$23)
    9797                      .dwattr $C$DW$1031, DW_AT_name("XCLK")
    9798                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_XCLK")
    9799                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9800                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9801              
    9802              $C$DW$1032      .dwtag  DW_TAG_member
    9803                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$23)
    9804                      .dwattr $C$DW$1032, DW_AT_name("rsvd_1")
    9805                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_rsvd_1")
    9806                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9807                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9808              
    9809              $C$DW$1033      .dwtag  DW_TAG_member
    9810                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$23)
    9811                      .dwattr $C$DW$1033, DW_AT_name("CLKCTL")
    9812                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_CLKCTL")
    9813                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9814                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9815              
    9816              $C$DW$1034      .dwtag  DW_TAG_member
    9817                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$34)
    9818                      .dwattr $C$DW$1034, DW_AT_name("rsvd_2")
    9819                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_rsvd_2")
    9820                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9821                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9822              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  186

    9823              $C$DW$1035      .dwtag  DW_TAG_member
    9824                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$23)
    9825                      .dwattr $C$DW$1035, DW_AT_name("LOSPCP")
    9826                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_LOSPCP")
    9827                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9828                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    9829              
    9830              $C$DW$1036      .dwtag  DW_TAG_member
    9831                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$23)
    9832                      .dwattr $C$DW$1036, DW_AT_name("PCLKCR0")
    9833                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_PCLKCR0")
    9834                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9835                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    9836              
    9837              $C$DW$1037      .dwtag  DW_TAG_member
    9838                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$23)
    9839                      .dwattr $C$DW$1037, DW_AT_name("PCLKCR1")
    9840                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_PCLKCR1")
    9841                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9842                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    9843              
    9844              $C$DW$1038      .dwtag  DW_TAG_member
    9845                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$26)
    9846                      .dwattr $C$DW$1038, DW_AT_name("rsvd_3")
    9847                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_rsvd_3")
    9848                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9849                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    9850              
    9851              $C$DW$1039      .dwtag  DW_TAG_member
    9852                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$23)
    9853                      .dwattr $C$DW$1039, DW_AT_name("PCLKCR3")
    9854                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_PCLKCR3")
    9855                      .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9856                      .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
    9857              
    9858                      .dwendtag $C$DW$T$35
    9859              
    9860              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    9861                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$35)
    9862                      .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    9863              
    9864              $C$DW$T$92      .dwtag  DW_TAG_typedef
    9865                      .dwattr $C$DW$T$92, DW_AT_name("CLK_Handle")
    9866                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    9867                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    9868              
    9869              
    9870              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    9871                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    9872                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    9873              $C$DW$1040      .dwtag  DW_TAG_member
    9874                      .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$32)
    9875                      .dwattr $C$DW$1040, DW_AT_name("tmp")
    9876                      .dwattr $C$DW$1040, DW_AT_TI_symbol_name("_tmp")
    9877                      .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  187

    9878                      .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
    9879              
    9880                      .dwendtag $C$DW$T$36
    9881              
    9882              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    9883                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$36)
    9884                      .dwattr $C$DW$T$93, DW_AT_address_class(0x20)
    9885              
    9886              $C$DW$T$94      .dwtag  DW_TAG_typedef
    9887                      .dwattr $C$DW$T$94, DW_AT_name("CPU_Handle")
    9888                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    9889                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    9890              
    9891              
    9892              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    9893                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    9894                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    9895              $C$DW$1041      .dwtag  DW_TAG_member
    9896                      .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$37)
    9897                      .dwattr $C$DW$1041, DW_AT_name("version")
    9898                      .dwattr $C$DW$1041, DW_AT_TI_symbol_name("_version")
    9899                      .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9900                      .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
    9901              
    9902              $C$DW$1042      .dwtag  DW_TAG_member
    9903                      .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$39)
    9904                      .dwattr $C$DW$1042, DW_AT_name("state")
    9905                      .dwattr $C$DW$1042, DW_AT_TI_symbol_name("_state")
    9906                      .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9907                      .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
    9908              
    9909              $C$DW$1043      .dwtag  DW_TAG_member
    9910                      .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$39)
    9911                      .dwattr $C$DW$1043, DW_AT_name("prevState")
    9912                      .dwattr $C$DW$1043, DW_AT_TI_symbol_name("_prevState")
    9913                      .dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9914                      .dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
    9915              
    9916              $C$DW$1044      .dwtag  DW_TAG_member
    9917                      .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$41)
    9918                      .dwattr $C$DW$1044, DW_AT_name("errorCode")
    9919                      .dwattr $C$DW$1044, DW_AT_TI_symbol_name("_errorCode")
    9920                      .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9921                      .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
    9922              
    9923              $C$DW$1045      .dwtag  DW_TAG_member
    9924                      .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$43)
    9925                      .dwattr $C$DW$1045, DW_AT_name("clarkeHandle_I")
    9926                      .dwattr $C$DW$1045, DW_AT_TI_symbol_name("_clarkeHandle_I")
    9927                      .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9928                      .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
    9929              
    9930              $C$DW$1046      .dwtag  DW_TAG_member
    9931                      .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$44)
    9932                      .dwattr $C$DW$1046, DW_AT_name("clarke_I")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  188

    9933                      .dwattr $C$DW$1046, DW_AT_TI_symbol_name("_clarke_I")
    9934                      .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9935                      .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
    9936              
    9937              $C$DW$1047      .dwtag  DW_TAG_member
    9938                      .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$43)
    9939                      .dwattr $C$DW$1047, DW_AT_name("clarkeHandle_V")
    9940                      .dwattr $C$DW$1047, DW_AT_TI_symbol_name("_clarkeHandle_V")
    9941                      .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9942                      .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
    9943              
    9944              $C$DW$1048      .dwtag  DW_TAG_member
    9945                      .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$44)
    9946                      .dwattr $C$DW$1048, DW_AT_name("clarke_V")
    9947                      .dwattr $C$DW$1048, DW_AT_TI_symbol_name("_clarke_V")
    9948                      .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9949                      .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
    9950              
    9951              $C$DW$1049      .dwtag  DW_TAG_member
    9952                      .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$46)
    9953                      .dwattr $C$DW$1049, DW_AT_name("estHandle")
    9954                      .dwattr $C$DW$1049, DW_AT_TI_symbol_name("_estHandle")
    9955                      .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9956                      .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
    9957              
    9958              $C$DW$1050      .dwtag  DW_TAG_member
    9959                      .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$48)
    9960                      .dwattr $C$DW$1050, DW_AT_name("parkHandle")
    9961                      .dwattr $C$DW$1050, DW_AT_TI_symbol_name("_parkHandle")
    9962                      .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9963                      .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
    9964              
    9965              $C$DW$1051      .dwtag  DW_TAG_member
    9966                      .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$49)
    9967                      .dwattr $C$DW$1051, DW_AT_name("park")
    9968                      .dwattr $C$DW$1051, DW_AT_TI_symbol_name("_park")
    9969                      .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9970                      .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
    9971              
    9972              $C$DW$1052      .dwtag  DW_TAG_member
    9973                      .dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$51)
    9974                      .dwattr $C$DW$1052, DW_AT_name("pidHandle_Id")
    9975                      .dwattr $C$DW$1052, DW_AT_TI_symbol_name("_pidHandle_Id")
    9976                      .dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9977                      .dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
    9978              
    9979              $C$DW$1053      .dwtag  DW_TAG_member
    9980                      .dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$52)
    9981                      .dwattr $C$DW$1053, DW_AT_name("pid_Id")
    9982                      .dwattr $C$DW$1053, DW_AT_TI_symbol_name("_pid_Id")
    9983                      .dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9984                      .dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
    9985              
    9986              $C$DW$1054      .dwtag  DW_TAG_member
    9987                      .dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$51)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  189

    9988                      .dwattr $C$DW$1054, DW_AT_name("pidHandle_Iq")
    9989                      .dwattr $C$DW$1054, DW_AT_TI_symbol_name("_pidHandle_Iq")
    9990                      .dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9991                      .dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
    9992              
    9993              $C$DW$1055      .dwtag  DW_TAG_member
    9994                      .dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$52)
    9995                      .dwattr $C$DW$1055, DW_AT_name("pid_Iq")
    9996                      .dwattr $C$DW$1055, DW_AT_TI_symbol_name("_pid_Iq")
    9997                      .dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9998                      .dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
    9999              
   10000              $C$DW$1056      .dwtag  DW_TAG_member
   10001                      .dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$51)
   10002                      .dwattr $C$DW$1056, DW_AT_name("pidHandle_spd")
   10003                      .dwattr $C$DW$1056, DW_AT_TI_symbol_name("_pidHandle_spd")
   10004                      .dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   10005                      .dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
   10006              
   10007              $C$DW$1057      .dwtag  DW_TAG_member
   10008                      .dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$52)
   10009                      .dwattr $C$DW$1057, DW_AT_name("pid_spd")
   10010                      .dwattr $C$DW$1057, DW_AT_TI_symbol_name("_pid_spd")
   10011                      .dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10012                      .dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
   10013              
   10014              $C$DW$1058      .dwtag  DW_TAG_member
   10015                      .dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$54)
   10016                      .dwattr $C$DW$1058, DW_AT_name("iparkHandle")
   10017                      .dwattr $C$DW$1058, DW_AT_TI_symbol_name("_iparkHandle")
   10018                      .dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
   10019                      .dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
   10020              
   10021              $C$DW$1059      .dwtag  DW_TAG_member
   10022                      .dwattr $C$DW$1059, DW_AT_type(*$C$DW$T$55)
   10023                      .dwattr $C$DW$1059, DW_AT_name("ipark")
   10024                      .dwattr $C$DW$1059, DW_AT_TI_symbol_name("_ipark")
   10025                      .dwattr $C$DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   10026                      .dwattr $C$DW$1059, DW_AT_accessibility(DW_ACCESS_public)
   10027              
   10028              $C$DW$1060      .dwtag  DW_TAG_member
   10029                      .dwattr $C$DW$1060, DW_AT_type(*$C$DW$T$57)
   10030                      .dwattr $C$DW$1060, DW_AT_name("svgenHandle")
   10031                      .dwattr $C$DW$1060, DW_AT_TI_symbol_name("_svgenHandle")
   10032                      .dwattr $C$DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   10033                      .dwattr $C$DW$1060, DW_AT_accessibility(DW_ACCESS_public)
   10034              
   10035              $C$DW$1061      .dwtag  DW_TAG_member
   10036                      .dwattr $C$DW$1061, DW_AT_type(*$C$DW$T$58)
   10037                      .dwattr $C$DW$1061, DW_AT_name("svgen")
   10038                      .dwattr $C$DW$1061, DW_AT_TI_symbol_name("_svgen")
   10039                      .dwattr $C$DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   10040                      .dwattr $C$DW$1061, DW_AT_accessibility(DW_ACCESS_public)
   10041              
   10042              $C$DW$1062      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  190

   10043                      .dwattr $C$DW$1062, DW_AT_type(*$C$DW$T$60)
   10044                      .dwattr $C$DW$1062, DW_AT_name("trajHandle_Id")
   10045                      .dwattr $C$DW$1062, DW_AT_TI_symbol_name("_trajHandle_Id")
   10046                      .dwattr $C$DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   10047                      .dwattr $C$DW$1062, DW_AT_accessibility(DW_ACCESS_public)
   10048              
   10049              $C$DW$1063      .dwtag  DW_TAG_member
   10050                      .dwattr $C$DW$1063, DW_AT_type(*$C$DW$T$61)
   10051                      .dwattr $C$DW$1063, DW_AT_name("traj_Id")
   10052                      .dwattr $C$DW$1063, DW_AT_TI_symbol_name("_traj_Id")
   10053                      .dwattr $C$DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
   10054                      .dwattr $C$DW$1063, DW_AT_accessibility(DW_ACCESS_public)
   10055              
   10056              $C$DW$1064      .dwtag  DW_TAG_member
   10057                      .dwattr $C$DW$1064, DW_AT_type(*$C$DW$T$60)
   10058                      .dwattr $C$DW$1064, DW_AT_name("trajHandle_spd")
   10059                      .dwattr $C$DW$1064, DW_AT_TI_symbol_name("_trajHandle_spd")
   10060                      .dwattr $C$DW$1064, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
   10061                      .dwattr $C$DW$1064, DW_AT_accessibility(DW_ACCESS_public)
   10062              
   10063              $C$DW$1065      .dwtag  DW_TAG_member
   10064                      .dwattr $C$DW$1065, DW_AT_type(*$C$DW$T$61)
   10065                      .dwattr $C$DW$1065, DW_AT_name("traj_spd")
   10066                      .dwattr $C$DW$1065, DW_AT_TI_symbol_name("_traj_spd")
   10067                      .dwattr $C$DW$1065, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
   10068                      .dwattr $C$DW$1065, DW_AT_accessibility(DW_ACCESS_public)
   10069              
   10070              $C$DW$1066      .dwtag  DW_TAG_member
   10071                      .dwattr $C$DW$1066, DW_AT_type(*$C$DW$T$60)
   10072                      .dwattr $C$DW$1066, DW_AT_name("trajHandle_spdMax")
   10073                      .dwattr $C$DW$1066, DW_AT_TI_symbol_name("_trajHandle_spdMax")
   10074                      .dwattr $C$DW$1066, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   10075                      .dwattr $C$DW$1066, DW_AT_accessibility(DW_ACCESS_public)
   10076              
   10077              $C$DW$1067      .dwtag  DW_TAG_member
   10078                      .dwattr $C$DW$1067, DW_AT_type(*$C$DW$T$61)
   10079                      .dwattr $C$DW$1067, DW_AT_name("traj_spdMax")
   10080                      .dwattr $C$DW$1067, DW_AT_TI_symbol_name("_traj_spdMax")
   10081                      .dwattr $C$DW$1067, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   10082                      .dwattr $C$DW$1067, DW_AT_accessibility(DW_ACCESS_public)
   10083              
   10084              $C$DW$1068      .dwtag  DW_TAG_member
   10085                      .dwattr $C$DW$1068, DW_AT_type(*$C$DW$T$62)
   10086                      .dwattr $C$DW$1068, DW_AT_name("motorParams")
   10087                      .dwattr $C$DW$1068, DW_AT_TI_symbol_name("_motorParams")
   10088                      .dwattr $C$DW$1068, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
   10089                      .dwattr $C$DW$1068, DW_AT_accessibility(DW_ACCESS_public)
   10090              
   10091              $C$DW$1069      .dwtag  DW_TAG_member
   10092                      .dwattr $C$DW$1069, DW_AT_type(*$C$DW$T$65)
   10093                      .dwattr $C$DW$1069, DW_AT_name("waitTimes")
   10094                      .dwattr $C$DW$1069, DW_AT_TI_symbol_name("_waitTimes")
   10095                      .dwattr $C$DW$1069, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   10096                      .dwattr $C$DW$1069, DW_AT_accessibility(DW_ACCESS_public)
   10097              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  191

   10098              $C$DW$1070      .dwtag  DW_TAG_member
   10099                      .dwattr $C$DW$1070, DW_AT_type(*$C$DW$T$64)
   10100                      .dwattr $C$DW$1070, DW_AT_name("counter_state")
   10101                      .dwattr $C$DW$1070, DW_AT_TI_symbol_name("_counter_state")
   10102                      .dwattr $C$DW$1070, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
   10103                      .dwattr $C$DW$1070, DW_AT_accessibility(DW_ACCESS_public)
   10104              
   10105              $C$DW$1071      .dwtag  DW_TAG_member
   10106                      .dwattr $C$DW$1071, DW_AT_type(*$C$DW$T$66)
   10107                      .dwattr $C$DW$1071, DW_AT_name("numIsrTicksPerCtrlTick")
   10108                      .dwattr $C$DW$1071, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
   10109                      .dwattr $C$DW$1071, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
   10110                      .dwattr $C$DW$1071, DW_AT_accessibility(DW_ACCESS_public)
   10111              
   10112              $C$DW$1072      .dwtag  DW_TAG_member
   10113                      .dwattr $C$DW$1072, DW_AT_type(*$C$DW$T$66)
   10114                      .dwattr $C$DW$1072, DW_AT_name("numCtrlTicksPerCurrentTick")
   10115                      .dwattr $C$DW$1072, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
   10116                      .dwattr $C$DW$1072, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
   10117                      .dwattr $C$DW$1072, DW_AT_accessibility(DW_ACCESS_public)
   10118              
   10119              $C$DW$1073      .dwtag  DW_TAG_member
   10120                      .dwattr $C$DW$1073, DW_AT_type(*$C$DW$T$66)
   10121                      .dwattr $C$DW$1073, DW_AT_name("numCtrlTicksPerSpeedTick")
   10122                      .dwattr $C$DW$1073, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
   10123                      .dwattr $C$DW$1073, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
   10124                      .dwattr $C$DW$1073, DW_AT_accessibility(DW_ACCESS_public)
   10125              
   10126              $C$DW$1074      .dwtag  DW_TAG_member
   10127                      .dwattr $C$DW$1074, DW_AT_type(*$C$DW$T$66)
   10128                      .dwattr $C$DW$1074, DW_AT_name("numCtrlTicksPerTrajTick")
   10129                      .dwattr $C$DW$1074, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
   10130                      .dwattr $C$DW$1074, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
   10131                      .dwattr $C$DW$1074, DW_AT_accessibility(DW_ACCESS_public)
   10132              
   10133              $C$DW$1075      .dwtag  DW_TAG_member
   10134                      .dwattr $C$DW$1075, DW_AT_type(*$C$DW$T$64)
   10135                      .dwattr $C$DW$1075, DW_AT_name("ctrlFreq_Hz")
   10136                      .dwattr $C$DW$1075, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
   10137                      .dwattr $C$DW$1075, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
   10138                      .dwattr $C$DW$1075, DW_AT_accessibility(DW_ACCESS_public)
   10139              
   10140              $C$DW$1076      .dwtag  DW_TAG_member
   10141                      .dwattr $C$DW$1076, DW_AT_type(*$C$DW$T$64)
   10142                      .dwattr $C$DW$1076, DW_AT_name("trajFreq_Hz")
   10143                      .dwattr $C$DW$1076, DW_AT_TI_symbol_name("_trajFreq_Hz")
   10144                      .dwattr $C$DW$1076, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
   10145                      .dwattr $C$DW$1076, DW_AT_accessibility(DW_ACCESS_public)
   10146              
   10147              $C$DW$1077      .dwtag  DW_TAG_member
   10148                      .dwattr $C$DW$1077, DW_AT_type(*$C$DW$T$31)
   10149                      .dwattr $C$DW$1077, DW_AT_name("trajPeriod_sec")
   10150                      .dwattr $C$DW$1077, DW_AT_TI_symbol_name("_trajPeriod_sec")
   10151                      .dwattr $C$DW$1077, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
   10152                      .dwattr $C$DW$1077, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  192

   10153              
   10154              $C$DW$1078      .dwtag  DW_TAG_member
   10155                      .dwattr $C$DW$1078, DW_AT_type(*$C$DW$T$67)
   10156                      .dwattr $C$DW$1078, DW_AT_name("ctrlPeriod_sec")
   10157                      .dwattr $C$DW$1078, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
   10158                      .dwattr $C$DW$1078, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
   10159                      .dwattr $C$DW$1078, DW_AT_accessibility(DW_ACCESS_public)
   10160              
   10161              $C$DW$1079      .dwtag  DW_TAG_member
   10162                      .dwattr $C$DW$1079, DW_AT_type(*$C$DW$T$31)
   10163                      .dwattr $C$DW$1079, DW_AT_name("maxVsMag_pu")
   10164                      .dwattr $C$DW$1079, DW_AT_TI_symbol_name("_maxVsMag_pu")
   10165                      .dwattr $C$DW$1079, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
   10166                      .dwattr $C$DW$1079, DW_AT_accessibility(DW_ACCESS_public)
   10167              
   10168              $C$DW$1080      .dwtag  DW_TAG_member
   10169                      .dwattr $C$DW$1080, DW_AT_type(*$C$DW$T$68)
   10170                      .dwattr $C$DW$1080, DW_AT_name("Iab_in")
   10171                      .dwattr $C$DW$1080, DW_AT_TI_symbol_name("_Iab_in")
   10172                      .dwattr $C$DW$1080, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
   10173                      .dwattr $C$DW$1080, DW_AT_accessibility(DW_ACCESS_public)
   10174              
   10175              $C$DW$1081      .dwtag  DW_TAG_member
   10176                      .dwattr $C$DW$1081, DW_AT_type(*$C$DW$T$68)
   10177                      .dwattr $C$DW$1081, DW_AT_name("Iab_filt")
   10178                      .dwattr $C$DW$1081, DW_AT_TI_symbol_name("_Iab_filt")
   10179                      .dwattr $C$DW$1081, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
   10180                      .dwattr $C$DW$1081, DW_AT_accessibility(DW_ACCESS_public)
   10181              
   10182              $C$DW$1082      .dwtag  DW_TAG_member
   10183                      .dwattr $C$DW$1082, DW_AT_type(*$C$DW$T$68)
   10184                      .dwattr $C$DW$1082, DW_AT_name("Idq_in")
   10185                      .dwattr $C$DW$1082, DW_AT_TI_symbol_name("_Idq_in")
   10186                      .dwattr $C$DW$1082, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
   10187                      .dwattr $C$DW$1082, DW_AT_accessibility(DW_ACCESS_public)
   10188              
   10189              $C$DW$1083      .dwtag  DW_TAG_member
   10190                      .dwattr $C$DW$1083, DW_AT_type(*$C$DW$T$68)
   10191                      .dwattr $C$DW$1083, DW_AT_name("Vab_in")
   10192                      .dwattr $C$DW$1083, DW_AT_TI_symbol_name("_Vab_in")
   10193                      .dwattr $C$DW$1083, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
   10194                      .dwattr $C$DW$1083, DW_AT_accessibility(DW_ACCESS_public)
   10195              
   10196              $C$DW$1084      .dwtag  DW_TAG_member
   10197                      .dwattr $C$DW$1084, DW_AT_type(*$C$DW$T$31)
   10198                      .dwattr $C$DW$1084, DW_AT_name("spd_out")
   10199                      .dwattr $C$DW$1084, DW_AT_TI_symbol_name("_spd_out")
   10200                      .dwattr $C$DW$1084, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
   10201                      .dwattr $C$DW$1084, DW_AT_accessibility(DW_ACCESS_public)
   10202              
   10203              $C$DW$1085      .dwtag  DW_TAG_member
   10204                      .dwattr $C$DW$1085, DW_AT_type(*$C$DW$T$68)
   10205                      .dwattr $C$DW$1085, DW_AT_name("Vab_out")
   10206                      .dwattr $C$DW$1085, DW_AT_TI_symbol_name("_Vab_out")
   10207                      .dwattr $C$DW$1085, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  193

   10208                      .dwattr $C$DW$1085, DW_AT_accessibility(DW_ACCESS_public)
   10209              
   10210              $C$DW$1086      .dwtag  DW_TAG_member
   10211                      .dwattr $C$DW$1086, DW_AT_type(*$C$DW$T$68)
   10212                      .dwattr $C$DW$1086, DW_AT_name("Vdq_out")
   10213                      .dwattr $C$DW$1086, DW_AT_TI_symbol_name("_Vdq_out")
   10214                      .dwattr $C$DW$1086, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
   10215                      .dwattr $C$DW$1086, DW_AT_accessibility(DW_ACCESS_public)
   10216              
   10217              $C$DW$1087      .dwtag  DW_TAG_member
   10218                      .dwattr $C$DW$1087, DW_AT_type(*$C$DW$T$67)
   10219                      .dwattr $C$DW$1087, DW_AT_name("Rhf")
   10220                      .dwattr $C$DW$1087, DW_AT_TI_symbol_name("_Rhf")
   10221                      .dwattr $C$DW$1087, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
   10222                      .dwattr $C$DW$1087, DW_AT_accessibility(DW_ACCESS_public)
   10223              
   10224              $C$DW$1088      .dwtag  DW_TAG_member
   10225                      .dwattr $C$DW$1088, DW_AT_type(*$C$DW$T$67)
   10226                      .dwattr $C$DW$1088, DW_AT_name("Lhf")
   10227                      .dwattr $C$DW$1088, DW_AT_TI_symbol_name("_Lhf")
   10228                      .dwattr $C$DW$1088, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
   10229                      .dwattr $C$DW$1088, DW_AT_accessibility(DW_ACCESS_public)
   10230              
   10231              $C$DW$1089      .dwtag  DW_TAG_member
   10232                      .dwattr $C$DW$1089, DW_AT_type(*$C$DW$T$67)
   10233                      .dwattr $C$DW$1089, DW_AT_name("RoverL")
   10234                      .dwattr $C$DW$1089, DW_AT_TI_symbol_name("_RoverL")
   10235                      .dwattr $C$DW$1089, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
   10236                      .dwattr $C$DW$1089, DW_AT_accessibility(DW_ACCESS_public)
   10237              
   10238              $C$DW$1090      .dwtag  DW_TAG_member
   10239                      .dwattr $C$DW$1090, DW_AT_type(*$C$DW$T$31)
   10240                      .dwattr $C$DW$1090, DW_AT_name("Kp_Id")
   10241                      .dwattr $C$DW$1090, DW_AT_TI_symbol_name("_Kp_Id")
   10242                      .dwattr $C$DW$1090, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
   10243                      .dwattr $C$DW$1090, DW_AT_accessibility(DW_ACCESS_public)
   10244              
   10245              $C$DW$1091      .dwtag  DW_TAG_member
   10246                      .dwattr $C$DW$1091, DW_AT_type(*$C$DW$T$31)
   10247                      .dwattr $C$DW$1091, DW_AT_name("Kp_Iq")
   10248                      .dwattr $C$DW$1091, DW_AT_TI_symbol_name("_Kp_Iq")
   10249                      .dwattr $C$DW$1091, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
   10250                      .dwattr $C$DW$1091, DW_AT_accessibility(DW_ACCESS_public)
   10251              
   10252              $C$DW$1092      .dwtag  DW_TAG_member
   10253                      .dwattr $C$DW$1092, DW_AT_type(*$C$DW$T$31)
   10254                      .dwattr $C$DW$1092, DW_AT_name("Kp_spd")
   10255                      .dwattr $C$DW$1092, DW_AT_TI_symbol_name("_Kp_spd")
   10256                      .dwattr $C$DW$1092, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
   10257                      .dwattr $C$DW$1092, DW_AT_accessibility(DW_ACCESS_public)
   10258              
   10259              $C$DW$1093      .dwtag  DW_TAG_member
   10260                      .dwattr $C$DW$1093, DW_AT_type(*$C$DW$T$31)
   10261                      .dwattr $C$DW$1093, DW_AT_name("Ki_Id")
   10262                      .dwattr $C$DW$1093, DW_AT_TI_symbol_name("_Ki_Id")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  194

   10263                      .dwattr $C$DW$1093, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
   10264                      .dwattr $C$DW$1093, DW_AT_accessibility(DW_ACCESS_public)
   10265              
   10266              $C$DW$1094      .dwtag  DW_TAG_member
   10267                      .dwattr $C$DW$1094, DW_AT_type(*$C$DW$T$31)
   10268                      .dwattr $C$DW$1094, DW_AT_name("Ki_Iq")
   10269                      .dwattr $C$DW$1094, DW_AT_TI_symbol_name("_Ki_Iq")
   10270                      .dwattr $C$DW$1094, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
   10271                      .dwattr $C$DW$1094, DW_AT_accessibility(DW_ACCESS_public)
   10272              
   10273              $C$DW$1095      .dwtag  DW_TAG_member
   10274                      .dwattr $C$DW$1095, DW_AT_type(*$C$DW$T$31)
   10275                      .dwattr $C$DW$1095, DW_AT_name("Ki_spd")
   10276                      .dwattr $C$DW$1095, DW_AT_TI_symbol_name("_Ki_spd")
   10277                      .dwattr $C$DW$1095, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
   10278                      .dwattr $C$DW$1095, DW_AT_accessibility(DW_ACCESS_public)
   10279              
   10280              $C$DW$1096      .dwtag  DW_TAG_member
   10281                      .dwattr $C$DW$1096, DW_AT_type(*$C$DW$T$31)
   10282                      .dwattr $C$DW$1096, DW_AT_name("Kd_Id")
   10283                      .dwattr $C$DW$1096, DW_AT_TI_symbol_name("_Kd_Id")
   10284                      .dwattr $C$DW$1096, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
   10285                      .dwattr $C$DW$1096, DW_AT_accessibility(DW_ACCESS_public)
   10286              
   10287              $C$DW$1097      .dwtag  DW_TAG_member
   10288                      .dwattr $C$DW$1097, DW_AT_type(*$C$DW$T$31)
   10289                      .dwattr $C$DW$1097, DW_AT_name("Kd_Iq")
   10290                      .dwattr $C$DW$1097, DW_AT_TI_symbol_name("_Kd_Iq")
   10291                      .dwattr $C$DW$1097, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
   10292                      .dwattr $C$DW$1097, DW_AT_accessibility(DW_ACCESS_public)
   10293              
   10294              $C$DW$1098      .dwtag  DW_TAG_member
   10295                      .dwattr $C$DW$1098, DW_AT_type(*$C$DW$T$31)
   10296                      .dwattr $C$DW$1098, DW_AT_name("Kd_spd")
   10297                      .dwattr $C$DW$1098, DW_AT_TI_symbol_name("_Kd_spd")
   10298                      .dwattr $C$DW$1098, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
   10299                      .dwattr $C$DW$1098, DW_AT_accessibility(DW_ACCESS_public)
   10300              
   10301              $C$DW$1099      .dwtag  DW_TAG_member
   10302                      .dwattr $C$DW$1099, DW_AT_type(*$C$DW$T$31)
   10303                      .dwattr $C$DW$1099, DW_AT_name("Ui_Id")
   10304                      .dwattr $C$DW$1099, DW_AT_TI_symbol_name("_Ui_Id")
   10305                      .dwattr $C$DW$1099, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
   10306                      .dwattr $C$DW$1099, DW_AT_accessibility(DW_ACCESS_public)
   10307              
   10308              $C$DW$1100      .dwtag  DW_TAG_member
   10309                      .dwattr $C$DW$1100, DW_AT_type(*$C$DW$T$31)
   10310                      .dwattr $C$DW$1100, DW_AT_name("Ui_Iq")
   10311                      .dwattr $C$DW$1100, DW_AT_TI_symbol_name("_Ui_Iq")
   10312                      .dwattr $C$DW$1100, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
   10313                      .dwattr $C$DW$1100, DW_AT_accessibility(DW_ACCESS_public)
   10314              
   10315              $C$DW$1101      .dwtag  DW_TAG_member
   10316                      .dwattr $C$DW$1101, DW_AT_type(*$C$DW$T$31)
   10317                      .dwattr $C$DW$1101, DW_AT_name("Ui_spd")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  195

   10318                      .dwattr $C$DW$1101, DW_AT_TI_symbol_name("_Ui_spd")
   10319                      .dwattr $C$DW$1101, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
   10320                      .dwattr $C$DW$1101, DW_AT_accessibility(DW_ACCESS_public)
   10321              
   10322              $C$DW$1102      .dwtag  DW_TAG_member
   10323                      .dwattr $C$DW$1102, DW_AT_type(*$C$DW$T$68)
   10324                      .dwattr $C$DW$1102, DW_AT_name("Idq_ref")
   10325                      .dwattr $C$DW$1102, DW_AT_TI_symbol_name("_Idq_ref")
   10326                      .dwattr $C$DW$1102, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
   10327                      .dwattr $C$DW$1102, DW_AT_accessibility(DW_ACCESS_public)
   10328              
   10329              $C$DW$1103      .dwtag  DW_TAG_member
   10330                      .dwattr $C$DW$1103, DW_AT_type(*$C$DW$T$31)
   10331                      .dwattr $C$DW$1103, DW_AT_name("IdRated")
   10332                      .dwattr $C$DW$1103, DW_AT_TI_symbol_name("_IdRated")
   10333                      .dwattr $C$DW$1103, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
   10334                      .dwattr $C$DW$1103, DW_AT_accessibility(DW_ACCESS_public)
   10335              
   10336              $C$DW$1104      .dwtag  DW_TAG_member
   10337                      .dwattr $C$DW$1104, DW_AT_type(*$C$DW$T$31)
   10338                      .dwattr $C$DW$1104, DW_AT_name("spd_ref")
   10339                      .dwattr $C$DW$1104, DW_AT_TI_symbol_name("_spd_ref")
   10340                      .dwattr $C$DW$1104, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
   10341                      .dwattr $C$DW$1104, DW_AT_accessibility(DW_ACCESS_public)
   10342              
   10343              $C$DW$1105      .dwtag  DW_TAG_member
   10344                      .dwattr $C$DW$1105, DW_AT_type(*$C$DW$T$31)
   10345                      .dwattr $C$DW$1105, DW_AT_name("spd_max")
   10346                      .dwattr $C$DW$1105, DW_AT_TI_symbol_name("_spd_max")
   10347                      .dwattr $C$DW$1105, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
   10348                      .dwattr $C$DW$1105, DW_AT_accessibility(DW_ACCESS_public)
   10349              
   10350              $C$DW$1106      .dwtag  DW_TAG_member
   10351                      .dwattr $C$DW$1106, DW_AT_type(*$C$DW$T$66)
   10352                      .dwattr $C$DW$1106, DW_AT_name("counter_current")
   10353                      .dwattr $C$DW$1106, DW_AT_TI_symbol_name("_counter_current")
   10354                      .dwattr $C$DW$1106, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
   10355                      .dwattr $C$DW$1106, DW_AT_accessibility(DW_ACCESS_public)
   10356              
   10357              $C$DW$1107      .dwtag  DW_TAG_member
   10358                      .dwattr $C$DW$1107, DW_AT_type(*$C$DW$T$66)
   10359                      .dwattr $C$DW$1107, DW_AT_name("counter_isr")
   10360                      .dwattr $C$DW$1107, DW_AT_TI_symbol_name("_counter_isr")
   10361                      .dwattr $C$DW$1107, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
   10362                      .dwattr $C$DW$1107, DW_AT_accessibility(DW_ACCESS_public)
   10363              
   10364              $C$DW$1108      .dwtag  DW_TAG_member
   10365                      .dwattr $C$DW$1108, DW_AT_type(*$C$DW$T$66)
   10366                      .dwattr $C$DW$1108, DW_AT_name("counter_speed")
   10367                      .dwattr $C$DW$1108, DW_AT_TI_symbol_name("_counter_speed")
   10368                      .dwattr $C$DW$1108, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
   10369                      .dwattr $C$DW$1108, DW_AT_accessibility(DW_ACCESS_public)
   10370              
   10371              $C$DW$1109      .dwtag  DW_TAG_member
   10372                      .dwattr $C$DW$1109, DW_AT_type(*$C$DW$T$66)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  196

   10373                      .dwattr $C$DW$1109, DW_AT_name("counter_traj")
   10374                      .dwattr $C$DW$1109, DW_AT_TI_symbol_name("_counter_traj")
   10375                      .dwattr $C$DW$1109, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
   10376                      .dwattr $C$DW$1109, DW_AT_accessibility(DW_ACCESS_public)
   10377              
   10378              $C$DW$1110      .dwtag  DW_TAG_member
   10379                      .dwattr $C$DW$1110, DW_AT_type(*$C$DW$T$69)
   10380                      .dwattr $C$DW$1110, DW_AT_name("flag_enableCtrl")
   10381                      .dwattr $C$DW$1110, DW_AT_TI_symbol_name("_flag_enableCtrl")
   10382                      .dwattr $C$DW$1110, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
   10383                      .dwattr $C$DW$1110, DW_AT_accessibility(DW_ACCESS_public)
   10384              
   10385              $C$DW$1111      .dwtag  DW_TAG_member
   10386                      .dwattr $C$DW$1111, DW_AT_type(*$C$DW$T$69)
   10387                      .dwattr $C$DW$1111, DW_AT_name("flag_enableDcBusComp")
   10388                      .dwattr $C$DW$1111, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
   10389                      .dwattr $C$DW$1111, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
   10390                      .dwattr $C$DW$1111, DW_AT_accessibility(DW_ACCESS_public)
   10391              
   10392              $C$DW$1112      .dwtag  DW_TAG_member
   10393                      .dwattr $C$DW$1112, DW_AT_type(*$C$DW$T$69)
   10394                      .dwattr $C$DW$1112, DW_AT_name("flag_enablePowerWarp")
   10395                      .dwattr $C$DW$1112, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
   10396                      .dwattr $C$DW$1112, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
   10397                      .dwattr $C$DW$1112, DW_AT_accessibility(DW_ACCESS_public)
   10398              
   10399              $C$DW$1113      .dwtag  DW_TAG_member
   10400                      .dwattr $C$DW$1113, DW_AT_type(*$C$DW$T$69)
   10401                      .dwattr $C$DW$1113, DW_AT_name("flag_enableOffset")
   10402                      .dwattr $C$DW$1113, DW_AT_TI_symbol_name("_flag_enableOffset")
   10403                      .dwattr $C$DW$1113, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
   10404                      .dwattr $C$DW$1113, DW_AT_accessibility(DW_ACCESS_public)
   10405              
   10406              $C$DW$1114      .dwtag  DW_TAG_member
   10407                      .dwattr $C$DW$1114, DW_AT_type(*$C$DW$T$69)
   10408                      .dwattr $C$DW$1114, DW_AT_name("flag_enableSpeedCtrl")
   10409                      .dwattr $C$DW$1114, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
   10410                      .dwattr $C$DW$1114, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
   10411                      .dwattr $C$DW$1114, DW_AT_accessibility(DW_ACCESS_public)
   10412              
   10413              $C$DW$1115      .dwtag  DW_TAG_member
   10414                      .dwattr $C$DW$1115, DW_AT_type(*$C$DW$T$69)
   10415                      .dwattr $C$DW$1115, DW_AT_name("flag_enableUserMotorParams")
   10416                      .dwattr $C$DW$1115, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
   10417                      .dwattr $C$DW$1115, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
   10418                      .dwattr $C$DW$1115, DW_AT_accessibility(DW_ACCESS_public)
   10419              
   10420              $C$DW$1116      .dwtag  DW_TAG_member
   10421                      .dwattr $C$DW$1116, DW_AT_type(*$C$DW$T$68)
   10422                      .dwattr $C$DW$1116, DW_AT_name("Idq_offset_pu")
   10423                      .dwattr $C$DW$1116, DW_AT_TI_symbol_name("_Idq_offset_pu")
   10424                      .dwattr $C$DW$1116, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
   10425                      .dwattr $C$DW$1116, DW_AT_accessibility(DW_ACCESS_public)
   10426              
   10427              $C$DW$1117      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  197

   10428                      .dwattr $C$DW$1117, DW_AT_type(*$C$DW$T$68)
   10429                      .dwattr $C$DW$1117, DW_AT_name("Vdq_offset_pu")
   10430                      .dwattr $C$DW$1117, DW_AT_TI_symbol_name("_Vdq_offset_pu")
   10431                      .dwattr $C$DW$1117, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
   10432                      .dwattr $C$DW$1117, DW_AT_accessibility(DW_ACCESS_public)
   10433              
   10434              $C$DW$1118      .dwtag  DW_TAG_member
   10435                      .dwattr $C$DW$1118, DW_AT_type(*$C$DW$T$31)
   10436                      .dwattr $C$DW$1118, DW_AT_name("angle_pu")
   10437                      .dwattr $C$DW$1118, DW_AT_TI_symbol_name("_angle_pu")
   10438                      .dwattr $C$DW$1118, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
   10439                      .dwattr $C$DW$1118, DW_AT_accessibility(DW_ACCESS_public)
   10440              
   10441              $C$DW$1119      .dwtag  DW_TAG_member
   10442                      .dwattr $C$DW$1119, DW_AT_type(*$C$DW$T$31)
   10443                      .dwattr $C$DW$1119, DW_AT_name("speed_ref_pu")
   10444                      .dwattr $C$DW$1119, DW_AT_TI_symbol_name("_speed_ref_pu")
   10445                      .dwattr $C$DW$1119, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
   10446                      .dwattr $C$DW$1119, DW_AT_accessibility(DW_ACCESS_public)
   10447              
   10448              $C$DW$1120      .dwtag  DW_TAG_member
   10449                      .dwattr $C$DW$1120, DW_AT_type(*$C$DW$T$31)
   10450                      .dwattr $C$DW$1120, DW_AT_name("speed_fb_pu")
   10451                      .dwattr $C$DW$1120, DW_AT_TI_symbol_name("_speed_fb_pu")
   10452                      .dwattr $C$DW$1120, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
   10453                      .dwattr $C$DW$1120, DW_AT_accessibility(DW_ACCESS_public)
   10454              
   10455              $C$DW$1121      .dwtag  DW_TAG_member
   10456                      .dwattr $C$DW$1121, DW_AT_type(*$C$DW$T$31)
   10457                      .dwattr $C$DW$1121, DW_AT_name("speed_outMax_pu")
   10458                      .dwattr $C$DW$1121, DW_AT_TI_symbol_name("_speed_outMax_pu")
   10459                      .dwattr $C$DW$1121, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
   10460                      .dwattr $C$DW$1121, DW_AT_accessibility(DW_ACCESS_public)
   10461              
   10462              $C$DW$1122      .dwtag  DW_TAG_member
   10463                      .dwattr $C$DW$1122, DW_AT_type(*$C$DW$T$69)
   10464                      .dwattr $C$DW$1122, DW_AT_name("flag_enableCurrentCtrl")
   10465                      .dwattr $C$DW$1122, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
   10466                      .dwattr $C$DW$1122, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
   10467                      .dwattr $C$DW$1122, DW_AT_accessibility(DW_ACCESS_public)
   10468              
   10469                      .dwendtag $C$DW$T$70
   10470              
   10471              $C$DW$T$180     .dwtag  DW_TAG_typedef
   10472                      .dwattr $C$DW$T$180, DW_AT_name("CTRL_Obj")
   10473                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$70)
   10474                      .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
   10475              
   10476              $C$DW$T$167     .dwtag  DW_TAG_pointer_type
   10477                      .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$70)
   10478                      .dwattr $C$DW$T$167, DW_AT_address_class(0x20)
   10479              
   10480              $C$DW$T$168     .dwtag  DW_TAG_typedef
   10481                      .dwattr $C$DW$T$168, DW_AT_name("CTRL_Handle")
   10482                      .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$167)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  198

   10483                      .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
   10484              
   10485              $C$DW$1123      .dwtag  DW_TAG_TI_far_type
   10486                      .dwattr $C$DW$1123, DW_AT_type(*$C$DW$T$168)
   10487              
   10488              $C$DW$T$181     .dwtag  DW_TAG_const_type
   10489                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$1123)
   10490              
   10491              
   10492              $C$DW$T$73      .dwtag  DW_TAG_structure_type
   10493                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
   10494                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
   10495              $C$DW$1124      .dwtag  DW_TAG_member
   10496                      .dwattr $C$DW$1124, DW_AT_type(*$C$DW$T$22)
   10497                      .dwattr $C$DW$1124, DW_AT_name("rsvd")
   10498                      .dwattr $C$DW$1124, DW_AT_TI_symbol_name("_rsvd")
   10499                      .dwattr $C$DW$1124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10500                      .dwattr $C$DW$1124, DW_AT_accessibility(DW_ACCESS_public)
   10501              
   10502              $C$DW$1125      .dwtag  DW_TAG_member
   10503                      .dwattr $C$DW$1125, DW_AT_type(*$C$DW$T$72)
   10504                      .dwattr $C$DW$1125, DW_AT_name("targetProc")
   10505                      .dwattr $C$DW$1125, DW_AT_TI_symbol_name("_targetProc")
   10506                      .dwattr $C$DW$1125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10507                      .dwattr $C$DW$1125, DW_AT_accessibility(DW_ACCESS_public)
   10508              
   10509              $C$DW$1126      .dwtag  DW_TAG_member
   10510                      .dwattr $C$DW$1126, DW_AT_type(*$C$DW$T$22)
   10511                      .dwattr $C$DW$1126, DW_AT_name("major")
   10512                      .dwattr $C$DW$1126, DW_AT_TI_symbol_name("_major")
   10513                      .dwattr $C$DW$1126, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10514                      .dwattr $C$DW$1126, DW_AT_accessibility(DW_ACCESS_public)
   10515              
   10516              $C$DW$1127      .dwtag  DW_TAG_member
   10517                      .dwattr $C$DW$1127, DW_AT_type(*$C$DW$T$22)
   10518                      .dwattr $C$DW$1127, DW_AT_name("minor")
   10519                      .dwattr $C$DW$1127, DW_AT_TI_symbol_name("_minor")
   10520                      .dwattr $C$DW$1127, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10521                      .dwattr $C$DW$1127, DW_AT_accessibility(DW_ACCESS_public)
   10522              
   10523                      .dwendtag $C$DW$T$73
   10524              
   10525              $C$DW$T$37      .dwtag  DW_TAG_typedef
   10526                      .dwattr $C$DW$T$37, DW_AT_name("CTRL_Version")
   10527                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
   10528                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
   10529              
   10530              
   10531              $C$DW$T$80      .dwtag  DW_TAG_structure_type
   10532                      .dwattr $C$DW$T$80, DW_AT_name("_DRV8305_Obj_")
   10533                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
   10534              $C$DW$1128      .dwtag  DW_TAG_member
   10535                      .dwattr $C$DW$1128, DW_AT_type(*$C$DW$T$75)
   10536                      .dwattr $C$DW$1128, DW_AT_name("spiHandle")
   10537                      .dwattr $C$DW$1128, DW_AT_TI_symbol_name("_spiHandle")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  199

   10538                      .dwattr $C$DW$1128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10539                      .dwattr $C$DW$1128, DW_AT_accessibility(DW_ACCESS_public)
   10540              
   10541              $C$DW$1129      .dwtag  DW_TAG_member
   10542                      .dwattr $C$DW$1129, DW_AT_type(*$C$DW$T$77)
   10543                      .dwattr $C$DW$1129, DW_AT_name("gpioHandle")
   10544                      .dwattr $C$DW$1129, DW_AT_TI_symbol_name("_gpioHandle")
   10545                      .dwattr $C$DW$1129, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10546                      .dwattr $C$DW$1129, DW_AT_accessibility(DW_ACCESS_public)
   10547              
   10548              $C$DW$1130      .dwtag  DW_TAG_member
   10549                      .dwattr $C$DW$1130, DW_AT_type(*$C$DW$T$79)
   10550                      .dwattr $C$DW$1130, DW_AT_name("gpioNumber")
   10551                      .dwattr $C$DW$1130, DW_AT_TI_symbol_name("_gpioNumber")
   10552                      .dwattr $C$DW$1130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10553                      .dwattr $C$DW$1130, DW_AT_accessibility(DW_ACCESS_public)
   10554              
   10555              $C$DW$1131      .dwtag  DW_TAG_member
   10556                      .dwattr $C$DW$1131, DW_AT_type(*$C$DW$T$69)
   10557                      .dwattr $C$DW$1131, DW_AT_name("RxTimeOut")
   10558                      .dwattr $C$DW$1131, DW_AT_TI_symbol_name("_RxTimeOut")
   10559                      .dwattr $C$DW$1131, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10560                      .dwattr $C$DW$1131, DW_AT_accessibility(DW_ACCESS_public)
   10561              
   10562              $C$DW$1132      .dwtag  DW_TAG_member
   10563                      .dwattr $C$DW$1132, DW_AT_type(*$C$DW$T$69)
   10564                      .dwattr $C$DW$1132, DW_AT_name("enableTimeOut")
   10565                      .dwattr $C$DW$1132, DW_AT_TI_symbol_name("_enableTimeOut")
   10566                      .dwattr $C$DW$1132, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10567                      .dwattr $C$DW$1132, DW_AT_accessibility(DW_ACCESS_public)
   10568              
   10569                      .dwendtag $C$DW$T$80
   10570              
   10571              $C$DW$T$122     .dwtag  DW_TAG_typedef
   10572                      .dwattr $C$DW$T$122, DW_AT_name("DRV8305_Obj")
   10573                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$80)
   10574                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
   10575              
   10576              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
   10577                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$80)
   10578                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
   10579              
   10580              $C$DW$T$121     .dwtag  DW_TAG_typedef
   10581                      .dwattr $C$DW$T$121, DW_AT_name("DRV8305_Handle")
   10582                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
   10583                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
   10584              
   10585              
   10586              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   10587                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
   10588                      .dwattr $C$DW$T$19, DW_AT_declaration
   10589                      .dwendtag $C$DW$T$19
   10590              
   10591              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
   10592                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  200

   10593                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
   10594              
   10595              $C$DW$T$46      .dwtag  DW_TAG_typedef
   10596                      .dwattr $C$DW$T$46, DW_AT_name("EST_Handle")
   10597                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
   10598                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
   10599              
   10600              
   10601              $C$DW$T$81      .dwtag  DW_TAG_structure_type
   10602                      .dwattr $C$DW$T$81, DW_AT_name("_FILTER_FO_")
   10603                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0a)
   10604              $C$DW$1133      .dwtag  DW_TAG_member
   10605                      .dwattr $C$DW$1133, DW_AT_type(*$C$DW$T$31)
   10606                      .dwattr $C$DW$1133, DW_AT_name("a1")
   10607                      .dwattr $C$DW$1133, DW_AT_TI_symbol_name("_a1")
   10608                      .dwattr $C$DW$1133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10609                      .dwattr $C$DW$1133, DW_AT_accessibility(DW_ACCESS_public)
   10610              
   10611              $C$DW$1134      .dwtag  DW_TAG_member
   10612                      .dwattr $C$DW$1134, DW_AT_type(*$C$DW$T$31)
   10613                      .dwattr $C$DW$1134, DW_AT_name("b0")
   10614                      .dwattr $C$DW$1134, DW_AT_TI_symbol_name("_b0")
   10615                      .dwattr $C$DW$1134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10616                      .dwattr $C$DW$1134, DW_AT_accessibility(DW_ACCESS_public)
   10617              
   10618              $C$DW$1135      .dwtag  DW_TAG_member
   10619                      .dwattr $C$DW$1135, DW_AT_type(*$C$DW$T$31)
   10620                      .dwattr $C$DW$1135, DW_AT_name("b1")
   10621                      .dwattr $C$DW$1135, DW_AT_TI_symbol_name("_b1")
   10622                      .dwattr $C$DW$1135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10623                      .dwattr $C$DW$1135, DW_AT_accessibility(DW_ACCESS_public)
   10624              
   10625              $C$DW$1136      .dwtag  DW_TAG_member
   10626                      .dwattr $C$DW$1136, DW_AT_type(*$C$DW$T$31)
   10627                      .dwattr $C$DW$1136, DW_AT_name("x1")
   10628                      .dwattr $C$DW$1136, DW_AT_TI_symbol_name("_x1")
   10629                      .dwattr $C$DW$1136, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10630                      .dwattr $C$DW$1136, DW_AT_accessibility(DW_ACCESS_public)
   10631              
   10632              $C$DW$1137      .dwtag  DW_TAG_member
   10633                      .dwattr $C$DW$1137, DW_AT_type(*$C$DW$T$31)
   10634                      .dwattr $C$DW$1137, DW_AT_name("y1")
   10635                      .dwattr $C$DW$1137, DW_AT_TI_symbol_name("_y1")
   10636                      .dwattr $C$DW$1137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10637                      .dwattr $C$DW$1137, DW_AT_accessibility(DW_ACCESS_public)
   10638              
   10639                      .dwendtag $C$DW$T$81
   10640              
   10641              $C$DW$T$133     .dwtag  DW_TAG_typedef
   10642                      .dwattr $C$DW$T$133, DW_AT_name("FILTER_FO_Obj")
   10643                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$81)
   10644                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
   10645              
   10646              $C$DW$T$183     .dwtag  DW_TAG_pointer_type
   10647                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$133)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  201

   10648                      .dwattr $C$DW$T$183, DW_AT_address_class(0x20)
   10649              
   10650              
   10651              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   10652                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
   10653                      .dwattr $C$DW$T$20, DW_AT_declaration
   10654                      .dwendtag $C$DW$T$20
   10655              
   10656              $C$DW$T$134     .dwtag  DW_TAG_pointer_type
   10657                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$20)
   10658                      .dwattr $C$DW$T$134, DW_AT_address_class(0x20)
   10659              
   10660              $C$DW$T$135     .dwtag  DW_TAG_typedef
   10661                      .dwattr $C$DW$T$135, DW_AT_name("FILTER_FO_Handle")
   10662                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
   10663                      .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
   10664              
   10665              
   10666              $C$DW$T$82      .dwtag  DW_TAG_structure_type
   10667                      .dwattr $C$DW$T$82, DW_AT_name("_FLASH_Obj_")
   10668                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x08)
   10669              $C$DW$1138      .dwtag  DW_TAG_member
   10670                      .dwattr $C$DW$1138, DW_AT_type(*$C$DW$T$23)
   10671                      .dwattr $C$DW$1138, DW_AT_name("FOPT")
   10672                      .dwattr $C$DW$1138, DW_AT_TI_symbol_name("_FOPT")
   10673                      .dwattr $C$DW$1138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10674                      .dwattr $C$DW$1138, DW_AT_accessibility(DW_ACCESS_public)
   10675              
   10676              $C$DW$1139      .dwtag  DW_TAG_member
   10677                      .dwattr $C$DW$1139, DW_AT_type(*$C$DW$T$23)
   10678                      .dwattr $C$DW$1139, DW_AT_name("rsvd_1")
   10679                      .dwattr $C$DW$1139, DW_AT_TI_symbol_name("_rsvd_1")
   10680                      .dwattr $C$DW$1139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10681                      .dwattr $C$DW$1139, DW_AT_accessibility(DW_ACCESS_public)
   10682              
   10683              $C$DW$1140      .dwtag  DW_TAG_member
   10684                      .dwattr $C$DW$1140, DW_AT_type(*$C$DW$T$23)
   10685                      .dwattr $C$DW$1140, DW_AT_name("FPWR")
   10686                      .dwattr $C$DW$1140, DW_AT_TI_symbol_name("_FPWR")
   10687                      .dwattr $C$DW$1140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10688                      .dwattr $C$DW$1140, DW_AT_accessibility(DW_ACCESS_public)
   10689              
   10690              $C$DW$1141      .dwtag  DW_TAG_member
   10691                      .dwattr $C$DW$1141, DW_AT_type(*$C$DW$T$23)
   10692                      .dwattr $C$DW$1141, DW_AT_name("FSTATUS")
   10693                      .dwattr $C$DW$1141, DW_AT_TI_symbol_name("_FSTATUS")
   10694                      .dwattr $C$DW$1141, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10695                      .dwattr $C$DW$1141, DW_AT_accessibility(DW_ACCESS_public)
   10696              
   10697              $C$DW$1142      .dwtag  DW_TAG_member
   10698                      .dwattr $C$DW$1142, DW_AT_type(*$C$DW$T$23)
   10699                      .dwattr $C$DW$1142, DW_AT_name("FSTDBYWAIT")
   10700                      .dwattr $C$DW$1142, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   10701                      .dwattr $C$DW$1142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10702                      .dwattr $C$DW$1142, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  202

   10703              
   10704              $C$DW$1143      .dwtag  DW_TAG_member
   10705                      .dwattr $C$DW$1143, DW_AT_type(*$C$DW$T$23)
   10706                      .dwattr $C$DW$1143, DW_AT_name("FACTIVEWAIT")
   10707                      .dwattr $C$DW$1143, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   10708                      .dwattr $C$DW$1143, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10709                      .dwattr $C$DW$1143, DW_AT_accessibility(DW_ACCESS_public)
   10710              
   10711              $C$DW$1144      .dwtag  DW_TAG_member
   10712                      .dwattr $C$DW$1144, DW_AT_type(*$C$DW$T$23)
   10713                      .dwattr $C$DW$1144, DW_AT_name("FBANKWAIT")
   10714                      .dwattr $C$DW$1144, DW_AT_TI_symbol_name("_FBANKWAIT")
   10715                      .dwattr $C$DW$1144, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10716                      .dwattr $C$DW$1144, DW_AT_accessibility(DW_ACCESS_public)
   10717              
   10718              $C$DW$1145      .dwtag  DW_TAG_member
   10719                      .dwattr $C$DW$1145, DW_AT_type(*$C$DW$T$23)
   10720                      .dwattr $C$DW$1145, DW_AT_name("FOTPWAIT")
   10721                      .dwattr $C$DW$1145, DW_AT_TI_symbol_name("_FOTPWAIT")
   10722                      .dwattr $C$DW$1145, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10723                      .dwattr $C$DW$1145, DW_AT_accessibility(DW_ACCESS_public)
   10724              
   10725                      .dwendtag $C$DW$T$82
   10726              
   10727              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
   10728                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$82)
   10729                      .dwattr $C$DW$T$95, DW_AT_address_class(0x20)
   10730              
   10731              $C$DW$T$96      .dwtag  DW_TAG_typedef
   10732                      .dwattr $C$DW$T$96, DW_AT_name("FLASH_Handle")
   10733                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
   10734                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
   10735              
   10736              
   10737              $C$DW$T$86      .dwtag  DW_TAG_structure_type
   10738                      .dwattr $C$DW$T$86, DW_AT_name("_GPIO_Obj_")
   10739                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x6a)
   10740              $C$DW$1146      .dwtag  DW_TAG_member
   10741                      .dwattr $C$DW$1146, DW_AT_type(*$C$DW$T$83)
   10742                      .dwattr $C$DW$1146, DW_AT_name("GPACTRL")
   10743                      .dwattr $C$DW$1146, DW_AT_TI_symbol_name("_GPACTRL")
   10744                      .dwattr $C$DW$1146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10745                      .dwattr $C$DW$1146, DW_AT_accessibility(DW_ACCESS_public)
   10746              
   10747              $C$DW$1147      .dwtag  DW_TAG_member
   10748                      .dwattr $C$DW$1147, DW_AT_type(*$C$DW$T$83)
   10749                      .dwattr $C$DW$1147, DW_AT_name("GPAQSEL1")
   10750                      .dwattr $C$DW$1147, DW_AT_TI_symbol_name("_GPAQSEL1")
   10751                      .dwattr $C$DW$1147, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10752                      .dwattr $C$DW$1147, DW_AT_accessibility(DW_ACCESS_public)
   10753              
   10754              $C$DW$1148      .dwtag  DW_TAG_member
   10755                      .dwattr $C$DW$1148, DW_AT_type(*$C$DW$T$83)
   10756                      .dwattr $C$DW$1148, DW_AT_name("GPAQSEL2")
   10757                      .dwattr $C$DW$1148, DW_AT_TI_symbol_name("_GPAQSEL2")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{8C592EB2-B3CB-495A-BA85-4492A4A9161B} PAGE  203

   10758                      .dwattr $C$DW$1148, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10759                      .dwattr $C$DW$1148, DW_AT_accessibility(DW_ACCESS_public)
   10760              
   10761              $C$DW$1149      .dwtag  DW_TAG_member
   10762                      .dwattr $C$DW$1149, DW_AT_type(*$C$DW$T$83)
   10763                      .dwattr $C$DW$1149, DW_AT_name("GPAMUX1")
   10764                      .dwattr $C$DW$1149, DW_AT_TI_symbol_name("_GPAMUX1")
   10765                      .dwattr $C$DW$1149, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10766                      .dwattr $C$DW$1149, DW_AT_accessibility(DW_ACCESS_public)
   10767              
   10768              $C$DW$1150      .dwtag  DW_TAG_member
   10769                      .dwattr $C$DW$1150, DW_AT_type(*$C$DW$T$83)
   10770                      .dwattr $C$DW$1150, DW_AT_name("GPAMUX2")
