TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Sun Jun 17 14:52:12 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/drivers/drvic/drv8305/src/32b/f
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8082                      .dwattr $C$DW$676, DW_AT_const_value(0x5800)
    8083              
    8084              $C$DW$677       .dwtag  DW_TAG_enumerator
    8085                      .dwattr $C$DW$677, DW_AT_name("Address_Control_C")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  154

    8086                      .dwattr $C$DW$677, DW_AT_const_value(0x6000)
    8087              
    8088                      .dwendtag $C$DW$T$181
    8089              
    8090              $C$DW$T$182     .dwtag  DW_TAG_typedef
    8091                      .dwattr $C$DW$T$182, DW_AT_name("DRV8305_Address_e")
    8092                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$181)
    8093                      .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    8094              
    8095              $C$DW$678       .dwtag  DW_TAG_TI_far_type
    8096                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$182)
    8097              
    8098              $C$DW$T$183     .dwtag  DW_TAG_const_type
    8099                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$678)
    8100              
    8101              
    8102              $C$DW$T$184     .dwtag  DW_TAG_enumeration_type
    8103                      .dwattr $C$DW$T$184, DW_AT_byte_size(0x01)
    8104              $C$DW$679       .dwtag  DW_TAG_enumerator
    8105                      .dwattr $C$DW$679, DW_AT_name("DcCalMode_Ch1_Load")
    8106                      .dwattr $C$DW$679, DW_AT_const_value(0x00)
    8107              
    8108              $C$DW$680       .dwtag  DW_TAG_enumerator
    8109                      .dwattr $C$DW$680, DW_AT_name("DcCalMode_Ch1_NoLoad")
    8110                      .dwattr $C$DW$680, DW_AT_const_value(0x100)
    8111              
    8112              $C$DW$681       .dwtag  DW_TAG_enumerator
    8113                      .dwattr $C$DW$681, DW_AT_name("DcCalMode_Ch2_Load")
    8114                      .dwattr $C$DW$681, DW_AT_const_value(0x00)
    8115              
    8116              $C$DW$682       .dwtag  DW_TAG_enumerator
    8117                      .dwattr $C$DW$682, DW_AT_name("DcCalMode_Ch2_NoLoad")
    8118                      .dwattr $C$DW$682, DW_AT_const_value(0x200)
    8119              
    8120              $C$DW$683       .dwtag  DW_TAG_enumerator
    8121                      .dwattr $C$DW$683, DW_AT_name("DcCalMode_Ch3_Load")
    8122                      .dwattr $C$DW$683, DW_AT_const_value(0x00)
    8123              
    8124              $C$DW$684       .dwtag  DW_TAG_enumerator
    8125                      .dwattr $C$DW$684, DW_AT_name("DcCalMode_Ch3_NoLoad")
    8126                      .dwattr $C$DW$684, DW_AT_const_value(0x400)
    8127              
    8128                      .dwendtag $C$DW$T$184
    8129              
    8130              $C$DW$T$185     .dwtag  DW_TAG_typedef
    8131                      .dwattr $C$DW$T$185, DW_AT_name("DRV8305_CTRL0A_DcCalMode_e")
    8132                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$184)
    8133                      .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    8134              
    8135              $C$DW$685       .dwtag  DW_TAG_TI_far_type
    8136                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$185)
    8137              
    8138              $C$DW$T$186     .dwtag  DW_TAG_const_type
    8139                      .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$685)
    8140              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  155

    8141              
    8142              $C$DW$T$187     .dwtag  DW_TAG_enumeration_type
    8143                      .dwattr $C$DW$T$187, DW_AT_byte_size(0x01)
    8144              $C$DW$686       .dwtag  DW_TAG_enumerator
    8145                      .dwattr $C$DW$686, DW_AT_name("ShuntAmpNumber_1")
    8146                      .dwattr $C$DW$686, DW_AT_const_value(0x01)
    8147              
    8148              $C$DW$687       .dwtag  DW_TAG_enumerator
    8149                      .dwattr $C$DW$687, DW_AT_name("ShuntAmpNumber_2")
    8150                      .dwattr $C$DW$687, DW_AT_const_value(0x02)
    8151              
    8152              $C$DW$688       .dwtag  DW_TAG_enumerator
    8153                      .dwattr $C$DW$688, DW_AT_name("ShuntAmpNumber_3")
    8154                      .dwattr $C$DW$688, DW_AT_const_value(0x03)
    8155              
    8156                      .dwendtag $C$DW$T$187
    8157              
    8158              $C$DW$T$188     .dwtag  DW_TAG_typedef
    8159                      .dwattr $C$DW$T$188, DW_AT_name("DRV8305_ShuntAmpNumber_e")
    8160                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$187)
    8161                      .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    8162              
    8163              $C$DW$689       .dwtag  DW_TAG_TI_far_type
    8164                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$188)
    8165              
    8166              $C$DW$T$189     .dwtag  DW_TAG_const_type
    8167                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$689)
    8168              
    8169              
    8170              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    8171                      .dwattr $C$DW$T$26, DW_AT_name("_DRV8305_Obj_")
    8172                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    8173              $C$DW$690       .dwtag  DW_TAG_member
    8174                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$20)
    8175                      .dwattr $C$DW$690, DW_AT_name("spiHandle")
    8176                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_spiHandle")
    8177                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8178                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    8179              
    8180              $C$DW$691       .dwtag  DW_TAG_member
    8181                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$22)
    8182                      .dwattr $C$DW$691, DW_AT_name("gpioHandle")
    8183                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_gpioHandle")
    8184                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8185                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    8186              
    8187              $C$DW$692       .dwtag  DW_TAG_member
    8188                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$24)
    8189                      .dwattr $C$DW$692, DW_AT_name("gpioNumber")
    8190                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_gpioNumber")
    8191                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8192                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    8193              
    8194              $C$DW$693       .dwtag  DW_TAG_member
    8195                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  156

    8196                      .dwattr $C$DW$693, DW_AT_name("RxTimeOut")
    8197                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_RxTimeOut")
    8198                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8199                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    8200              
    8201              $C$DW$694       .dwtag  DW_TAG_member
    8202                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$25)
    8203                      .dwattr $C$DW$694, DW_AT_name("enableTimeOut")
    8204                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_enableTimeOut")
    8205                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8206                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    8207              
    8208                      .dwendtag $C$DW$T$26
    8209              
    8210              $C$DW$T$192     .dwtag  DW_TAG_typedef
    8211                      .dwattr $C$DW$T$192, DW_AT_name("DRV8305_Obj")
    8212                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$26)
    8213                      .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    8214              
    8215              $C$DW$T$109     .dwtag  DW_TAG_pointer_type
    8216                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$26)
    8217                      .dwattr $C$DW$T$109, DW_AT_address_class(0x20)
    8218              
    8219              $C$DW$T$110     .dwtag  DW_TAG_typedef
    8220                      .dwattr $C$DW$T$110, DW_AT_name("DRV8305_Handle")
    8221                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    8222                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    8223              
    8224              $C$DW$695       .dwtag  DW_TAG_TI_far_type
    8225                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$110)
    8226              
    8227              $C$DW$T$193     .dwtag  DW_TAG_const_type
    8228                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$695)
    8229              
    8230              
    8231              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    8232                      .dwattr $C$DW$T$33, DW_AT_name("_DRV_SPI_8305_Ctrl05_t_")
    8233                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    8234              $C$DW$696       .dwtag  DW_TAG_member
    8235                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$28)
    8236                      .dwattr $C$DW$696, DW_AT_name("IDRIVEP_HS")
    8237                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_IDRIVEP_HS")
    8238                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8239                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    8240              
    8241              $C$DW$697       .dwtag  DW_TAG_member
    8242                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$30)
    8243                      .dwattr $C$DW$697, DW_AT_name("IDRIVEN_HS")
    8244                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_IDRIVEN_HS")
    8245                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8246                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    8247              
    8248              $C$DW$698       .dwtag  DW_TAG_member
    8249                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$32)
    8250                      .dwattr $C$DW$698, DW_AT_name("TDRIVEN")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  157

    8251                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_TDRIVEN")
    8252                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8253                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    8254              
    8255              $C$DW$699       .dwtag  DW_TAG_member
    8256                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$25)
    8257                      .dwattr $C$DW$699, DW_AT_name("CTRL05_RSV1")
    8258                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_CTRL05_RSV1")
    8259                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8260                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    8261              
    8262                      .dwendtag $C$DW$T$33
    8263              
    8264              $C$DW$T$86      .dwtag  DW_TAG_typedef
    8265                      .dwattr $C$DW$T$86, DW_AT_name("DRV_SPI_8305_Ctrl05_t_")
    8266                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$33)
    8267                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    8268              
    8269              
    8270              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    8271                      .dwattr $C$DW$T$40, DW_AT_name("_DRV_SPI_8305_Ctrl06_t_")
    8272                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    8273              $C$DW$700       .dwtag  DW_TAG_member
    8274                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$35)
    8275                      .dwattr $C$DW$700, DW_AT_name("IDRIVEP_LS")
    8276                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_IDRIVEP_LS")
    8277                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8278                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    8279              
    8280              $C$DW$701       .dwtag  DW_TAG_member
    8281                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$37)
    8282                      .dwattr $C$DW$701, DW_AT_name("IDRIVEN_LS")
    8283                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_IDRIVEN_LS")
    8284                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8285                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    8286              
    8287              $C$DW$702       .dwtag  DW_TAG_member
    8288                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$39)
    8289                      .dwattr $C$DW$702, DW_AT_name("TDRIVEP")
    8290                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_TDRIVEP")
    8291                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8292                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    8293              
    8294              $C$DW$703       .dwtag  DW_TAG_member
    8295                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$25)
    8296                      .dwattr $C$DW$703, DW_AT_name("CTRL06_RSV1")
    8297                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_CTRL06_RSV1")
    8298                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8299                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    8300              
    8301                      .dwendtag $C$DW$T$40
    8302              
    8303              $C$DW$T$87      .dwtag  DW_TAG_typedef
    8304                      .dwattr $C$DW$T$87, DW_AT_name("DRV_SPI_8305_Ctrl06_t_")
    8305                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  158

    8306                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    8307              
    8308              
    8309              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    8310                      .dwattr $C$DW$T$51, DW_AT_name("_DRV_SPI_8305_Ctrl07_t_")
    8311                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x06)
    8312              $C$DW$704       .dwtag  DW_TAG_member
    8313                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$42)
    8314                      .dwattr $C$DW$704, DW_AT_name("TVDS")
    8315                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_TVDS")
    8316                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8317                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    8318              
    8319              $C$DW$705       .dwtag  DW_TAG_member
    8320                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$44)
    8321                      .dwattr $C$DW$705, DW_AT_name("TBLANK")
    8322                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_TBLANK")
    8323                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8324                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    8325              
    8326              $C$DW$706       .dwtag  DW_TAG_member
    8327                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$46)
    8328                      .dwattr $C$DW$706, DW_AT_name("DEAD_TIME")
    8329                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_DEAD_TIME")
    8330                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8331                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    8332              
    8333              $C$DW$707       .dwtag  DW_TAG_member
    8334                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$48)
    8335                      .dwattr $C$DW$707, DW_AT_name("PWM_MODE")
    8336                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_PWM_MODE")
    8337                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8338                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    8339              
    8340              $C$DW$708       .dwtag  DW_TAG_member
    8341                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$50)
    8342                      .dwattr $C$DW$708, DW_AT_name("COMM_OPT")
    8343                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_COMM_OPT")
    8344                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8345                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    8346              
    8347              $C$DW$709       .dwtag  DW_TAG_member
    8348                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$25)
    8349                      .dwattr $C$DW$709, DW_AT_name("CTRL07_RSV1")
    8350                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_CTRL07_RSV1")
    8351                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8352                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    8353              
    8354                      .dwendtag $C$DW$T$51
    8355              
    8356              $C$DW$T$88      .dwtag  DW_TAG_typedef
    8357                      .dwattr $C$DW$T$88, DW_AT_name("DRV_SPI_8305_Ctrl07_t_")
    8358                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$51)
    8359                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    8360              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  159

    8361              
    8362              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    8363                      .dwattr $C$DW$T$53, DW_AT_name("_DRV_SPI_8305_Ctrl08_t_")
    8364                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    8365              $C$DW$710       .dwtag  DW_TAG_member
    8366                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$52)
    8367                      .dwattr $C$DW$710, DW_AT_name("CTRL08_RSV1")
    8368                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_CTRL08_RSV1")
    8369                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8370                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    8371              
    8372                      .dwendtag $C$DW$T$53
    8373              
    8374              $C$DW$T$89      .dwtag  DW_TAG_typedef
    8375                      .dwattr $C$DW$T$89, DW_AT_name("DRV_SPI_8305_Ctrl08_t_")
    8376                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$53)
    8377                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    8378              
    8379              
    8380              $C$DW$T$56      .dwtag  DW_TAG_structure_type
    8381                      .dwattr $C$DW$T$56, DW_AT_name("_DRV_SPI_8305_Ctrl09_t_")
    8382                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x0a)
    8383              $C$DW$711       .dwtag  DW_TAG_member
    8384                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$25)
    8385                      .dwattr $C$DW$711, DW_AT_name("SET_VCPH_UV")
    8386                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_SET_VCPH_UV")
    8387                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8388                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    8389              
    8390              $C$DW$712       .dwtag  DW_TAG_member
    8391                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$25)
    8392                      .dwattr $C$DW$712, DW_AT_name("CLR_FLTS")
    8393                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_CLR_FLTS")
    8394                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8395                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    8396              
    8397              $C$DW$713       .dwtag  DW_TAG_member
    8398                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$25)
    8399                      .dwattr $C$DW$713, DW_AT_name("SLEEP")
    8400                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_SLEEP")
    8401                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8402                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    8403              
    8404              $C$DW$714       .dwtag  DW_TAG_member
    8405                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$25)
    8406                      .dwattr $C$DW$714, DW_AT_name("WD_EN")
    8407                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_WD_EN")
    8408                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8409                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    8410              
    8411              $C$DW$715       .dwtag  DW_TAG_member
    8412                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$25)
    8413                      .dwattr $C$DW$715, DW_AT_name("DIS_SNS_OCP")
    8414                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_DIS_SNS_OCP")
    8415                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  160

    8416                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    8417              
    8418              $C$DW$716       .dwtag  DW_TAG_member
    8419                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$55)
    8420                      .dwattr $C$DW$716, DW_AT_name("WD_DLY")
    8421                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_WD_DLY")
    8422                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8423                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    8424              
    8425              $C$DW$717       .dwtag  DW_TAG_member
    8426                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$25)
    8427                      .dwattr $C$DW$717, DW_AT_name("EN_SNS_CLAMP")
    8428                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_EN_SNS_CLAMP")
    8429                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8430                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    8431              
    8432              $C$DW$718       .dwtag  DW_TAG_member
    8433                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$25)
    8434                      .dwattr $C$DW$718, DW_AT_name("DIS_GDRV_FAULT")
    8435                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_DIS_GDRV_FAULT")
    8436                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8437                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    8438              
    8439              $C$DW$719       .dwtag  DW_TAG_member
    8440                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$25)
    8441                      .dwattr $C$DW$719, DW_AT_name("DISABLE")
    8442                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_DISABLE")
    8443                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8444                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8445              
    8446              $C$DW$720       .dwtag  DW_TAG_member
    8447                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$25)
    8448                      .dwattr $C$DW$720, DW_AT_name("FLIP_OTS")
    8449                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_FLIP_OTS")
    8450                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8451                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8452              
    8453                      .dwendtag $C$DW$T$56
    8454              
    8455              $C$DW$T$90      .dwtag  DW_TAG_typedef
    8456                      .dwattr $C$DW$T$90, DW_AT_name("DRV_SPI_8305_Ctrl09_t_")
    8457                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$56)
    8458                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    8459              
    8460              
    8461              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    8462                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8305_Ctrl0A_t_")
    8463                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x07)
    8464              $C$DW$721       .dwtag  DW_TAG_member
    8465                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$58)
    8466                      .dwattr $C$DW$721, DW_AT_name("GAIN_CS1")
    8467                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_GAIN_CS1")
    8468                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8469                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8470              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  161

    8471              $C$DW$722       .dwtag  DW_TAG_member
    8472                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$60)
    8473                      .dwattr $C$DW$722, DW_AT_name("GAIN_CS2")
    8474                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_GAIN_CS2")
    8475                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8476                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8477              
    8478              $C$DW$723       .dwtag  DW_TAG_member
    8479                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$62)
    8480                      .dwattr $C$DW$723, DW_AT_name("GAIN_CS3")
    8481                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_GAIN_CS3")
    8482                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8483                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8484              
    8485              $C$DW$724       .dwtag  DW_TAG_member
    8486                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$64)
    8487                      .dwattr $C$DW$724, DW_AT_name("CS_BLANK")
    8488                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_CS_BLANK")
    8489                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8490                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8491              
    8492              $C$DW$725       .dwtag  DW_TAG_member
    8493                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$25)
    8494                      .dwattr $C$DW$725, DW_AT_name("DC_CAL_CH1")
    8495                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_DC_CAL_CH1")
    8496                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8497                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8498              
    8499              $C$DW$726       .dwtag  DW_TAG_member
    8500                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$25)
    8501                      .dwattr $C$DW$726, DW_AT_name("DC_CAL_CH2")
    8502                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_DC_CAL_CH2")
    8503                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8504                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8505              
    8506              $C$DW$727       .dwtag  DW_TAG_member
    8507                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$25)
    8508                      .dwattr $C$DW$727, DW_AT_name("DC_CAL_CH3")
    8509                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_DC_CAL_CH3")
    8510                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8511                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    8512              
    8513                      .dwendtag $C$DW$T$65
    8514              
    8515              $C$DW$T$91      .dwtag  DW_TAG_typedef
    8516                      .dwattr $C$DW$T$91, DW_AT_name("DRV_SPI_8305_Ctrl0A_t_")
    8517                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$65)
    8518                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    8519              
    8520              
    8521              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    8522                      .dwattr $C$DW$T$72, DW_AT_name("_DRV_SPI_8305_Ctrl0B_t_")
    8523                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x08)
    8524              $C$DW$728       .dwtag  DW_TAG_member
    8525                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$67)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  162

    8526                      .dwattr $C$DW$728, DW_AT_name("VREG_UV_LEVEL")
    8527                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_VREG_UV_LEVEL")
    8528                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8529                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    8530              
    8531              $C$DW$729       .dwtag  DW_TAG_member
    8532                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$25)
    8533                      .dwattr $C$DW$729, DW_AT_name("DIS_PWRGD")
    8534                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_DIS_PWRGD")
    8535                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8536                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8537              
    8538              $C$DW$730       .dwtag  DW_TAG_member
    8539                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$69)
    8540                      .dwattr $C$DW$730, DW_AT_name("SLP_DLY")
    8541                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_SLP_DLY")
    8542                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8543                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    8544              
    8545              $C$DW$731       .dwtag  DW_TAG_member
    8546                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$25)
    8547                      .dwattr $C$DW$731, DW_AT_name("CTRL0B_RSV1")
    8548                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_CTRL0B_RSV1")
    8549                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8550                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    8551              
    8552              $C$DW$732       .dwtag  DW_TAG_member
    8553                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$25)
    8554                      .dwattr $C$DW$732, DW_AT_name("CTRL0B_RSV2")
    8555                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_CTRL0B_RSV2")
    8556                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8557                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8558              
    8559              $C$DW$733       .dwtag  DW_TAG_member
    8560                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$25)
    8561                      .dwattr $C$DW$733, DW_AT_name("CTRL0B_RSV3")
    8562                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_CTRL0B_RSV3")
    8563                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8564                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8565              
    8566              $C$DW$734       .dwtag  DW_TAG_member
    8567                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$71)
    8568                      .dwattr $C$DW$734, DW_AT_name("VREF_SCALING")
    8569                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_VREF_SCALING")
    8570                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8571                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8572              
    8573              $C$DW$735       .dwtag  DW_TAG_member
    8574                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$25)
    8575                      .dwattr $C$DW$735, DW_AT_name("CTRL0B_RSV4")
    8576                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_CTRL0B_RSV4")
    8577                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8578                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    8579              
    8580                      .dwendtag $C$DW$T$72
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  163

    8581              
    8582              $C$DW$T$92      .dwtag  DW_TAG_typedef
    8583                      .dwattr $C$DW$T$92, DW_AT_name("DRV_SPI_8305_Ctrl0B_t_")
    8584                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$72)
    8585                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    8586              
    8587              
    8588              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    8589                      .dwattr $C$DW$T$77, DW_AT_name("_DRV_SPI_8305_Ctrl0C_t_")
    8590                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x05)
    8591              $C$DW$736       .dwtag  DW_TAG_member
    8592                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$74)
    8593                      .dwattr $C$DW$736, DW_AT_name("VDS_MODE")
    8594                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_VDS_MODE")
    8595                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8596                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    8597              
    8598              $C$DW$737       .dwtag  DW_TAG_member
    8599                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$76)
    8600                      .dwattr $C$DW$737, DW_AT_name("VDS_LEVEL")
    8601                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_VDS_LEVEL")
    8602                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8603                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    8604              
    8605              $C$DW$738       .dwtag  DW_TAG_member
    8606                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$25)
    8607                      .dwattr $C$DW$738, DW_AT_name("CTRL0C_RSV1")
    8608                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_CTRL0C_RSV1")
    8609                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8610                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    8611              
    8612              $C$DW$739       .dwtag  DW_TAG_member
    8613                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$25)
    8614                      .dwattr $C$DW$739, DW_AT_name("CTRL0C_RSV2")
    8615                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_CTRL0C_RSV2")
    8616                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8617                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    8618              
    8619              $C$DW$740       .dwtag  DW_TAG_member
    8620                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$25)
    8621                      .dwattr $C$DW$740, DW_AT_name("CTRL0C_RSV3")
    8622                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_CTRL0C_RSV3")
    8623                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8624                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    8625              
    8626                      .dwendtag $C$DW$T$77
    8627              
    8628              $C$DW$T$93      .dwtag  DW_TAG_typedef
    8629                      .dwattr $C$DW$T$93, DW_AT_name("DRV_SPI_8305_Ctrl0C_t_")
    8630                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$77)
    8631                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    8632              
    8633              
    8634              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    8635                      .dwattr $C$DW$T$78, DW_AT_name("_DRV_SPI_8305_Stat01_t_")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  164

    8636                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0b)
    8637              $C$DW$741       .dwtag  DW_TAG_member
    8638                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$25)
    8639                      .dwattr $C$DW$741, DW_AT_name("OTW")
    8640                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_OTW")
    8641                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8642                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    8643              
    8644              $C$DW$742       .dwtag  DW_TAG_member
    8645                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$25)
    8646                      .dwattr $C$DW$742, DW_AT_name("TEMP_FLAG3")
    8647                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_TEMP_FLAG3")
    8648                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8649                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    8650              
    8651              $C$DW$743       .dwtag  DW_TAG_member
    8652                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$25)
    8653                      .dwattr $C$DW$743, DW_AT_name("TEMP_FLAG2")
    8654                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_TEMP_FLAG2")
    8655                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8656                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8657              
    8658              $C$DW$744       .dwtag  DW_TAG_member
    8659                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$25)
    8660                      .dwattr $C$DW$744, DW_AT_name("TEMP_FLAG1")
    8661                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_TEMP_FLAG1")
    8662                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8663                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    8664              
    8665              $C$DW$745       .dwtag  DW_TAG_member
    8666                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$25)
    8667                      .dwattr $C$DW$745, DW_AT_name("VCPH_UVFL")
    8668                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_VCPH_UVFL")
    8669                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8670                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    8671              
    8672              $C$DW$746       .dwtag  DW_TAG_member
    8673                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$25)
    8674                      .dwattr $C$DW$746, DW_AT_name("VDS_STATUS")
    8675                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_VDS_STATUS")
    8676                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8677                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    8678              
    8679              $C$DW$747       .dwtag  DW_TAG_member
    8680                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$25)
    8681                      .dwattr $C$DW$747, DW_AT_name("PVDD_OVFL")
    8682                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_PVDD_OVFL")
    8683                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8684                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    8685              
    8686              $C$DW$748       .dwtag  DW_TAG_member
    8687                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$25)
    8688                      .dwattr $C$DW$748, DW_AT_name("PVDD_UVFL")
    8689                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_PVDD_UVFL")
    8690                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  165

    8691                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    8692              
    8693              $C$DW$749       .dwtag  DW_TAG_member
    8694                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$25)
    8695                      .dwattr $C$DW$749, DW_AT_name("TEMP_FLAG4")
    8696                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_TEMP_FLAG4")
    8697                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8698                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    8699              
    8700              $C$DW$750       .dwtag  DW_TAG_member
    8701                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$25)
    8702                      .dwattr $C$DW$750, DW_AT_name("STAT01_RSV1")
    8703                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_STAT01_RSV1")
    8704                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8705                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    8706              
    8707              $C$DW$751       .dwtag  DW_TAG_member
    8708                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$25)
    8709                      .dwattr $C$DW$751, DW_AT_name("FAULT")
    8710                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_FAULT")
    8711                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8712                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    8713              
    8714                      .dwendtag $C$DW$T$78
    8715              
    8716              $C$DW$T$82      .dwtag  DW_TAG_typedef
    8717                      .dwattr $C$DW$T$82, DW_AT_name("DRV_SPI_8305_Stat01_t_")
    8718                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$78)
    8719                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    8720              
    8721              
    8722              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    8723                      .dwattr $C$DW$T$79, DW_AT_name("_DRV_SPI_8305_Stat02_t_")
    8724                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x0b)
    8725              $C$DW$752       .dwtag  DW_TAG_member
    8726                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$25)
    8727                      .dwattr $C$DW$752, DW_AT_name("SNS_A_OCP")
    8728                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_SNS_A_OCP")
    8729                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8730                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    8731              
    8732              $C$DW$753       .dwtag  DW_TAG_member
    8733                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$25)
    8734                      .dwattr $C$DW$753, DW_AT_name("SNS_B_OCP")
    8735                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_SNS_B_OCP")
    8736                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8737                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    8738              
    8739              $C$DW$754       .dwtag  DW_TAG_member
    8740                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$25)
    8741                      .dwattr $C$DW$754, DW_AT_name("SNS_C_OCP")
    8742                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_SNS_C_OCP")
    8743                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8744                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    8745              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  166

    8746              $C$DW$755       .dwtag  DW_TAG_member
    8747                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$25)
    8748                      .dwattr $C$DW$755, DW_AT_name("STAT02_RSV2")
    8749                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_STAT02_RSV2")
    8750                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8751                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    8752              
    8753              $C$DW$756       .dwtag  DW_TAG_member
    8754                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$25)
    8755                      .dwattr $C$DW$756, DW_AT_name("STAT02_RSV1")
    8756                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_STAT02_RSV1")
    8757                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8758                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    8759              
    8760              $C$DW$757       .dwtag  DW_TAG_member
    8761                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$25)
    8762                      .dwattr $C$DW$757, DW_AT_name("FETLC_VDS")
    8763                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_FETLC_VDS")
    8764                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8765                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    8766              
    8767              $C$DW$758       .dwtag  DW_TAG_member
    8768                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$25)
    8769                      .dwattr $C$DW$758, DW_AT_name("FETHC_VDS")
    8770                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_FETHC_VDS")
    8771                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8772                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    8773              
    8774              $C$DW$759       .dwtag  DW_TAG_member
    8775                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$25)
    8776                      .dwattr $C$DW$759, DW_AT_name("FETLB_VDS")
    8777                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_FETLB_VDS")
    8778                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8779                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    8780              
    8781              $C$DW$760       .dwtag  DW_TAG_member
    8782                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$25)
    8783                      .dwattr $C$DW$760, DW_AT_name("FETHB_VDS")
    8784                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_FETHB_VDS")
    8785                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8786                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    8787              
    8788              $C$DW$761       .dwtag  DW_TAG_member
    8789                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$25)
    8790                      .dwattr $C$DW$761, DW_AT_name("FETLA_VDS")
    8791                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_FETLA_VDS")
    8792                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8793                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    8794              
    8795              $C$DW$762       .dwtag  DW_TAG_member
    8796                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$25)
    8797                      .dwattr $C$DW$762, DW_AT_name("FETHA_VDS")
    8798                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_FETHA_VDS")
    8799                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8800                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  167

    8801              
    8802                      .dwendtag $C$DW$T$79
    8803              
    8804              $C$DW$T$83      .dwtag  DW_TAG_typedef
    8805                      .dwattr $C$DW$T$83, DW_AT_name("DRV_SPI_8305_Stat02_t_")
    8806                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$79)
    8807                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    8808              
    8809              
    8810              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    8811                      .dwattr $C$DW$T$80, DW_AT_name("_DRV_SPI_8305_Stat03_t_")
    8812                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x0b)
    8813              $C$DW$763       .dwtag  DW_TAG_member
    8814                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$25)
    8815                      .dwattr $C$DW$763, DW_AT_name("VCPH_OVLO_ABS")
    8816                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_VCPH_OVLO_ABS")
    8817                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8818                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    8819              
    8820              $C$DW$764       .dwtag  DW_TAG_member
    8821                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$25)
    8822                      .dwattr $C$DW$764, DW_AT_name("VCPH_OVLO")
    8823                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_VCPH_OVLO")
    8824                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8825                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    8826              
    8827              $C$DW$765       .dwtag  DW_TAG_member
    8828                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$25)
    8829                      .dwattr $C$DW$765, DW_AT_name("VCPH_UVLO2")
    8830                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_VCPH_UVLO2")
    8831                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8832                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    8833              
    8834              $C$DW$766       .dwtag  DW_TAG_member
    8835                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$25)
    8836                      .dwattr $C$DW$766, DW_AT_name("STAT03_RSV2")
    8837                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_STAT03_RSV2")
    8838                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8839                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    8840              
    8841              $C$DW$767       .dwtag  DW_TAG_member
    8842                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$25)
    8843                      .dwattr $C$DW$767, DW_AT_name("VCP_LSD_UVLO2")
    8844                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_VCP_LSD_UVLO2")
    8845                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8846                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    8847              
    8848              $C$DW$768       .dwtag  DW_TAG_member
    8849                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$25)
    8850                      .dwattr $C$DW$768, DW_AT_name("AVDD_UVLO")
    8851                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_AVDD_UVLO")
    8852                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8853                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    8854              
    8855              $C$DW$769       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  168

    8856                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$25)
    8857                      .dwattr $C$DW$769, DW_AT_name("VREG_UV")
    8858                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_VREG_UV")
    8859                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8860                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    8861              
    8862              $C$DW$770       .dwtag  DW_TAG_member
    8863                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$25)
    8864                      .dwattr $C$DW$770, DW_AT_name("STAT03_RSV1")
    8865                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_STAT03_RSV1")
    8866                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8867                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    8868              
    8869              $C$DW$771       .dwtag  DW_TAG_member
    8870                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$25)
    8871                      .dwattr $C$DW$771, DW_AT_name("OTS")
    8872                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_OTS")
    8873                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8874                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    8875              
    8876              $C$DW$772       .dwtag  DW_TAG_member
    8877                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$25)
    8878                      .dwattr $C$DW$772, DW_AT_name("WD_FAULT")
    8879                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_WD_FAULT")
    8880                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8881                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    8882              
    8883              $C$DW$773       .dwtag  DW_TAG_member
    8884                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$25)
    8885                      .dwattr $C$DW$773, DW_AT_name("PVDD_UVLO2")
    8886                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_PVDD_UVLO2")
    8887                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8888                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    8889              
    8890                      .dwendtag $C$DW$T$80
    8891              
    8892              $C$DW$T$84      .dwtag  DW_TAG_typedef
    8893                      .dwattr $C$DW$T$84, DW_AT_name("DRV_SPI_8305_Stat03_t_")
    8894                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$80)
    8895                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    8896              
    8897              
    8898              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    8899                      .dwattr $C$DW$T$81, DW_AT_name("_DRV_SPI_8305_Stat04_t_")
    8900                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0b)
    8901              $C$DW$774       .dwtag  DW_TAG_member
    8902                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$25)
    8903                      .dwattr $C$DW$774, DW_AT_name("STAT04_RSV5")
    8904                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_STAT04_RSV5")
    8905                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8906                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    8907              
    8908              $C$DW$775       .dwtag  DW_TAG_member
    8909                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$25)
    8910                      .dwattr $C$DW$775, DW_AT_name("STAT04_RSV4")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  169

    8911                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_STAT04_RSV4")
    8912                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8913                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    8914              
    8915              $C$DW$776       .dwtag  DW_TAG_member
    8916                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$25)
    8917                      .dwattr $C$DW$776, DW_AT_name("STAT04_RSV3")
    8918                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_STAT04_RSV3")
    8919                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8920                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    8921              
    8922              $C$DW$777       .dwtag  DW_TAG_member
    8923                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$25)
    8924                      .dwattr $C$DW$777, DW_AT_name("STAT04_RSV2")
    8925                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_STAT04_RSV2")
    8926                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8927                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    8928              
    8929              $C$DW$778       .dwtag  DW_TAG_member
    8930                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$25)
    8931                      .dwattr $C$DW$778, DW_AT_name("STAT04_RSV1")
    8932                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_STAT04_RSV1")
    8933                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8934                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    8935              
    8936              $C$DW$779       .dwtag  DW_TAG_member
    8937                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$25)
    8938                      .dwattr $C$DW$779, DW_AT_name("FETLC_VGS")
    8939                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_FETLC_VGS")
    8940                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8941                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    8942              
    8943              $C$DW$780       .dwtag  DW_TAG_member
    8944                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$25)
    8945                      .dwattr $C$DW$780, DW_AT_name("FETHC_VGS")
    8946                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_FETHC_VGS")
    8947                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8948                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    8949              
    8950              $C$DW$781       .dwtag  DW_TAG_member
    8951                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$25)
    8952                      .dwattr $C$DW$781, DW_AT_name("FETLB_VGS")
    8953                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_FETLB_VGS")
    8954                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8955                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    8956              
    8957              $C$DW$782       .dwtag  DW_TAG_member
    8958                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$25)
    8959                      .dwattr $C$DW$782, DW_AT_name("FETHB_VGS")
    8960                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_FETHB_VGS")
    8961                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8962                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    8963              
    8964              $C$DW$783       .dwtag  DW_TAG_member
    8965                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  170

    8966                      .dwattr $C$DW$783, DW_AT_name("FETLA_VGS")
    8967                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_FETLA_VGS")
    8968                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8969                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    8970              
    8971              $C$DW$784       .dwtag  DW_TAG_member
    8972                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$25)
    8973                      .dwattr $C$DW$784, DW_AT_name("FETHA_VGS")
    8974                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_FETHA_VGS")
    8975                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8976                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    8977              
    8978                      .dwendtag $C$DW$T$81
    8979              
    8980              $C$DW$T$85      .dwtag  DW_TAG_typedef
    8981                      .dwattr $C$DW$T$85, DW_AT_name("DRV_SPI_8305_Stat04_t_")
    8982                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$81)
    8983                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    8984              
    8985              
    8986              $C$DW$T$94      .dwtag  DW_TAG_structure_type
    8987                      .dwattr $C$DW$T$94, DW_AT_name("_DRV_SPI_8305_Vars_t_")
    8988                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x61)
    8989              $C$DW$785       .dwtag  DW_TAG_member
    8990                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$82)
    8991                      .dwattr $C$DW$785, DW_AT_name("Stat_Reg_01")
    8992                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_Stat_Reg_01")
    8993                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8994                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    8995              
    8996              $C$DW$786       .dwtag  DW_TAG_member
    8997                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$83)
    8998                      .dwattr $C$DW$786, DW_AT_name("Stat_Reg_02")
    8999                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_Stat_Reg_02")
    9000                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9001                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    9002              
    9003              $C$DW$787       .dwtag  DW_TAG_member
    9004                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$84)
    9005                      .dwattr $C$DW$787, DW_AT_name("Stat_Reg_03")
    9006                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_Stat_Reg_03")
    9007                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9008                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    9009              
    9010              $C$DW$788       .dwtag  DW_TAG_member
    9011                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$85)
    9012                      .dwattr $C$DW$788, DW_AT_name("Stat_Reg_04")
    9013                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_Stat_Reg_04")
    9014                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    9015                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    9016              
    9017              $C$DW$789       .dwtag  DW_TAG_member
    9018                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$86)
    9019                      .dwattr $C$DW$789, DW_AT_name("Ctrl_Reg_05")
    9020                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_Ctrl_Reg_05")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  171

    9021                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9022                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    9023              
    9024              $C$DW$790       .dwtag  DW_TAG_member
    9025                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$87)
    9026                      .dwattr $C$DW$790, DW_AT_name("Ctrl_Reg_06")
    9027                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_Ctrl_Reg_06")
    9028                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    9029                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    9030              
    9031              $C$DW$791       .dwtag  DW_TAG_member
    9032                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$88)
    9033                      .dwattr $C$DW$791, DW_AT_name("Ctrl_Reg_07")
    9034                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_Ctrl_Reg_07")
    9035                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9036                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    9037              
    9038              $C$DW$792       .dwtag  DW_TAG_member
    9039                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$89)
    9040                      .dwattr $C$DW$792, DW_AT_name("Ctrl_Reg_08")
    9041                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_Ctrl_Reg_08")
    9042                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    9043                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    9044              
    9045              $C$DW$793       .dwtag  DW_TAG_member
    9046                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$90)
    9047                      .dwattr $C$DW$793, DW_AT_name("Ctrl_Reg_09")
    9048                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_Ctrl_Reg_09")
    9049                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    9050                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    9051              
    9052              $C$DW$794       .dwtag  DW_TAG_member
    9053                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$91)
    9054                      .dwattr $C$DW$794, DW_AT_name("Ctrl_Reg_0A")
    9055                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_Ctrl_Reg_0A")
    9056                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    9057                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    9058              
    9059              $C$DW$795       .dwtag  DW_TAG_member
    9060                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$92)
    9061                      .dwattr $C$DW$795, DW_AT_name("Ctrl_Reg_0B")
    9062                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_Ctrl_Reg_0B")
    9063                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    9064                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    9065              
    9066              $C$DW$796       .dwtag  DW_TAG_member
    9067                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$93)
    9068                      .dwattr $C$DW$796, DW_AT_name("Ctrl_Reg_0C")
    9069                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_Ctrl_Reg_0C")
    9070                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    9071                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    9072              
    9073              $C$DW$797       .dwtag  DW_TAG_member
    9074                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$25)
    9075                      .dwattr $C$DW$797, DW_AT_name("WriteCmd")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  172

    9076                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_WriteCmd")
    9077                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
    9078                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    9079              
    9080              $C$DW$798       .dwtag  DW_TAG_member
    9081                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$25)
    9082                      .dwattr $C$DW$798, DW_AT_name("ReadCmd")
    9083                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_ReadCmd")
    9084                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    9085                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    9086              
    9087              $C$DW$799       .dwtag  DW_TAG_member
    9088                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$52)
    9089                      .dwattr $C$DW$799, DW_AT_name("ManWriteAddr")
    9090                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_ManWriteAddr")
    9091                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x5b]
    9092                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    9093              
    9094              $C$DW$800       .dwtag  DW_TAG_member
    9095                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$52)
    9096                      .dwattr $C$DW$800, DW_AT_name("ManReadAddr")
    9097                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_ManReadAddr")
    9098                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9099                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    9100              
    9101              $C$DW$801       .dwtag  DW_TAG_member
    9102                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$52)
    9103                      .dwattr $C$DW$801, DW_AT_name("ManWriteData")
    9104                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_ManWriteData")
    9105                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    9106                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    9107              
    9108              $C$DW$802       .dwtag  DW_TAG_member
    9109                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$52)
    9110                      .dwattr $C$DW$802, DW_AT_name("ManReadData")
    9111                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_ManReadData")
    9112                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9113                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    9114              
    9115              $C$DW$803       .dwtag  DW_TAG_member
    9116                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$25)
    9117                      .dwattr $C$DW$803, DW_AT_name("ManWriteCmd")
    9118                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_ManWriteCmd")
    9119                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x5f]
    9120                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    9121              
    9122              $C$DW$804       .dwtag  DW_TAG_member
    9123                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$25)
    9124                      .dwattr $C$DW$804, DW_AT_name("ManReadCmd")
    9125                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_ManReadCmd")
    9126                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9127                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    9128              
    9129                      .dwendtag $C$DW$T$94
    9130              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  173

    9131              $C$DW$T$199     .dwtag  DW_TAG_typedef
    9132                      .dwattr $C$DW$T$199, DW_AT_name("DRV_SPI_8305_Vars_t")
    9133                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$94)
    9134                      .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    9135              
    9136              $C$DW$T$200     .dwtag  DW_TAG_pointer_type
    9137                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$199)
    9138                      .dwattr $C$DW$T$200, DW_AT_address_class(0x20)
    9139              
    9140              $C$DW$805       .dwtag  DW_TAG_TI_far_type
    9141                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$200)
    9142              
    9143              $C$DW$T$201     .dwtag  DW_TAG_const_type
    9144                      .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$805)
    9145              
    9146              
    9147              $C$DW$T$104     .dwtag  DW_TAG_structure_type
    9148                      .dwattr $C$DW$T$104, DW_AT_name("_GPIO_Obj_")
    9149                      .dwattr $C$DW$T$104, DW_AT_byte_size(0x6a)
    9150              $C$DW$806       .dwtag  DW_TAG_member
    9151                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$96)
    9152                      .dwattr $C$DW$806, DW_AT_name("GPACTRL")
    9153                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_GPACTRL")
    9154                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9155                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    9156              
    9157              $C$DW$807       .dwtag  DW_TAG_member
    9158                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$96)
    9159                      .dwattr $C$DW$807, DW_AT_name("GPAQSEL1")
    9160                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_GPAQSEL1")
    9161                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9162                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    9163              
    9164              $C$DW$808       .dwtag  DW_TAG_member
    9165                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$96)
    9166                      .dwattr $C$DW$808, DW_AT_name("GPAQSEL2")
    9167                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_GPAQSEL2")
    9168                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9169                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    9170              
    9171              $C$DW$809       .dwtag  DW_TAG_member
    9172                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$96)
    9173                      .dwattr $C$DW$809, DW_AT_name("GPAMUX1")
    9174                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_GPAMUX1")
    9175                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9176                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    9177              
    9178              $C$DW$810       .dwtag  DW_TAG_member
    9179                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$96)
    9180                      .dwattr $C$DW$810, DW_AT_name("GPAMUX2")
    9181                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_GPAMUX2")
    9182                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9183                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    9184              
    9185              $C$DW$811       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  174

    9186                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$96)
    9187                      .dwattr $C$DW$811, DW_AT_name("GPADIR")
    9188                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_GPADIR")
    9189                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9190                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    9191              
    9192              $C$DW$812       .dwtag  DW_TAG_member
    9193                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$96)
    9194                      .dwattr $C$DW$812, DW_AT_name("GPAPUD")
    9195                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_GPAPUD")
    9196                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9197                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    9198              
    9199              $C$DW$813       .dwtag  DW_TAG_member
    9200                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$98)
    9201                      .dwattr $C$DW$813, DW_AT_name("rsvd_1")
    9202                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_rsvd_1")
    9203                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9204                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    9205              
    9206              $C$DW$814       .dwtag  DW_TAG_member
    9207                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$96)
    9208                      .dwattr $C$DW$814, DW_AT_name("GPBCTRL")
    9209                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_GPBCTRL")
    9210                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9211                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    9212              
    9213              $C$DW$815       .dwtag  DW_TAG_member
    9214                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$96)
    9215                      .dwattr $C$DW$815, DW_AT_name("GPBQSEL1")
    9216                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_GPBQSEL1")
    9217                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9218                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    9219              
    9220              $C$DW$816       .dwtag  DW_TAG_member
    9221                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$98)
    9222                      .dwattr $C$DW$816, DW_AT_name("rsvd_2")
    9223                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_rsvd_2")
    9224                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9225                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    9226              
    9227              $C$DW$817       .dwtag  DW_TAG_member
    9228                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$96)
    9229                      .dwattr $C$DW$817, DW_AT_name("GPBMUX1")
    9230                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_GPBMUX1")
    9231                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9232                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    9233              
    9234              $C$DW$818       .dwtag  DW_TAG_member
    9235                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$98)
    9236                      .dwattr $C$DW$818, DW_AT_name("rsvd_3")
    9237                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_rsvd_3")
    9238                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9239                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    9240              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  175

    9241              $C$DW$819       .dwtag  DW_TAG_member
    9242                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$96)
    9243                      .dwattr $C$DW$819, DW_AT_name("GPBDIR")
    9244                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_GPBDIR")
    9245                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9246                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    9247              
    9248              $C$DW$820       .dwtag  DW_TAG_member
    9249                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$96)
    9250                      .dwattr $C$DW$820, DW_AT_name("GPBPUD")
    9251                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_GPBPUD")
    9252                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9253                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    9254              
    9255              $C$DW$821       .dwtag  DW_TAG_member
    9256                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$99)
    9257                      .dwattr $C$DW$821, DW_AT_name("rsvd_4")
    9258                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_rsvd_4")
    9259                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9260                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    9261              
    9262              $C$DW$822       .dwtag  DW_TAG_member
    9263                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$96)
    9264                      .dwattr $C$DW$822, DW_AT_name("AIOMUX1")
    9265                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_AIOMUX1")
    9266                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    9267                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    9268              
    9269              $C$DW$823       .dwtag  DW_TAG_member
    9270                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$98)
    9271                      .dwattr $C$DW$823, DW_AT_name("rsvd_5")
    9272                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_rsvd_5")
    9273                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9274                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    9275              
    9276              $C$DW$824       .dwtag  DW_TAG_member
    9277                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$96)
    9278                      .dwattr $C$DW$824, DW_AT_name("AIODIR")
    9279                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_AIODIR")
    9280                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    9281                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    9282              
    9283              $C$DW$825       .dwtag  DW_TAG_member
    9284                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$100)
    9285                      .dwattr $C$DW$825, DW_AT_name("rsvd_6")
    9286                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_rsvd_6")
    9287                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    9288                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    9289              
    9290              $C$DW$826       .dwtag  DW_TAG_member
    9291                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$96)
    9292                      .dwattr $C$DW$826, DW_AT_name("GPADAT")
    9293                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_GPADAT")
    9294                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    9295                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  176

    9296              
    9297              $C$DW$827       .dwtag  DW_TAG_member
    9298                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$96)
    9299                      .dwattr $C$DW$827, DW_AT_name("GPASET")
    9300                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_GPASET")
    9301                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    9302                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    9303              
    9304              $C$DW$828       .dwtag  DW_TAG_member
    9305                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$96)
    9306                      .dwattr $C$DW$828, DW_AT_name("GPACLEAR")
    9307                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_GPACLEAR")
    9308                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9309                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    9310              
    9311              $C$DW$829       .dwtag  DW_TAG_member
    9312                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$96)
    9313                      .dwattr $C$DW$829, DW_AT_name("GPATOGGLE")
    9314                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_GPATOGGLE")
    9315                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9316                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    9317              
    9318              $C$DW$830       .dwtag  DW_TAG_member
    9319                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$96)
    9320                      .dwattr $C$DW$830, DW_AT_name("GPBDAT")
    9321                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_GPBDAT")
    9322                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    9323                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    9324              
    9325              $C$DW$831       .dwtag  DW_TAG_member
    9326                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$96)
    9327                      .dwattr $C$DW$831, DW_AT_name("GPBSET")
    9328                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_GPBSET")
    9329                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    9330                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    9331              
    9332              $C$DW$832       .dwtag  DW_TAG_member
    9333                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$96)
    9334                      .dwattr $C$DW$832, DW_AT_name("GPBCLEAR")
    9335                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_GPBCLEAR")
    9336                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    9337                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    9338              
    9339              $C$DW$833       .dwtag  DW_TAG_member
    9340                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$96)
    9341                      .dwattr $C$DW$833, DW_AT_name("GPBTOGGLE")
    9342                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_GPBTOGGLE")
    9343                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    9344                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    9345              
    9346              $C$DW$834       .dwtag  DW_TAG_member
    9347                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$101)
    9348                      .dwattr $C$DW$834, DW_AT_name("rsvd_7")
    9349                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_rsvd_7")
    9350                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  177

    9351                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    9352              
    9353              $C$DW$835       .dwtag  DW_TAG_member
    9354                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$96)
    9355                      .dwattr $C$DW$835, DW_AT_name("AIODAT")
    9356                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_AIODAT")
    9357                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9358                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    9359              
    9360              $C$DW$836       .dwtag  DW_TAG_member
    9361                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$96)
    9362                      .dwattr $C$DW$836, DW_AT_name("AIOSET")
    9363                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_AIOSET")
    9364                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    9365                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    9366              
    9367              $C$DW$837       .dwtag  DW_TAG_member
    9368                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$96)
    9369                      .dwattr $C$DW$837, DW_AT_name("AIOCLEAR")
    9370                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_AIOCLEAR")
    9371                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9372                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    9373              
    9374              $C$DW$838       .dwtag  DW_TAG_member
    9375                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$96)
    9376                      .dwattr $C$DW$838, DW_AT_name("AIOTOGGLE")
    9377                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_AIOTOGGLE")
    9378                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9379                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    9380              
    9381              $C$DW$839       .dwtag  DW_TAG_member
    9382                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$102)
    9383                      .dwattr $C$DW$839, DW_AT_name("GPIOXINTnSEL")
    9384                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    9385                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9386                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    9387              
    9388              $C$DW$840       .dwtag  DW_TAG_member
    9389                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$103)
    9390                      .dwattr $C$DW$840, DW_AT_name("rsvd_8")
    9391                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_rsvd_8")
    9392                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    9393                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    9394              
    9395              $C$DW$841       .dwtag  DW_TAG_member
    9396                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$96)
    9397                      .dwattr $C$DW$841, DW_AT_name("GPIOLPMSEL")
    9398                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    9399                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    9400                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    9401              
    9402                      .dwendtag $C$DW$T$104
    9403              
    9404              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    9405                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$104)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{7BB3B2EF-E179-476E-8D9D-4E86BB89CC0E} PAGE  178

    9406                      .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    9407              
    9408              $C$DW$T$22      .dwtag  DW_TAG_typedef
    9409                      .dwattr $C$DW$T$22, DW_AT_name("GPIO_Handle")
    9410                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    9411                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    9412              
    9413              $C$DW$842       .dwtag  DW_TAG_TI_far_type
    9414                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$22)
    9415              
    9416              $C$DW$T$204     .dwtag  DW_TAG_const_type
    9417                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$842)
    9418              
    9419              
    9420              $C$DW$T$105     .dwtag  DW_TAG_structure_type
    9421                      .dwattr $C$DW$T$105, DW_AT_name("_SPI_Obj_")
    9422                      .dwattr $C$DW$T$105, DW_AT_byte_size(0x10)
    9423              $C$DW$843       .dwtag  DW_TAG_member
    9424                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$97)
    9425                      .dwattr $C$DW$843, DW_AT_name("SPICCR")
    9426                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_SPICCR")
    9427                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9428                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    9429              
    9430              $C$DW$844       .dwtag  DW_TAG_member
    9431                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$97)
    9432                      .dwattr $C$DW$844, DW_AT_name("SPICTL")
    9433                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_SPICTL")
    9434                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9435                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    9436              
    9437              $C$DW$845       .dwtag  DW_TAG_member
    9438                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$97)
    9439                      .dwattr $C$DW$845, DW_AT_name("SPIST")
    9440                      .dwattr $C$DW$845, DW_AT_TI_symbol_name("_SPIST")
    9441                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9442                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    9443              
    9444              $C$DW$846       .dwtag  DW_TAG_member
