TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:17 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{10A6929B-7F1A-44D0-AD82-9A585809FDE0} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Sun Jun 17 14:52:16 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/drivers/gpio/src/32b/f28x/f2802
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;       D:\ti\ccsv8\tools\compiler\ti-cgt-c2000_18.1.2.LTS\bin\opt2000.exe C:\\Users\\haowp\\AppData\\Local\\

    2181                      .dwattr $C$DW$234, DW_AT_const_value(0x01)
    2182              
    2183              $C$DW$235       .dwtag  DW_TAG_enumerator
    2184                      .dwattr $C$DW$235, DW_AT_name("GPIO_36_Mode_Rsvd_2")
    2185                      .dwattr $C$DW$235, DW_AT_const_value(0x02)
    2186              
    2187              $C$DW$236       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:17 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{10A6929B-7F1A-44D0-AD82-9A585809FDE0} PAGE   41

    2188                      .dwattr $C$DW$236, DW_AT_name("GPIO_36_Mode_Rsvd_3")
    2189                      .dwattr $C$DW$236, DW_AT_const_value(0x03)
    2190              
    2191              $C$DW$237       .dwtag  DW_TAG_enumerator
    2192                      .dwattr $C$DW$237, DW_AT_name("GPIO_37_Mode_JTAG_TDO")
    2193                      .dwattr $C$DW$237, DW_AT_const_value(0x00)
    2194              
    2195              $C$DW$238       .dwtag  DW_TAG_enumerator
    2196                      .dwattr $C$DW$238, DW_AT_name("GPIO_37_Mode_Rsvd_1")
    2197                      .dwattr $C$DW$238, DW_AT_const_value(0x01)
    2198              
    2199              $C$DW$239       .dwtag  DW_TAG_enumerator
    2200                      .dwattr $C$DW$239, DW_AT_name("GPIO_37_Mode_Rsvd_2")
    2201                      .dwattr $C$DW$239, DW_AT_const_value(0x02)
    2202              
    2203              $C$DW$240       .dwtag  DW_TAG_enumerator
    2204                      .dwattr $C$DW$240, DW_AT_name("GPIO_37_Mode_Rsvd_3")
    2205                      .dwattr $C$DW$240, DW_AT_const_value(0x03)
    2206              
    2207              $C$DW$241       .dwtag  DW_TAG_enumerator
    2208                      .dwattr $C$DW$241, DW_AT_name("GPIO_38_Mode_JTAG_TCK")
    2209                      .dwattr $C$DW$241, DW_AT_const_value(0x00)
    2210              
    2211              $C$DW$242       .dwtag  DW_TAG_enumerator
    2212                      .dwattr $C$DW$242, DW_AT_name("GPIO_38_Mode_Rsvd_1")
    2213                      .dwattr $C$DW$242, DW_AT_const_value(0x01)
    2214              
    2215              $C$DW$243       .dwtag  DW_TAG_enumerator
    2216                      .dwattr $C$DW$243, DW_AT_name("GPIO_38_Mode_Rsvd_2")
    2217                      .dwattr $C$DW$243, DW_AT_const_value(0x02)
    2218              
    2219              $C$DW$244       .dwtag  DW_TAG_enumerator
    2220                      .dwattr $C$DW$244, DW_AT_name("GPIO_38_Mode_Rsvd_3")
    2221                      .dwattr $C$DW$244, DW_AT_const_value(0x03)
    2222              
    2223                      .dwendtag $C$DW$T$45
    2224              
    2225              $C$DW$T$46      .dwtag  DW_TAG_typedef
    2226                      .dwattr $C$DW$T$46, DW_AT_name("GPIO_Mode_e")
    2227                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    2228                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2229              
    2230              $C$DW$245       .dwtag  DW_TAG_TI_far_type
    2231                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$46)
    2232              
    2233              $C$DW$T$47      .dwtag  DW_TAG_const_type
    2234                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$245)
    2235              
    2236              
    2237              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
    2238                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    2239              $C$DW$246       .dwtag  DW_TAG_enumerator
    2240                      .dwattr $C$DW$246, DW_AT_name("GPIO_Qual_Sync")
    2241                      .dwattr $C$DW$246, DW_AT_const_value(0x00)
    2242              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:17 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{10A6929B-7F1A-44D0-AD82-9A585809FDE0} PAGE   42

    2243              $C$DW$247       .dwtag  DW_TAG_enumerator
    2244                      .dwattr $C$DW$247, DW_AT_name("GPIO_Qual_Sample_3")
    2245                      .dwattr $C$DW$247, DW_AT_const_value(0x01)
    2246              
    2247              $C$DW$248       .dwtag  DW_TAG_enumerator
    2248                      .dwattr $C$DW$248, DW_AT_name("GPIO_Qual_Sample_6")
    2249                      .dwattr $C$DW$248, DW_AT_const_value(0x02)
    2250              
    2251              $C$DW$249       .dwtag  DW_TAG_enumerator
    2252                      .dwattr $C$DW$249, DW_AT_name("GPIO_Qual_ASync")
    2253                      .dwattr $C$DW$249, DW_AT_const_value(0x03)
    2254              
    2255                      .dwendtag $C$DW$T$48
    2256              
    2257              $C$DW$T$49      .dwtag  DW_TAG_typedef
    2258                      .dwattr $C$DW$T$49, DW_AT_name("GPIO_Qual_e")
    2259                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2260                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2261              
    2262              $C$DW$250       .dwtag  DW_TAG_TI_far_type
    2263                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$49)
    2264              
    2265              $C$DW$T$50      .dwtag  DW_TAG_const_type
    2266                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$250)
    2267              
    2268              
    2269              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2270                      .dwattr $C$DW$T$29, DW_AT_name("_GPIO_Obj_")
    2271                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6a)
    2272              $C$DW$251       .dwtag  DW_TAG_member
    2273                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    2274                      .dwattr $C$DW$251, DW_AT_name("GPACTRL")
    2275                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_GPACTRL")
    2276                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2277                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2278              
    2279              $C$DW$252       .dwtag  DW_TAG_member
    2280                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
    2281                      .dwattr $C$DW$252, DW_AT_name("GPAQSEL1")
    2282                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_GPAQSEL1")
    2283                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2284                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2285              
    2286              $C$DW$253       .dwtag  DW_TAG_member
    2287                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    2288                      .dwattr $C$DW$253, DW_AT_name("GPAQSEL2")
    2289                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_GPAQSEL2")
    2290                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2291                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2292              
    2293              $C$DW$254       .dwtag  DW_TAG_member
    2294                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    2295                      .dwattr $C$DW$254, DW_AT_name("GPAMUX1")
    2296                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_GPAMUX1")
    2297                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:17 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{10A6929B-7F1A-44D0-AD82-9A585809FDE0} PAGE   43

    2298                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2299              
    2300              $C$DW$255       .dwtag  DW_TAG_member
    2301                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    2302                      .dwattr $C$DW$255, DW_AT_name("GPAMUX2")
    2303                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_GPAMUX2")
    2304                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2305                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2306              
    2307              $C$DW$256       .dwtag  DW_TAG_member
    2308                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    2309                      .dwattr $C$DW$256, DW_AT_name("GPADIR")
    2310                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_GPADIR")
    2311                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2312                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2313              
    2314              $C$DW$257       .dwtag  DW_TAG_member
    2315                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    2316                      .dwattr $C$DW$257, DW_AT_name("GPAPUD")
    2317                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_GPAPUD")
    2318                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2319                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2320              
    2321              $C$DW$258       .dwtag  DW_TAG_member
    2322                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$23)
    2323                      .dwattr $C$DW$258, DW_AT_name("rsvd_1")
    2324                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_rsvd_1")
    2325                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2326                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2327              
    2328              $C$DW$259       .dwtag  DW_TAG_member
    2329                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    2330                      .dwattr $C$DW$259, DW_AT_name("GPBCTRL")
    2331                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_GPBCTRL")
    2332                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2333                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2334              
    2335              $C$DW$260       .dwtag  DW_TAG_member
    2336                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$20)
    2337                      .dwattr $C$DW$260, DW_AT_name("GPBQSEL1")
    2338                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_GPBQSEL1")
    2339                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2340                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2341              
    2342              $C$DW$261       .dwtag  DW_TAG_member
    2343                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$23)
    2344                      .dwattr $C$DW$261, DW_AT_name("rsvd_2")
    2345                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_rsvd_2")
    2346                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2347                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2348              
    2349              $C$DW$262       .dwtag  DW_TAG_member
    2350                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    2351                      .dwattr $C$DW$262, DW_AT_name("GPBMUX1")
    2352                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_GPBMUX1")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:17 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{10A6929B-7F1A-44D0-AD82-9A585809FDE0} PAGE   44

    2353                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2354                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2355              
    2356              $C$DW$263       .dwtag  DW_TAG_member
    2357                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$23)
    2358                      .dwattr $C$DW$263, DW_AT_name("rsvd_3")
    2359                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_rsvd_3")
    2360                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2361                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2362              
    2363              $C$DW$264       .dwtag  DW_TAG_member
    2364                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    2365                      .dwattr $C$DW$264, DW_AT_name("GPBDIR")
    2366                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_GPBDIR")
    2367                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2368                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2369              
    2370              $C$DW$265       .dwtag  DW_TAG_member
    2371                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    2372                      .dwattr $C$DW$265, DW_AT_name("GPBPUD")
    2373                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_GPBPUD")
    2374                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2375                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2376              
    2377              $C$DW$266       .dwtag  DW_TAG_member
    2378                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$24)
    2379                      .dwattr $C$DW$266, DW_AT_name("rsvd_4")
    2380                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_rsvd_4")
    2381                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2382                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2383              
    2384              $C$DW$267       .dwtag  DW_TAG_member
    2385                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    2386                      .dwattr $C$DW$267, DW_AT_name("AIOMUX1")
    2387                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_AIOMUX1")
    2388                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2389                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2390              
    2391              $C$DW$268       .dwtag  DW_TAG_member
    2392                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$23)
    2393                      .dwattr $C$DW$268, DW_AT_name("rsvd_5")
    2394                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_rsvd_5")
    2395                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2396                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2397              
    2398              $C$DW$269       .dwtag  DW_TAG_member
    2399                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    2400                      .dwattr $C$DW$269, DW_AT_name("AIODIR")
    2401                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_AIODIR")
    2402                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2403                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2404              
    2405              $C$DW$270       .dwtag  DW_TAG_member
    2406                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$25)
    2407                      .dwattr $C$DW$270, DW_AT_name("rsvd_6")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:17 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{10A6929B-7F1A-44D0-AD82-9A585809FDE0} PAGE   45

    2408                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_rsvd_6")
    2409                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2410                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2411              
    2412              $C$DW$271       .dwtag  DW_TAG_member
    2413                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$20)
    2414                      .dwattr $C$DW$271, DW_AT_name("GPADAT")
    2415                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_GPADAT")
    2416                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2417                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2418              
    2419              $C$DW$272       .dwtag  DW_TAG_member
    2420                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$20)
    2421                      .dwattr $C$DW$272, DW_AT_name("GPASET")
    2422                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_GPASET")
    2423                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2424                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2425              
    2426              $C$DW$273       .dwtag  DW_TAG_member
    2427                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
    2428                      .dwattr $C$DW$273, DW_AT_name("GPACLEAR")
    2429                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_GPACLEAR")
    2430                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2431                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2432              
    2433              $C$DW$274       .dwtag  DW_TAG_member
    2434                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    2435                      .dwattr $C$DW$274, DW_AT_name("GPATOGGLE")
    2436                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_GPATOGGLE")
    2437                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2438                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2439              
    2440              $C$DW$275       .dwtag  DW_TAG_member
    2441                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    2442                      .dwattr $C$DW$275, DW_AT_name("GPBDAT")
    2443                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_GPBDAT")
    2444                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2445                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2446              
    2447              $C$DW$276       .dwtag  DW_TAG_member
    2448                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    2449                      .dwattr $C$DW$276, DW_AT_name("GPBSET")
    2450                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_GPBSET")
    2451                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2452                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2453              
    2454              $C$DW$277       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    2456                      .dwattr $C$DW$277, DW_AT_name("GPBCLEAR")
    2457                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_GPBCLEAR")
    2458                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2459                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2460              
    2461              $C$DW$278       .dwtag  DW_TAG_member
    2462                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:17 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{10A6929B-7F1A-44D0-AD82-9A585809FDE0} PAGE   46

    2463                      .dwattr $C$DW$278, DW_AT_name("GPBTOGGLE")
    2464                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_GPBTOGGLE")
    2465                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2466                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2467              
    2468              $C$DW$279       .dwtag  DW_TAG_member
    2469                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$26)
    2470                      .dwattr $C$DW$279, DW_AT_name("rsvd_7")
    2471                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_rsvd_7")
    2472                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2473                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2474              
    2475              $C$DW$280       .dwtag  DW_TAG_member
    2476                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    2477                      .dwattr $C$DW$280, DW_AT_name("AIODAT")
    2478                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_AIODAT")
    2479                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2480                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2481              
    2482              $C$DW$281       .dwtag  DW_TAG_member
    2483                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    2484                      .dwattr $C$DW$281, DW_AT_name("AIOSET")
    2485                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_AIOSET")
    2486                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2487                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2488              
    2489              $C$DW$282       .dwtag  DW_TAG_member
    2490                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    2491                      .dwattr $C$DW$282, DW_AT_name("AIOCLEAR")
    2492                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_AIOCLEAR")
    2493                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2494                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2495              
    2496              $C$DW$283       .dwtag  DW_TAG_member
    2497                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    2498                      .dwattr $C$DW$283, DW_AT_name("AIOTOGGLE")
    2499                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_AIOTOGGLE")
    2500                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2501                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2502              
    2503              $C$DW$284       .dwtag  DW_TAG_member
    2504                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$27)
    2505                      .dwattr $C$DW$284, DW_AT_name("GPIOXINTnSEL")
    2506                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    2507                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2508                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2509              
    2510              $C$DW$285       .dwtag  DW_TAG_member
    2511                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$28)
    2512                      .dwattr $C$DW$285, DW_AT_name("rsvd_8")
    2513                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_rsvd_8")
    2514                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    2515                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2516              
    2517              $C$DW$286       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:17 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{10A6929B-7F1A-44D0-AD82-9A585809FDE0} PAGE   47

    2518                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
    2519                      .dwattr $C$DW$286, DW_AT_name("GPIOLPMSEL")
    2520                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    2521                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2522                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2523              
    2524                      .dwendtag $C$DW$T$29
    2525              
    2526              $C$DW$T$51      .dwtag  DW_TAG_typedef
    2527                      .dwattr $C$DW$T$51, DW_AT_name("GPIO_Obj")
    2528                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$29)
    2529                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2530              
    2531              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    2532                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$29)
    2533                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    2534              
    2535              $C$DW$T$53      .dwtag  DW_TAG_typedef
    2536                      .dwattr $C$DW$T$53, DW_AT_name("GPIO_Handle")
    2537                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2538                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2539              
    2540              $C$DW$287       .dwtag  DW_TAG_TI_far_type
    2541                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$53)
    2542              
    2543              $C$DW$T$54      .dwtag  DW_TAG_const_type
    2544                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$287)
    2545              
    2546              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2547                      .dwattr $C$DW$T$2, DW_AT_name("void")
    2548              
    2549              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2550                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2551                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2552              
    2553              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2554                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2555                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2556                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2557              
    2558              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2559                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2560                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2561                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2562              
    2563              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2564                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2565                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2566                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2567              
    2568              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2569                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2570                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2571                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2572              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:17 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{10A6929B-7F1A-44D0-AD82-9A585809FDE0} PAGE   48

    2573              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2574                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2575                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2576                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2577              
    2578              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2579                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2580                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2581                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2582              
    2583              $C$DW$T$10      .dwtag  DW_TAG_base_type
