TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Sun Jun 17 14:52:18 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/modules/hal/boards/boostxldrv83
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("FLASH_setNumPagedReadWaitStates")

   13386                      .dwattr $C$DW$T$361, DW_AT_name("SPI_Mode_e")
   13387                      .dwattr $C$DW$T$361, DW_AT_type(*$C$DW$T$360)
   13388                      .dwattr $C$DW$T$361, DW_AT_language(DW_LANG_C)
   13389              
   13390              $C$DW$1815      .dwtag  DW_TAG_TI_far_type
   13391                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$361)
   13392              
   13393              $C$DW$T$362     .dwtag  DW_TAG_const_type
   13394                      .dwattr $C$DW$T$362, DW_AT_type(*$C$DW$1815)
   13395              
   13396              
   13397              $C$DW$T$363     .dwtag  DW_TAG_enumeration_type
   13398                      .dwattr $C$DW$T$363, DW_AT_byte_size(0x01)
   13399              $C$DW$1816      .dwtag  DW_TAG_enumerator
   13400                      .dwattr $C$DW$1816, DW_AT_name("SPI_TxSuspend_00")
   13401                      .dwattr $C$DW$1816, DW_AT_const_value(0x00)
   13402              
   13403              $C$DW$1817      .dwtag  DW_TAG_enumerator
   13404                      .dwattr $C$DW$1817, DW_AT_name("SPI_TxSuspend_10")
   13405                      .dwattr $C$DW$1817, DW_AT_const_value(0x20)
   13406              
   13407              $C$DW$1818      .dwtag  DW_TAG_enumerator
   13408                      .dwattr $C$DW$1818, DW_AT_name("SPI_TxSuspend_free")
   13409                      .dwattr $C$DW$1818, DW_AT_const_value(0x10)
   13410              
   13411                      .dwendtag $C$DW$T$363
   13412              
   13413              $C$DW$T$364     .dwtag  DW_TAG_typedef
   13414                      .dwattr $C$DW$T$364, DW_AT_name("SPI_EmulationSuspend_e")
   13415                      .dwattr $C$DW$T$364, DW_AT_type(*$C$DW$T$363)
   13416                      .dwattr $C$DW$T$364, DW_AT_language(DW_LANG_C)
   13417              
   13418              $C$DW$1819      .dwtag  DW_TAG_TI_far_type
   13419                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$364)
   13420              
   13421              $C$DW$T$365     .dwtag  DW_TAG_const_type
   13422                      .dwattr $C$DW$T$365, DW_AT_type(*$C$DW$1819)
   13423              
   13424              
   13425              $C$DW$T$366     .dwtag  DW_TAG_enumeration_type
   13426                      .dwattr $C$DW$T$366, DW_AT_byte_size(0x01)
   13427              $C$DW$1820      .dwtag  DW_TAG_enumerator
   13428                      .dwattr $C$DW$1820, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement")
   13429                      .dwattr $C$DW$1820, DW_AT_const_value(0x00)
   13430              
   13431              $C$DW$1821      .dwtag  DW_TAG_enumerator
   13432                      .dwattr $C$DW$1821, DW_AT_name("TIMER_EmulationMode_StopAtZero")
   13433                      .dwattr $C$DW$1821, DW_AT_const_value(0x400)
   13434              
   13435              $C$DW$1822      .dwtag  DW_TAG_enumerator
   13436                      .dwattr $C$DW$1822, DW_AT_name("TIMER_EmulationMode_RunFree")
   13437                      .dwattr $C$DW$1822, DW_AT_const_value(0x800)
   13438              
   13439                      .dwendtag $C$DW$T$366
   13440              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  254

   13441              $C$DW$T$367     .dwtag  DW_TAG_typedef
   13442                      .dwattr $C$DW$T$367, DW_AT_name("TIMER_EmulationMode_e")
   13443                      .dwattr $C$DW$T$367, DW_AT_type(*$C$DW$T$366)
   13444                      .dwattr $C$DW$T$367, DW_AT_language(DW_LANG_C)
   13445              
   13446              $C$DW$1823      .dwtag  DW_TAG_TI_far_type
   13447                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$367)
   13448              
   13449              $C$DW$T$368     .dwtag  DW_TAG_const_type
   13450                      .dwattr $C$DW$T$368, DW_AT_type(*$C$DW$1823)
   13451              
   13452              
   13453              $C$DW$T$369     .dwtag  DW_TAG_enumeration_type
   13454                      .dwattr $C$DW$T$369, DW_AT_byte_size(0x01)
   13455              $C$DW$1824      .dwtag  DW_TAG_enumerator
   13456                      .dwattr $C$DW$1824, DW_AT_name("HAL_SensorType_Current")
   13457                      .dwattr $C$DW$1824, DW_AT_const_value(0x00)
   13458              
   13459              $C$DW$1825      .dwtag  DW_TAG_enumerator
   13460                      .dwattr $C$DW$1825, DW_AT_name("HAL_SensorType_Voltage")
   13461                      .dwattr $C$DW$1825, DW_AT_const_value(0x01)
   13462              
   13463                      .dwendtag $C$DW$T$369
   13464              
   13465              $C$DW$T$370     .dwtag  DW_TAG_typedef
   13466                      .dwattr $C$DW$T$370, DW_AT_name("HAL_SensorType_e")
   13467                      .dwattr $C$DW$T$370, DW_AT_type(*$C$DW$T$369)
   13468                      .dwattr $C$DW$T$370, DW_AT_language(DW_LANG_C)
   13469              
   13470              $C$DW$1826      .dwtag  DW_TAG_TI_far_type
   13471                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$370)
   13472              
   13473              $C$DW$T$371     .dwtag  DW_TAG_const_type
   13474                      .dwattr $C$DW$T$371, DW_AT_type(*$C$DW$1826)
   13475              
   13476              
   13477              $C$DW$T$29      .dwtag  DW_TAG_structure_type
   13478                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
   13479                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
   13480              $C$DW$1827      .dwtag  DW_TAG_member
   13481                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$23)
   13482                      .dwattr $C$DW$1827, DW_AT_name("ADCRESULT")
   13483                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_ADCRESULT")
   13484                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13485                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   13486              
   13487              $C$DW$1828      .dwtag  DW_TAG_member
   13488                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$24)
   13489                      .dwattr $C$DW$1828, DW_AT_name("resvd_1")
   13490                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_resvd_1")
   13491                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13492                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   13493              
   13494              $C$DW$1829      .dwtag  DW_TAG_member
   13495                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  255

   13496                      .dwattr $C$DW$1829, DW_AT_name("ADCCTL1")
   13497                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_ADCCTL1")
   13498                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   13499                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   13500              
   13501              $C$DW$1830      .dwtag  DW_TAG_member
   13502                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$22)
   13503                      .dwattr $C$DW$1830, DW_AT_name("ADCCTL2")
   13504                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_ADCCTL2")
   13505                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   13506                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   13507              
   13508              $C$DW$1831      .dwtag  DW_TAG_member
   13509                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$25)
   13510                      .dwattr $C$DW$1831, DW_AT_name("rsvd_2")
   13511                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_rsvd_2")
   13512                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   13513                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   13514              
   13515              $C$DW$1832      .dwtag  DW_TAG_member
   13516                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$22)
   13517                      .dwattr $C$DW$1832, DW_AT_name("ADCINTFLG")
   13518                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_ADCINTFLG")
   13519                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   13520                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   13521              
   13522              $C$DW$1833      .dwtag  DW_TAG_member
   13523                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$22)
   13524                      .dwattr $C$DW$1833, DW_AT_name("ADCINTFLGCLR")
   13525                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   13526                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   13527                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   13528              
   13529              $C$DW$1834      .dwtag  DW_TAG_member
   13530                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$22)
   13531                      .dwattr $C$DW$1834, DW_AT_name("ADCINTOVF")
   13532                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_ADCINTOVF")
   13533                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   13534                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   13535              
   13536              $C$DW$1835      .dwtag  DW_TAG_member
   13537                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$22)
   13538                      .dwattr $C$DW$1835, DW_AT_name("ADCINTOVFCLR")
   13539                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   13540                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   13541                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   13542              
   13543              $C$DW$1836      .dwtag  DW_TAG_member
   13544                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$26)
   13545                      .dwattr $C$DW$1836, DW_AT_name("INTSELxNy")
   13546                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_INTSELxNy")
   13547                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   13548                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   13549              
   13550              $C$DW$1837      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  256

   13551                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$27)
   13552                      .dwattr $C$DW$1837, DW_AT_name("rsvd_3")
   13553                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_rsvd_3")
   13554                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   13555                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   13556              
   13557              $C$DW$1838      .dwtag  DW_TAG_member
   13558                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$22)
   13559                      .dwattr $C$DW$1838, DW_AT_name("SOCPRICTRL")
   13560                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_SOCPRICTRL")
   13561                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   13562                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   13563              
   13564              $C$DW$1839      .dwtag  DW_TAG_member
   13565                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$22)
   13566                      .dwattr $C$DW$1839, DW_AT_name("rsvd_4")
   13567                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_rsvd_4")
   13568                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   13569                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   13570              
   13571              $C$DW$1840      .dwtag  DW_TAG_member
   13572                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$22)
   13573                      .dwattr $C$DW$1840, DW_AT_name("ADCSAMPLEMODE")
   13574                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   13575                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   13576                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   13577              
   13578              $C$DW$1841      .dwtag  DW_TAG_member
   13579                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$22)
   13580                      .dwattr $C$DW$1841, DW_AT_name("rsvd_5")
   13581                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_rsvd_5")
   13582                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   13583                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   13584              
   13585              $C$DW$1842      .dwtag  DW_TAG_member
   13586                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$22)
   13587                      .dwattr $C$DW$1842, DW_AT_name("ADCINTSOCSEL1")
   13588                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   13589                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   13590                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   13591              
   13592              $C$DW$1843      .dwtag  DW_TAG_member
   13593                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$22)
   13594                      .dwattr $C$DW$1843, DW_AT_name("ADCINTSOCSEL2")
   13595                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   13596                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   13597                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   13598              
   13599              $C$DW$1844      .dwtag  DW_TAG_member
   13600                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$25)
   13601                      .dwattr $C$DW$1844, DW_AT_name("rsvd_6")
   13602                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_rsvd_6")
   13603                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   13604                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   13605              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  257

   13606              $C$DW$1845      .dwtag  DW_TAG_member
   13607                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$22)
   13608                      .dwattr $C$DW$1845, DW_AT_name("ADCSOCFLG1")
   13609                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   13610                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   13611                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   13612              
   13613              $C$DW$1846      .dwtag  DW_TAG_member
   13614                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$22)
   13615                      .dwattr $C$DW$1846, DW_AT_name("rsvd_7")
   13616                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_rsvd_7")
   13617                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   13618                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   13619              
   13620              $C$DW$1847      .dwtag  DW_TAG_member
   13621                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$22)
   13622                      .dwattr $C$DW$1847, DW_AT_name("ADCSOCFRC1")
   13623                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   13624                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   13625                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   13626              
   13627              $C$DW$1848      .dwtag  DW_TAG_member
   13628                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$22)
   13629                      .dwattr $C$DW$1848, DW_AT_name("rsvd_8")
   13630                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_rsvd_8")
   13631                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   13632                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   13633              
   13634              $C$DW$1849      .dwtag  DW_TAG_member
   13635                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$22)
   13636                      .dwattr $C$DW$1849, DW_AT_name("ADCSOCOVF1")
   13637                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   13638                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   13639                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   13640              
   13641              $C$DW$1850      .dwtag  DW_TAG_member
   13642                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$22)
   13643                      .dwattr $C$DW$1850, DW_AT_name("rsvd_9")
   13644                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_rsvd_9")
   13645                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   13646                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   13647              
   13648              $C$DW$1851      .dwtag  DW_TAG_member
   13649                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$22)
   13650                      .dwattr $C$DW$1851, DW_AT_name("ADCSOCOVFCLR1")
   13651                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   13652                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   13653                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   13654              
   13655              $C$DW$1852      .dwtag  DW_TAG_member
   13656                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$22)
   13657                      .dwattr $C$DW$1852, DW_AT_name("rsvd_10")
   13658                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_rsvd_10")
   13659                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   13660                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  258

   13661              
   13662              $C$DW$1853      .dwtag  DW_TAG_member
   13663                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$23)
   13664                      .dwattr $C$DW$1853, DW_AT_name("ADCSOCxCTL")
   13665                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   13666                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   13667                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   13668              
   13669              $C$DW$1854      .dwtag  DW_TAG_member
   13670                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$23)
   13671                      .dwattr $C$DW$1854, DW_AT_name("rsvd_11")
   13672                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_rsvd_11")
   13673                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   13674                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   13675              
   13676              $C$DW$1855      .dwtag  DW_TAG_member
   13677                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$22)
   13678                      .dwattr $C$DW$1855, DW_AT_name("ADCREFTRIM")
   13679                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_ADCREFTRIM")
   13680                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   13681                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   13682              
   13683              $C$DW$1856      .dwtag  DW_TAG_member
   13684                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$22)
   13685                      .dwattr $C$DW$1856, DW_AT_name("ADCOFFTRIM")
   13686                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   13687                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   13688                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   13689              
   13690              $C$DW$1857      .dwtag  DW_TAG_member
   13691                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$28)
   13692                      .dwattr $C$DW$1857, DW_AT_name("resvd_12")
   13693                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_resvd_12")
   13694                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   13695                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   13696              
   13697              $C$DW$1858      .dwtag  DW_TAG_member
   13698                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$22)
   13699                      .dwattr $C$DW$1858, DW_AT_name("ADCREV")
   13700                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_ADCREV")
   13701                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   13702                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   13703              
   13704                      .dwendtag $C$DW$T$29
   13705              
   13706              $C$DW$T$372     .dwtag  DW_TAG_typedef
   13707                      .dwattr $C$DW$T$372, DW_AT_name("ADC_Obj")
   13708                      .dwattr $C$DW$T$372, DW_AT_type(*$C$DW$T$29)
   13709                      .dwattr $C$DW$T$372, DW_AT_language(DW_LANG_C)
   13710              
   13711              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
   13712                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$29)
   13713                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
   13714              
   13715              $C$DW$T$125     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  259

   13716                      .dwattr $C$DW$T$125, DW_AT_name("ADC_Handle")
   13717                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
   13718                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
   13719              
   13720              
   13721              $C$DW$T$31      .dwtag  DW_TAG_structure_type
   13722                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
   13723                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
   13724              $C$DW$1859      .dwtag  DW_TAG_member
   13725                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$22)
   13726                      .dwattr $C$DW$1859, DW_AT_name("XCLK")
   13727                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_XCLK")
   13728                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13729                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   13730              
   13731              $C$DW$1860      .dwtag  DW_TAG_member
   13732                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$22)
   13733                      .dwattr $C$DW$1860, DW_AT_name("rsvd_1")
   13734                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_rsvd_1")
   13735                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13736                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   13737              
   13738              $C$DW$1861      .dwtag  DW_TAG_member
   13739                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$22)
   13740                      .dwattr $C$DW$1861, DW_AT_name("CLKCTL")
   13741                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_CLKCTL")
   13742                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13743                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   13744              
   13745              $C$DW$1862      .dwtag  DW_TAG_member
   13746                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$30)
   13747                      .dwattr $C$DW$1862, DW_AT_name("rsvd_2")
   13748                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_rsvd_2")
   13749                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13750                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   13751              
   13752              $C$DW$1863      .dwtag  DW_TAG_member
   13753                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$22)
   13754                      .dwattr $C$DW$1863, DW_AT_name("LOSPCP")
   13755                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_LOSPCP")
   13756                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   13757                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   13758              
   13759              $C$DW$1864      .dwtag  DW_TAG_member
   13760                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$22)
   13761                      .dwattr $C$DW$1864, DW_AT_name("PCLKCR0")
   13762                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_PCLKCR0")
   13763                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13764                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   13765              
   13766              $C$DW$1865      .dwtag  DW_TAG_member
   13767                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$22)
   13768                      .dwattr $C$DW$1865, DW_AT_name("PCLKCR1")
   13769                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_PCLKCR1")
   13770                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  260

   13771                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   13772              
   13773              $C$DW$1866      .dwtag  DW_TAG_member
   13774                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$25)
   13775                      .dwattr $C$DW$1866, DW_AT_name("rsvd_3")
   13776                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_rsvd_3")
   13777                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13778                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   13779              
   13780              $C$DW$1867      .dwtag  DW_TAG_member
   13781                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$22)
   13782                      .dwattr $C$DW$1867, DW_AT_name("PCLKCR3")
   13783                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_PCLKCR3")
   13784                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13785                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   13786              
   13787                      .dwendtag $C$DW$T$31
   13788              
   13789              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
   13790                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$31)
   13791                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
   13792              
   13793              $C$DW$T$127     .dwtag  DW_TAG_typedef
   13794                      .dwattr $C$DW$T$127, DW_AT_name("CLK_Handle")
   13795                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
   13796                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
   13797              
   13798              
   13799              $C$DW$T$33      .dwtag  DW_TAG_structure_type
   13800                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
   13801                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
   13802              $C$DW$1868      .dwtag  DW_TAG_member
   13803                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$32)
   13804                      .dwattr $C$DW$1868, DW_AT_name("tmp")
   13805                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_tmp")
   13806                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13807                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   13808              
   13809                      .dwendtag $C$DW$T$33
   13810              
   13811              $C$DW$T$381     .dwtag  DW_TAG_typedef
   13812                      .dwattr $C$DW$T$381, DW_AT_name("CPU_Obj")
   13813                      .dwattr $C$DW$T$381, DW_AT_type(*$C$DW$T$33)
   13814                      .dwattr $C$DW$T$381, DW_AT_language(DW_LANG_C)
   13815              
   13816              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
   13817                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$33)
   13818                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
   13819              
   13820              $C$DW$T$129     .dwtag  DW_TAG_typedef
   13821                      .dwattr $C$DW$T$129, DW_AT_name("CPU_Handle")
   13822                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
   13823                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
   13824              
   13825              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  261

   13826              $C$DW$T$41      .dwtag  DW_TAG_structure_type
   13827                      .dwattr $C$DW$T$41, DW_AT_name("_DRV8305_Obj_")
   13828                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
   13829              $C$DW$1869      .dwtag  DW_TAG_member
   13830                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$35)
   13831                      .dwattr $C$DW$1869, DW_AT_name("spiHandle")
   13832                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_spiHandle")
   13833                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13834                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   13835              
   13836              $C$DW$1870      .dwtag  DW_TAG_member
   13837                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$37)
   13838                      .dwattr $C$DW$1870, DW_AT_name("gpioHandle")
   13839                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_gpioHandle")
   13840                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13841                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   13842              
   13843              $C$DW$1871      .dwtag  DW_TAG_member
   13844                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$39)
   13845                      .dwattr $C$DW$1871, DW_AT_name("gpioNumber")
   13846                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_gpioNumber")
   13847                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13848                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   13849              
   13850              $C$DW$1872      .dwtag  DW_TAG_member
   13851                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$40)
   13852                      .dwattr $C$DW$1872, DW_AT_name("RxTimeOut")
   13853                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_RxTimeOut")
   13854                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13855                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   13856              
   13857              $C$DW$1873      .dwtag  DW_TAG_member
   13858                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$40)
   13859                      .dwattr $C$DW$1873, DW_AT_name("enableTimeOut")
   13860                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_enableTimeOut")
   13861                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13862                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   13863              
   13864                      .dwendtag $C$DW$T$41
   13865              
   13866              $C$DW$T$157     .dwtag  DW_TAG_typedef
   13867                      .dwattr $C$DW$T$157, DW_AT_name("DRV8305_Obj")
   13868                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$41)
   13869                      .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
   13870              
   13871              $C$DW$T$155     .dwtag  DW_TAG_pointer_type
   13872                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$41)
   13873                      .dwattr $C$DW$T$155, DW_AT_address_class(0x20)
   13874              
   13875              $C$DW$T$156     .dwtag  DW_TAG_typedef
   13876                      .dwattr $C$DW$T$156, DW_AT_name("DRV8305_Handle")
   13877                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$155)
   13878                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
   13879              
   13880              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  262

   13881              $C$DW$T$48      .dwtag  DW_TAG_structure_type
   13882                      .dwattr $C$DW$T$48, DW_AT_name("_DRV_SPI_8305_Ctrl05_t_")
   13883                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
   13884              $C$DW$1874      .dwtag  DW_TAG_member
   13885                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$43)
   13886                      .dwattr $C$DW$1874, DW_AT_name("IDRIVEP_HS")
   13887                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_IDRIVEP_HS")
   13888                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13889                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   13890              
   13891              $C$DW$1875      .dwtag  DW_TAG_member
   13892                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$45)
   13893                      .dwattr $C$DW$1875, DW_AT_name("IDRIVEN_HS")
   13894                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_IDRIVEN_HS")
   13895                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13896                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   13897              
   13898              $C$DW$1876      .dwtag  DW_TAG_member
   13899                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$47)
   13900                      .dwattr $C$DW$1876, DW_AT_name("TDRIVEN")
   13901                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_TDRIVEN")
   13902                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13903                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   13904              
   13905              $C$DW$1877      .dwtag  DW_TAG_member
   13906                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$40)
   13907                      .dwattr $C$DW$1877, DW_AT_name("CTRL05_RSV1")
   13908                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_CTRL05_RSV1")
   13909                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13910                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   13911              
   13912                      .dwendtag $C$DW$T$48
   13913              
   13914              $C$DW$T$100     .dwtag  DW_TAG_typedef
   13915                      .dwattr $C$DW$T$100, DW_AT_name("DRV_SPI_8305_Ctrl05_t_")
   13916                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$48)
   13917                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
   13918              
   13919              
   13920              $C$DW$T$55      .dwtag  DW_TAG_structure_type
   13921                      .dwattr $C$DW$T$55, DW_AT_name("_DRV_SPI_8305_Ctrl06_t_")
   13922                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x04)
   13923              $C$DW$1878      .dwtag  DW_TAG_member
   13924                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$50)
   13925                      .dwattr $C$DW$1878, DW_AT_name("IDRIVEP_LS")
   13926                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_IDRIVEP_LS")
   13927                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13928                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   13929              
   13930              $C$DW$1879      .dwtag  DW_TAG_member
   13931                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$52)
   13932                      .dwattr $C$DW$1879, DW_AT_name("IDRIVEN_LS")
   13933                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_IDRIVEN_LS")
   13934                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13935                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  263

   13936              
   13937              $C$DW$1880      .dwtag  DW_TAG_member
   13938                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$54)
   13939                      .dwattr $C$DW$1880, DW_AT_name("TDRIVEP")
   13940                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_TDRIVEP")
   13941                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13942                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   13943              
   13944              $C$DW$1881      .dwtag  DW_TAG_member
   13945                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$40)
   13946                      .dwattr $C$DW$1881, DW_AT_name("CTRL06_RSV1")
   13947                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_CTRL06_RSV1")
   13948                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13949                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   13950              
   13951                      .dwendtag $C$DW$T$55
   13952              
   13953              $C$DW$T$101     .dwtag  DW_TAG_typedef
   13954                      .dwattr $C$DW$T$101, DW_AT_name("DRV_SPI_8305_Ctrl06_t_")
   13955                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$55)
   13956                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
   13957              
   13958              
   13959              $C$DW$T$66      .dwtag  DW_TAG_structure_type
   13960                      .dwattr $C$DW$T$66, DW_AT_name("_DRV_SPI_8305_Ctrl07_t_")
   13961                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x06)
   13962              $C$DW$1882      .dwtag  DW_TAG_member
   13963                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$57)
   13964                      .dwattr $C$DW$1882, DW_AT_name("TVDS")
   13965                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_TVDS")
   13966                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13967                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   13968              
   13969              $C$DW$1883      .dwtag  DW_TAG_member
   13970                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$59)
   13971                      .dwattr $C$DW$1883, DW_AT_name("TBLANK")
   13972                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_TBLANK")
   13973                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13974                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
   13975              
   13976              $C$DW$1884      .dwtag  DW_TAG_member
   13977                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$61)
   13978                      .dwattr $C$DW$1884, DW_AT_name("DEAD_TIME")
   13979                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_DEAD_TIME")
   13980                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13981                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   13982              
   13983              $C$DW$1885      .dwtag  DW_TAG_member
   13984                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$63)
   13985                      .dwattr $C$DW$1885, DW_AT_name("PWM_MODE")
   13986                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_PWM_MODE")
   13987                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13988                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   13989              
   13990              $C$DW$1886      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  264

   13991                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$65)
   13992                      .dwattr $C$DW$1886, DW_AT_name("COMM_OPT")
   13993                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_COMM_OPT")
   13994                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13995                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   13996              
   13997              $C$DW$1887      .dwtag  DW_TAG_member
   13998                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$40)
   13999                      .dwattr $C$DW$1887, DW_AT_name("CTRL07_RSV1")
   14000                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_CTRL07_RSV1")
   14001                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14002                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   14003              
   14004                      .dwendtag $C$DW$T$66
   14005              
   14006              $C$DW$T$102     .dwtag  DW_TAG_typedef
   14007                      .dwattr $C$DW$T$102, DW_AT_name("DRV_SPI_8305_Ctrl07_t_")
   14008                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$66)
   14009                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
   14010              
   14011              
   14012              $C$DW$T$67      .dwtag  DW_TAG_structure_type
   14013                      .dwattr $C$DW$T$67, DW_AT_name("_DRV_SPI_8305_Ctrl08_t_")
   14014                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
   14015              $C$DW$1888      .dwtag  DW_TAG_member
   14016                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$21)
   14017                      .dwattr $C$DW$1888, DW_AT_name("CTRL08_RSV1")
   14018                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_CTRL08_RSV1")
   14019                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14020                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   14021              
   14022                      .dwendtag $C$DW$T$67
   14023              
   14024              $C$DW$T$103     .dwtag  DW_TAG_typedef
   14025                      .dwattr $C$DW$T$103, DW_AT_name("DRV_SPI_8305_Ctrl08_t_")
   14026                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$67)
   14027                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
   14028              
   14029              
   14030              $C$DW$T$70      .dwtag  DW_TAG_structure_type
   14031                      .dwattr $C$DW$T$70, DW_AT_name("_DRV_SPI_8305_Ctrl09_t_")
   14032                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
   14033              $C$DW$1889      .dwtag  DW_TAG_member
   14034                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$40)
   14035                      .dwattr $C$DW$1889, DW_AT_name("SET_VCPH_UV")
   14036                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_SET_VCPH_UV")
   14037                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14038                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   14039              
   14040              $C$DW$1890      .dwtag  DW_TAG_member
   14041                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$40)
   14042                      .dwattr $C$DW$1890, DW_AT_name("CLR_FLTS")
   14043                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_CLR_FLTS")
   14044                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14045                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  265

   14046              
   14047              $C$DW$1891      .dwtag  DW_TAG_member
   14048                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$40)
   14049                      .dwattr $C$DW$1891, DW_AT_name("SLEEP")
   14050                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_SLEEP")
   14051                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14052                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   14053              
   14054              $C$DW$1892      .dwtag  DW_TAG_member
   14055                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$40)
   14056                      .dwattr $C$DW$1892, DW_AT_name("WD_EN")
   14057                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_WD_EN")
   14058                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14059                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   14060              
   14061              $C$DW$1893      .dwtag  DW_TAG_member
   14062                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$40)
   14063                      .dwattr $C$DW$1893, DW_AT_name("DIS_SNS_OCP")
   14064                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_DIS_SNS_OCP")
   14065                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14066                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   14067              
   14068              $C$DW$1894      .dwtag  DW_TAG_member
   14069                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$69)
   14070                      .dwattr $C$DW$1894, DW_AT_name("WD_DLY")
   14071                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_WD_DLY")
   14072                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14073                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   14074              
   14075              $C$DW$1895      .dwtag  DW_TAG_member
   14076                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$40)
   14077                      .dwattr $C$DW$1895, DW_AT_name("EN_SNS_CLAMP")
   14078                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_EN_SNS_CLAMP")
   14079                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14080                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   14081              
   14082              $C$DW$1896      .dwtag  DW_TAG_member
   14083                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$40)
   14084                      .dwattr $C$DW$1896, DW_AT_name("DIS_GDRV_FAULT")
   14085                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_DIS_GDRV_FAULT")
   14086                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14087                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   14088              
   14089              $C$DW$1897      .dwtag  DW_TAG_member
   14090                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$40)
   14091                      .dwattr $C$DW$1897, DW_AT_name("DISABLE")
   14092                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_DISABLE")
   14093                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14094                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   14095              
   14096              $C$DW$1898      .dwtag  DW_TAG_member
   14097                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$40)
   14098                      .dwattr $C$DW$1898, DW_AT_name("FLIP_OTS")
   14099                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_FLIP_OTS")
   14100                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  266

   14101                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   14102              
   14103                      .dwendtag $C$DW$T$70
   14104              
   14105              $C$DW$T$104     .dwtag  DW_TAG_typedef
   14106                      .dwattr $C$DW$T$104, DW_AT_name("DRV_SPI_8305_Ctrl09_t_")
   14107                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$70)
   14108                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
   14109              
   14110              
   14111              $C$DW$T$79      .dwtag  DW_TAG_structure_type
   14112                      .dwattr $C$DW$T$79, DW_AT_name("_DRV_SPI_8305_Ctrl0A_t_")
   14113                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x07)
   14114              $C$DW$1899      .dwtag  DW_TAG_member
   14115                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$72)
   14116                      .dwattr $C$DW$1899, DW_AT_name("GAIN_CS1")
   14117                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_GAIN_CS1")
   14118                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14119                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   14120              
   14121              $C$DW$1900      .dwtag  DW_TAG_member
   14122                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$74)
   14123                      .dwattr $C$DW$1900, DW_AT_name("GAIN_CS2")
   14124                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_GAIN_CS2")
   14125                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14126                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   14127              
   14128              $C$DW$1901      .dwtag  DW_TAG_member
   14129                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$76)
   14130                      .dwattr $C$DW$1901, DW_AT_name("GAIN_CS3")
   14131                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_GAIN_CS3")
   14132                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14133                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
   14134              
   14135              $C$DW$1902      .dwtag  DW_TAG_member
   14136                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$78)
   14137                      .dwattr $C$DW$1902, DW_AT_name("CS_BLANK")
   14138                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_CS_BLANK")
   14139                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14140                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   14141              
   14142              $C$DW$1903      .dwtag  DW_TAG_member
   14143                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$40)
   14144                      .dwattr $C$DW$1903, DW_AT_name("DC_CAL_CH1")
   14145                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_DC_CAL_CH1")
   14146                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14147                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   14148              
   14149              $C$DW$1904      .dwtag  DW_TAG_member
   14150                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$40)
   14151                      .dwattr $C$DW$1904, DW_AT_name("DC_CAL_CH2")
   14152                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_DC_CAL_CH2")
   14153                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14154                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   14155              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  267

   14156              $C$DW$1905      .dwtag  DW_TAG_member
   14157                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$40)
   14158                      .dwattr $C$DW$1905, DW_AT_name("DC_CAL_CH3")
   14159                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_DC_CAL_CH3")
   14160                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14161                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   14162              
   14163                      .dwendtag $C$DW$T$79
   14164              
   14165              $C$DW$T$105     .dwtag  DW_TAG_typedef
   14166                      .dwattr $C$DW$T$105, DW_AT_name("DRV_SPI_8305_Ctrl0A_t_")
   14167                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$79)
   14168                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
   14169              
   14170              
   14171              $C$DW$T$86      .dwtag  DW_TAG_structure_type
   14172                      .dwattr $C$DW$T$86, DW_AT_name("_DRV_SPI_8305_Ctrl0B_t_")
   14173                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x08)
   14174              $C$DW$1906      .dwtag  DW_TAG_member
   14175                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$81)
   14176                      .dwattr $C$DW$1906, DW_AT_name("VREG_UV_LEVEL")
   14177                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_VREG_UV_LEVEL")
   14178                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14179                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   14180              
   14181              $C$DW$1907      .dwtag  DW_TAG_member
   14182                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$40)
   14183                      .dwattr $C$DW$1907, DW_AT_name("DIS_PWRGD")
   14184                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_DIS_PWRGD")
   14185                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14186                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   14187              
   14188              $C$DW$1908      .dwtag  DW_TAG_member
   14189                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$83)
   14190                      .dwattr $C$DW$1908, DW_AT_name("SLP_DLY")
   14191                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_SLP_DLY")
   14192                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14193                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   14194              
   14195              $C$DW$1909      .dwtag  DW_TAG_member
   14196                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$40)
   14197                      .dwattr $C$DW$1909, DW_AT_name("CTRL0B_RSV1")
   14198                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_CTRL0B_RSV1")
   14199                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14200                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   14201              
   14202              $C$DW$1910      .dwtag  DW_TAG_member
   14203                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$40)
   14204                      .dwattr $C$DW$1910, DW_AT_name("CTRL0B_RSV2")
   14205                      .dwattr $C$DW$1910, DW_AT_TI_symbol_name("_CTRL0B_RSV2")
   14206                      .dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14207                      .dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
   14208              
   14209              $C$DW$1911      .dwtag  DW_TAG_member
   14210                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  268

   14211                      .dwattr $C$DW$1911, DW_AT_name("CTRL0B_RSV3")
   14212                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_CTRL0B_RSV3")
   14213                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14214                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   14215              
   14216              $C$DW$1912      .dwtag  DW_TAG_member
   14217                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$85)
   14218                      .dwattr $C$DW$1912, DW_AT_name("VREF_SCALING")
   14219                      .dwattr $C$DW$1912, DW_AT_TI_symbol_name("_VREF_SCALING")
   14220                      .dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14221                      .dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
   14222              
   14223              $C$DW$1913      .dwtag  DW_TAG_member
   14224                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$40)
   14225                      .dwattr $C$DW$1913, DW_AT_name("CTRL0B_RSV4")
   14226                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_CTRL0B_RSV4")
   14227                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14228                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   14229              
   14230                      .dwendtag $C$DW$T$86
   14231              
   14232              $C$DW$T$106     .dwtag  DW_TAG_typedef
   14233                      .dwattr $C$DW$T$106, DW_AT_name("DRV_SPI_8305_Ctrl0B_t_")
   14234                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$86)
   14235                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
   14236              
   14237              
   14238              $C$DW$T$91      .dwtag  DW_TAG_structure_type
   14239                      .dwattr $C$DW$T$91, DW_AT_name("_DRV_SPI_8305_Ctrl0C_t_")
   14240                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x05)
   14241              $C$DW$1914      .dwtag  DW_TAG_member
   14242                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$88)
   14243                      .dwattr $C$DW$1914, DW_AT_name("VDS_MODE")
   14244                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_VDS_MODE")
   14245                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14246                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   14247              
   14248              $C$DW$1915      .dwtag  DW_TAG_member
   14249                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$90)
   14250                      .dwattr $C$DW$1915, DW_AT_name("VDS_LEVEL")
   14251                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_VDS_LEVEL")
   14252                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14253                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   14254              
   14255              $C$DW$1916      .dwtag  DW_TAG_member
   14256                      .dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$40)
   14257                      .dwattr $C$DW$1916, DW_AT_name("CTRL0C_RSV1")
   14258                      .dwattr $C$DW$1916, DW_AT_TI_symbol_name("_CTRL0C_RSV1")
   14259                      .dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14260                      .dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
   14261              
   14262              $C$DW$1917      .dwtag  DW_TAG_member
   14263                      .dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$40)
   14264                      .dwattr $C$DW$1917, DW_AT_name("CTRL0C_RSV2")
   14265                      .dwattr $C$DW$1917, DW_AT_TI_symbol_name("_CTRL0C_RSV2")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  269

   14266                      .dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14267                      .dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
   14268              
   14269              $C$DW$1918      .dwtag  DW_TAG_member
   14270                      .dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$40)
   14271                      .dwattr $C$DW$1918, DW_AT_name("CTRL0C_RSV3")
   14272                      .dwattr $C$DW$1918, DW_AT_TI_symbol_name("_CTRL0C_RSV3")
   14273                      .dwattr $C$DW$1918, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14274                      .dwattr $C$DW$1918, DW_AT_accessibility(DW_ACCESS_public)
   14275              
   14276                      .dwendtag $C$DW$T$91
   14277              
   14278              $C$DW$T$107     .dwtag  DW_TAG_typedef
   14279                      .dwattr $C$DW$T$107, DW_AT_name("DRV_SPI_8305_Ctrl0C_t_")
   14280                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$91)
   14281                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
   14282              
   14283              
   14284              $C$DW$T$92      .dwtag  DW_TAG_structure_type
   14285                      .dwattr $C$DW$T$92, DW_AT_name("_DRV_SPI_8305_Stat01_t_")
   14286                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x0b)
   14287              $C$DW$1919      .dwtag  DW_TAG_member
   14288                      .dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$40)
   14289                      .dwattr $C$DW$1919, DW_AT_name("OTW")
   14290                      .dwattr $C$DW$1919, DW_AT_TI_symbol_name("_OTW")
   14291                      .dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14292                      .dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
   14293              
   14294              $C$DW$1920      .dwtag  DW_TAG_member
   14295                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$40)
   14296                      .dwattr $C$DW$1920, DW_AT_name("TEMP_FLAG3")
   14297                      .dwattr $C$DW$1920, DW_AT_TI_symbol_name("_TEMP_FLAG3")
   14298                      .dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14299                      .dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
   14300              
   14301              $C$DW$1921      .dwtag  DW_TAG_member
   14302                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$40)
   14303                      .dwattr $C$DW$1921, DW_AT_name("TEMP_FLAG2")
   14304                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_TEMP_FLAG2")
   14305                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14306                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
   14307              
   14308              $C$DW$1922      .dwtag  DW_TAG_member
   14309                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$40)
   14310                      .dwattr $C$DW$1922, DW_AT_name("TEMP_FLAG1")
   14311                      .dwattr $C$DW$1922, DW_AT_TI_symbol_name("_TEMP_FLAG1")
   14312                      .dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14313                      .dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
   14314              
   14315              $C$DW$1923      .dwtag  DW_TAG_member
   14316                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$40)
   14317                      .dwattr $C$DW$1923, DW_AT_name("VCPH_UVFL")
   14318                      .dwattr $C$DW$1923, DW_AT_TI_symbol_name("_VCPH_UVFL")
   14319                      .dwattr $C$DW$1923, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14320                      .dwattr $C$DW$1923, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  270

   14321              
   14322              $C$DW$1924      .dwtag  DW_TAG_member
   14323                      .dwattr $C$DW$1924, DW_AT_type(*$C$DW$T$40)
   14324                      .dwattr $C$DW$1924, DW_AT_name("VDS_STATUS")
   14325                      .dwattr $C$DW$1924, DW_AT_TI_symbol_name("_VDS_STATUS")
   14326                      .dwattr $C$DW$1924, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14327                      .dwattr $C$DW$1924, DW_AT_accessibility(DW_ACCESS_public)
   14328              
   14329              $C$DW$1925      .dwtag  DW_TAG_member
   14330                      .dwattr $C$DW$1925, DW_AT_type(*$C$DW$T$40)
   14331                      .dwattr $C$DW$1925, DW_AT_name("PVDD_OVFL")
   14332                      .dwattr $C$DW$1925, DW_AT_TI_symbol_name("_PVDD_OVFL")
   14333                      .dwattr $C$DW$1925, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14334                      .dwattr $C$DW$1925, DW_AT_accessibility(DW_ACCESS_public)
   14335              
   14336              $C$DW$1926      .dwtag  DW_TAG_member
   14337                      .dwattr $C$DW$1926, DW_AT_type(*$C$DW$T$40)
   14338                      .dwattr $C$DW$1926, DW_AT_name("PVDD_UVFL")
   14339                      .dwattr $C$DW$1926, DW_AT_TI_symbol_name("_PVDD_UVFL")
   14340                      .dwattr $C$DW$1926, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14341                      .dwattr $C$DW$1926, DW_AT_accessibility(DW_ACCESS_public)
   14342              
   14343              $C$DW$1927      .dwtag  DW_TAG_member
   14344                      .dwattr $C$DW$1927, DW_AT_type(*$C$DW$T$40)
   14345                      .dwattr $C$DW$1927, DW_AT_name("TEMP_FLAG4")
   14346                      .dwattr $C$DW$1927, DW_AT_TI_symbol_name("_TEMP_FLAG4")
   14347                      .dwattr $C$DW$1927, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14348                      .dwattr $C$DW$1927, DW_AT_accessibility(DW_ACCESS_public)
   14349              
   14350              $C$DW$1928      .dwtag  DW_TAG_member
   14351                      .dwattr $C$DW$1928, DW_AT_type(*$C$DW$T$40)
   14352                      .dwattr $C$DW$1928, DW_AT_name("STAT01_RSV1")
   14353                      .dwattr $C$DW$1928, DW_AT_TI_symbol_name("_STAT01_RSV1")
   14354                      .dwattr $C$DW$1928, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   14355                      .dwattr $C$DW$1928, DW_AT_accessibility(DW_ACCESS_public)
   14356              
   14357              $C$DW$1929      .dwtag  DW_TAG_member
   14358                      .dwattr $C$DW$1929, DW_AT_type(*$C$DW$T$40)
   14359                      .dwattr $C$DW$1929, DW_AT_name("FAULT")
   14360                      .dwattr $C$DW$1929, DW_AT_TI_symbol_name("_FAULT")
   14361                      .dwattr $C$DW$1929, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14362                      .dwattr $C$DW$1929, DW_AT_accessibility(DW_ACCESS_public)
   14363              
   14364                      .dwendtag $C$DW$T$92
   14365              
   14366              $C$DW$T$96      .dwtag  DW_TAG_typedef
   14367                      .dwattr $C$DW$T$96, DW_AT_name("DRV_SPI_8305_Stat01_t_")
   14368                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$92)
   14369                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
   14370              
   14371              
   14372              $C$DW$T$93      .dwtag  DW_TAG_structure_type
   14373                      .dwattr $C$DW$T$93, DW_AT_name("_DRV_SPI_8305_Stat02_t_")
   14374                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x0b)
   14375              $C$DW$1930      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  271

   14376                      .dwattr $C$DW$1930, DW_AT_type(*$C$DW$T$40)
   14377                      .dwattr $C$DW$1930, DW_AT_name("SNS_A_OCP")
   14378                      .dwattr $C$DW$1930, DW_AT_TI_symbol_name("_SNS_A_OCP")
   14379                      .dwattr $C$DW$1930, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14380                      .dwattr $C$DW$1930, DW_AT_accessibility(DW_ACCESS_public)
   14381              
   14382              $C$DW$1931      .dwtag  DW_TAG_member
   14383                      .dwattr $C$DW$1931, DW_AT_type(*$C$DW$T$40)
   14384                      .dwattr $C$DW$1931, DW_AT_name("SNS_B_OCP")
   14385                      .dwattr $C$DW$1931, DW_AT_TI_symbol_name("_SNS_B_OCP")
   14386                      .dwattr $C$DW$1931, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14387                      .dwattr $C$DW$1931, DW_AT_accessibility(DW_ACCESS_public)
   14388              
   14389              $C$DW$1932      .dwtag  DW_TAG_member
   14390                      .dwattr $C$DW$1932, DW_AT_type(*$C$DW$T$40)
   14391                      .dwattr $C$DW$1932, DW_AT_name("SNS_C_OCP")
   14392                      .dwattr $C$DW$1932, DW_AT_TI_symbol_name("_SNS_C_OCP")
   14393                      .dwattr $C$DW$1932, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14394                      .dwattr $C$DW$1932, DW_AT_accessibility(DW_ACCESS_public)
   14395              
   14396              $C$DW$1933      .dwtag  DW_TAG_member
   14397                      .dwattr $C$DW$1933, DW_AT_type(*$C$DW$T$40)
   14398                      .dwattr $C$DW$1933, DW_AT_name("STAT02_RSV2")
   14399                      .dwattr $C$DW$1933, DW_AT_TI_symbol_name("_STAT02_RSV2")
   14400                      .dwattr $C$DW$1933, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14401                      .dwattr $C$DW$1933, DW_AT_accessibility(DW_ACCESS_public)
   14402              
   14403              $C$DW$1934      .dwtag  DW_TAG_member
   14404                      .dwattr $C$DW$1934, DW_AT_type(*$C$DW$T$40)
   14405                      .dwattr $C$DW$1934, DW_AT_name("STAT02_RSV1")
   14406                      .dwattr $C$DW$1934, DW_AT_TI_symbol_name("_STAT02_RSV1")
   14407                      .dwattr $C$DW$1934, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14408                      .dwattr $C$DW$1934, DW_AT_accessibility(DW_ACCESS_public)
   14409              
   14410              $C$DW$1935      .dwtag  DW_TAG_member
   14411                      .dwattr $C$DW$1935, DW_AT_type(*$C$DW$T$40)
   14412                      .dwattr $C$DW$1935, DW_AT_name("FETLC_VDS")
   14413                      .dwattr $C$DW$1935, DW_AT_TI_symbol_name("_FETLC_VDS")
   14414                      .dwattr $C$DW$1935, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14415                      .dwattr $C$DW$1935, DW_AT_accessibility(DW_ACCESS_public)
   14416              
   14417              $C$DW$1936      .dwtag  DW_TAG_member
   14418                      .dwattr $C$DW$1936, DW_AT_type(*$C$DW$T$40)
   14419                      .dwattr $C$DW$1936, DW_AT_name("FETHC_VDS")
   14420                      .dwattr $C$DW$1936, DW_AT_TI_symbol_name("_FETHC_VDS")
   14421                      .dwattr $C$DW$1936, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14422                      .dwattr $C$DW$1936, DW_AT_accessibility(DW_ACCESS_public)
   14423              
   14424              $C$DW$1937      .dwtag  DW_TAG_member
   14425                      .dwattr $C$DW$1937, DW_AT_type(*$C$DW$T$40)
   14426                      .dwattr $C$DW$1937, DW_AT_name("FETLB_VDS")
   14427                      .dwattr $C$DW$1937, DW_AT_TI_symbol_name("_FETLB_VDS")
   14428                      .dwattr $C$DW$1937, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14429                      .dwattr $C$DW$1937, DW_AT_accessibility(DW_ACCESS_public)
   14430              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  272

   14431              $C$DW$1938      .dwtag  DW_TAG_member
   14432                      .dwattr $C$DW$1938, DW_AT_type(*$C$DW$T$40)
   14433                      .dwattr $C$DW$1938, DW_AT_name("FETHB_VDS")
   14434                      .dwattr $C$DW$1938, DW_AT_TI_symbol_name("_FETHB_VDS")
   14435                      .dwattr $C$DW$1938, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14436                      .dwattr $C$DW$1938, DW_AT_accessibility(DW_ACCESS_public)
   14437              
   14438              $C$DW$1939      .dwtag  DW_TAG_member
   14439                      .dwattr $C$DW$1939, DW_AT_type(*$C$DW$T$40)
   14440                      .dwattr $C$DW$1939, DW_AT_name("FETLA_VDS")
   14441                      .dwattr $C$DW$1939, DW_AT_TI_symbol_name("_FETLA_VDS")
   14442                      .dwattr $C$DW$1939, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   14443                      .dwattr $C$DW$1939, DW_AT_accessibility(DW_ACCESS_public)
   14444              
   14445              $C$DW$1940      .dwtag  DW_TAG_member
   14446                      .dwattr $C$DW$1940, DW_AT_type(*$C$DW$T$40)
   14447                      .dwattr $C$DW$1940, DW_AT_name("FETHA_VDS")
   14448                      .dwattr $C$DW$1940, DW_AT_TI_symbol_name("_FETHA_VDS")
   14449                      .dwattr $C$DW$1940, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14450                      .dwattr $C$DW$1940, DW_AT_accessibility(DW_ACCESS_public)
   14451              
   14452                      .dwendtag $C$DW$T$93
   14453              
   14454              $C$DW$T$97      .dwtag  DW_TAG_typedef
   14455                      .dwattr $C$DW$T$97, DW_AT_name("DRV_SPI_8305_Stat02_t_")
   14456                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$93)
   14457                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
   14458              
   14459              
   14460              $C$DW$T$94      .dwtag  DW_TAG_structure_type
   14461                      .dwattr $C$DW$T$94, DW_AT_name("_DRV_SPI_8305_Stat03_t_")
   14462                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x0b)
   14463              $C$DW$1941      .dwtag  DW_TAG_member
   14464                      .dwattr $C$DW$1941, DW_AT_type(*$C$DW$T$40)
   14465                      .dwattr $C$DW$1941, DW_AT_name("VCPH_OVLO_ABS")
   14466                      .dwattr $C$DW$1941, DW_AT_TI_symbol_name("_VCPH_OVLO_ABS")
   14467                      .dwattr $C$DW$1941, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14468                      .dwattr $C$DW$1941, DW_AT_accessibility(DW_ACCESS_public)
   14469              
   14470              $C$DW$1942      .dwtag  DW_TAG_member
   14471                      .dwattr $C$DW$1942, DW_AT_type(*$C$DW$T$40)
   14472                      .dwattr $C$DW$1942, DW_AT_name("VCPH_OVLO")
   14473                      .dwattr $C$DW$1942, DW_AT_TI_symbol_name("_VCPH_OVLO")
   14474                      .dwattr $C$DW$1942, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14475                      .dwattr $C$DW$1942, DW_AT_accessibility(DW_ACCESS_public)
   14476              
   14477              $C$DW$1943      .dwtag  DW_TAG_member
   14478                      .dwattr $C$DW$1943, DW_AT_type(*$C$DW$T$40)
   14479                      .dwattr $C$DW$1943, DW_AT_name("VCPH_UVLO2")
   14480                      .dwattr $C$DW$1943, DW_AT_TI_symbol_name("_VCPH_UVLO2")
   14481                      .dwattr $C$DW$1943, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14482                      .dwattr $C$DW$1943, DW_AT_accessibility(DW_ACCESS_public)
   14483              
   14484              $C$DW$1944      .dwtag  DW_TAG_member
   14485                      .dwattr $C$DW$1944, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  273

   14486                      .dwattr $C$DW$1944, DW_AT_name("STAT03_RSV2")
   14487                      .dwattr $C$DW$1944, DW_AT_TI_symbol_name("_STAT03_RSV2")
   14488                      .dwattr $C$DW$1944, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14489                      .dwattr $C$DW$1944, DW_AT_accessibility(DW_ACCESS_public)
   14490              
   14491              $C$DW$1945      .dwtag  DW_TAG_member
   14492                      .dwattr $C$DW$1945, DW_AT_type(*$C$DW$T$40)
   14493                      .dwattr $C$DW$1945, DW_AT_name("VCP_LSD_UVLO2")
   14494                      .dwattr $C$DW$1945, DW_AT_TI_symbol_name("_VCP_LSD_UVLO2")
   14495                      .dwattr $C$DW$1945, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14496                      .dwattr $C$DW$1945, DW_AT_accessibility(DW_ACCESS_public)
   14497              
   14498              $C$DW$1946      .dwtag  DW_TAG_member
   14499                      .dwattr $C$DW$1946, DW_AT_type(*$C$DW$T$40)
   14500                      .dwattr $C$DW$1946, DW_AT_name("AVDD_UVLO")
   14501                      .dwattr $C$DW$1946, DW_AT_TI_symbol_name("_AVDD_UVLO")
   14502                      .dwattr $C$DW$1946, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14503                      .dwattr $C$DW$1946, DW_AT_accessibility(DW_ACCESS_public)
   14504              
   14505              $C$DW$1947      .dwtag  DW_TAG_member
   14506                      .dwattr $C$DW$1947, DW_AT_type(*$C$DW$T$40)
   14507                      .dwattr $C$DW$1947, DW_AT_name("VREG_UV")
   14508                      .dwattr $C$DW$1947, DW_AT_TI_symbol_name("_VREG_UV")
   14509                      .dwattr $C$DW$1947, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14510                      .dwattr $C$DW$1947, DW_AT_accessibility(DW_ACCESS_public)
   14511              
   14512              $C$DW$1948      .dwtag  DW_TAG_member
   14513                      .dwattr $C$DW$1948, DW_AT_type(*$C$DW$T$40)
   14514                      .dwattr $C$DW$1948, DW_AT_name("STAT03_RSV1")
   14515                      .dwattr $C$DW$1948, DW_AT_TI_symbol_name("_STAT03_RSV1")
   14516                      .dwattr $C$DW$1948, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14517                      .dwattr $C$DW$1948, DW_AT_accessibility(DW_ACCESS_public)
   14518              
   14519              $C$DW$1949      .dwtag  DW_TAG_member
   14520                      .dwattr $C$DW$1949, DW_AT_type(*$C$DW$T$40)
   14521                      .dwattr $C$DW$1949, DW_AT_name("OTS")
   14522                      .dwattr $C$DW$1949, DW_AT_TI_symbol_name("_OTS")
   14523                      .dwattr $C$DW$1949, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14524                      .dwattr $C$DW$1949, DW_AT_accessibility(DW_ACCESS_public)
   14525              
   14526              $C$DW$1950      .dwtag  DW_TAG_member
   14527                      .dwattr $C$DW$1950, DW_AT_type(*$C$DW$T$40)
   14528                      .dwattr $C$DW$1950, DW_AT_name("WD_FAULT")
   14529                      .dwattr $C$DW$1950, DW_AT_TI_symbol_name("_WD_FAULT")
   14530                      .dwattr $C$DW$1950, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   14531                      .dwattr $C$DW$1950, DW_AT_accessibility(DW_ACCESS_public)
   14532              
   14533              $C$DW$1951      .dwtag  DW_TAG_member
   14534                      .dwattr $C$DW$1951, DW_AT_type(*$C$DW$T$40)
   14535                      .dwattr $C$DW$1951, DW_AT_name("PVDD_UVLO2")
   14536                      .dwattr $C$DW$1951, DW_AT_TI_symbol_name("_PVDD_UVLO2")
   14537                      .dwattr $C$DW$1951, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14538                      .dwattr $C$DW$1951, DW_AT_accessibility(DW_ACCESS_public)
   14539              
   14540                      .dwendtag $C$DW$T$94
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  274

   14541              
   14542              $C$DW$T$98      .dwtag  DW_TAG_typedef
   14543                      .dwattr $C$DW$T$98, DW_AT_name("DRV_SPI_8305_Stat03_t_")
   14544                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$94)
   14545                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
   14546              
   14547              
   14548              $C$DW$T$95      .dwtag  DW_TAG_structure_type
   14549                      .dwattr $C$DW$T$95, DW_AT_name("_DRV_SPI_8305_Stat04_t_")
   14550                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x0b)
   14551              $C$DW$1952      .dwtag  DW_TAG_member
   14552                      .dwattr $C$DW$1952, DW_AT_type(*$C$DW$T$40)
   14553                      .dwattr $C$DW$1952, DW_AT_name("STAT04_RSV5")
   14554                      .dwattr $C$DW$1952, DW_AT_TI_symbol_name("_STAT04_RSV5")
   14555                      .dwattr $C$DW$1952, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14556                      .dwattr $C$DW$1952, DW_AT_accessibility(DW_ACCESS_public)
   14557              
   14558              $C$DW$1953      .dwtag  DW_TAG_member
   14559                      .dwattr $C$DW$1953, DW_AT_type(*$C$DW$T$40)
   14560                      .dwattr $C$DW$1953, DW_AT_name("STAT04_RSV4")
   14561                      .dwattr $C$DW$1953, DW_AT_TI_symbol_name("_STAT04_RSV4")
   14562                      .dwattr $C$DW$1953, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14563                      .dwattr $C$DW$1953, DW_AT_accessibility(DW_ACCESS_public)
   14564              
   14565              $C$DW$1954      .dwtag  DW_TAG_member
   14566                      .dwattr $C$DW$1954, DW_AT_type(*$C$DW$T$40)
   14567                      .dwattr $C$DW$1954, DW_AT_name("STAT04_RSV3")
   14568                      .dwattr $C$DW$1954, DW_AT_TI_symbol_name("_STAT04_RSV3")
   14569                      .dwattr $C$DW$1954, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14570                      .dwattr $C$DW$1954, DW_AT_accessibility(DW_ACCESS_public)
   14571              
   14572              $C$DW$1955      .dwtag  DW_TAG_member
   14573                      .dwattr $C$DW$1955, DW_AT_type(*$C$DW$T$40)
   14574                      .dwattr $C$DW$1955, DW_AT_name("STAT04_RSV2")
   14575                      .dwattr $C$DW$1955, DW_AT_TI_symbol_name("_STAT04_RSV2")
   14576                      .dwattr $C$DW$1955, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14577                      .dwattr $C$DW$1955, DW_AT_accessibility(DW_ACCESS_public)
   14578              
   14579              $C$DW$1956      .dwtag  DW_TAG_member
   14580                      .dwattr $C$DW$1956, DW_AT_type(*$C$DW$T$40)
   14581                      .dwattr $C$DW$1956, DW_AT_name("STAT04_RSV1")
   14582                      .dwattr $C$DW$1956, DW_AT_TI_symbol_name("_STAT04_RSV1")
   14583                      .dwattr $C$DW$1956, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14584                      .dwattr $C$DW$1956, DW_AT_accessibility(DW_ACCESS_public)
   14585              
   14586              $C$DW$1957      .dwtag  DW_TAG_member
   14587                      .dwattr $C$DW$1957, DW_AT_type(*$C$DW$T$40)
   14588                      .dwattr $C$DW$1957, DW_AT_name("FETLC_VGS")
   14589                      .dwattr $C$DW$1957, DW_AT_TI_symbol_name("_FETLC_VGS")
   14590                      .dwattr $C$DW$1957, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14591                      .dwattr $C$DW$1957, DW_AT_accessibility(DW_ACCESS_public)
   14592              
   14593              $C$DW$1958      .dwtag  DW_TAG_member
   14594                      .dwattr $C$DW$1958, DW_AT_type(*$C$DW$T$40)
   14595                      .dwattr $C$DW$1958, DW_AT_name("FETHC_VGS")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  275

   14596                      .dwattr $C$DW$1958, DW_AT_TI_symbol_name("_FETHC_VGS")
   14597                      .dwattr $C$DW$1958, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14598                      .dwattr $C$DW$1958, DW_AT_accessibility(DW_ACCESS_public)
   14599              
   14600              $C$DW$1959      .dwtag  DW_TAG_member
   14601                      .dwattr $C$DW$1959, DW_AT_type(*$C$DW$T$40)
   14602                      .dwattr $C$DW$1959, DW_AT_name("FETLB_VGS")
   14603                      .dwattr $C$DW$1959, DW_AT_TI_symbol_name("_FETLB_VGS")
   14604                      .dwattr $C$DW$1959, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14605                      .dwattr $C$DW$1959, DW_AT_accessibility(DW_ACCESS_public)
   14606              
   14607              $C$DW$1960      .dwtag  DW_TAG_member
   14608                      .dwattr $C$DW$1960, DW_AT_type(*$C$DW$T$40)
   14609                      .dwattr $C$DW$1960, DW_AT_name("FETHB_VGS")
   14610                      .dwattr $C$DW$1960, DW_AT_TI_symbol_name("_FETHB_VGS")
   14611                      .dwattr $C$DW$1960, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14612                      .dwattr $C$DW$1960, DW_AT_accessibility(DW_ACCESS_public)
   14613              
   14614              $C$DW$1961      .dwtag  DW_TAG_member
   14615                      .dwattr $C$DW$1961, DW_AT_type(*$C$DW$T$40)
   14616                      .dwattr $C$DW$1961, DW_AT_name("FETLA_VGS")
   14617                      .dwattr $C$DW$1961, DW_AT_TI_symbol_name("_FETLA_VGS")
   14618                      .dwattr $C$DW$1961, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   14619                      .dwattr $C$DW$1961, DW_AT_accessibility(DW_ACCESS_public)
   14620              
   14621              $C$DW$1962      .dwtag  DW_TAG_member
   14622                      .dwattr $C$DW$1962, DW_AT_type(*$C$DW$T$40)
   14623                      .dwattr $C$DW$1962, DW_AT_name("FETHA_VGS")
   14624                      .dwattr $C$DW$1962, DW_AT_TI_symbol_name("_FETHA_VGS")
   14625                      .dwattr $C$DW$1962, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14626                      .dwattr $C$DW$1962, DW_AT_accessibility(DW_ACCESS_public)
   14627              
   14628                      .dwendtag $C$DW$T$95
   14629              
   14630              $C$DW$T$99      .dwtag  DW_TAG_typedef
   14631                      .dwattr $C$DW$T$99, DW_AT_name("DRV_SPI_8305_Stat04_t_")
   14632                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$95)
   14633                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
   14634              
   14635              
   14636              $C$DW$T$108     .dwtag  DW_TAG_structure_type
   14637                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8305_Vars_t_")
   14638                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x61)
   14639              $C$DW$1963      .dwtag  DW_TAG_member
   14640                      .dwattr $C$DW$1963, DW_AT_type(*$C$DW$T$96)
   14641                      .dwattr $C$DW$1963, DW_AT_name("Stat_Reg_01")
   14642                      .dwattr $C$DW$1963, DW_AT_TI_symbol_name("_Stat_Reg_01")
   14643                      .dwattr $C$DW$1963, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14644                      .dwattr $C$DW$1963, DW_AT_accessibility(DW_ACCESS_public)
   14645              
   14646              $C$DW$1964      .dwtag  DW_TAG_member
   14647                      .dwattr $C$DW$1964, DW_AT_type(*$C$DW$T$97)
   14648                      .dwattr $C$DW$1964, DW_AT_name("Stat_Reg_02")
   14649                      .dwattr $C$DW$1964, DW_AT_TI_symbol_name("_Stat_Reg_02")
   14650                      .dwattr $C$DW$1964, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  276

   14651                      .dwattr $C$DW$1964, DW_AT_accessibility(DW_ACCESS_public)
   14652              
   14653              $C$DW$1965      .dwtag  DW_TAG_member
   14654                      .dwattr $C$DW$1965, DW_AT_type(*$C$DW$T$98)
   14655                      .dwattr $C$DW$1965, DW_AT_name("Stat_Reg_03")
   14656                      .dwattr $C$DW$1965, DW_AT_TI_symbol_name("_Stat_Reg_03")
   14657                      .dwattr $C$DW$1965, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   14658                      .dwattr $C$DW$1965, DW_AT_accessibility(DW_ACCESS_public)
   14659              
   14660              $C$DW$1966      .dwtag  DW_TAG_member
   14661                      .dwattr $C$DW$1966, DW_AT_type(*$C$DW$T$99)
   14662                      .dwattr $C$DW$1966, DW_AT_name("Stat_Reg_04")
   14663                      .dwattr $C$DW$1966, DW_AT_TI_symbol_name("_Stat_Reg_04")
   14664                      .dwattr $C$DW$1966, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   14665                      .dwattr $C$DW$1966, DW_AT_accessibility(DW_ACCESS_public)
   14666              
   14667              $C$DW$1967      .dwtag  DW_TAG_member
   14668                      .dwattr $C$DW$1967, DW_AT_type(*$C$DW$T$100)
   14669                      .dwattr $C$DW$1967, DW_AT_name("Ctrl_Reg_05")
   14670                      .dwattr $C$DW$1967, DW_AT_TI_symbol_name("_Ctrl_Reg_05")
   14671                      .dwattr $C$DW$1967, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   14672                      .dwattr $C$DW$1967, DW_AT_accessibility(DW_ACCESS_public)
   14673              
   14674              $C$DW$1968      .dwtag  DW_TAG_member
   14675                      .dwattr $C$DW$1968, DW_AT_type(*$C$DW$T$101)
   14676                      .dwattr $C$DW$1968, DW_AT_name("Ctrl_Reg_06")
   14677                      .dwattr $C$DW$1968, DW_AT_TI_symbol_name("_Ctrl_Reg_06")
   14678                      .dwattr $C$DW$1968, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   14679                      .dwattr $C$DW$1968, DW_AT_accessibility(DW_ACCESS_public)
   14680              
   14681              $C$DW$1969      .dwtag  DW_TAG_member
   14682                      .dwattr $C$DW$1969, DW_AT_type(*$C$DW$T$102)
   14683                      .dwattr $C$DW$1969, DW_AT_name("Ctrl_Reg_07")
   14684                      .dwattr $C$DW$1969, DW_AT_TI_symbol_name("_Ctrl_Reg_07")
   14685                      .dwattr $C$DW$1969, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   14686                      .dwattr $C$DW$1969, DW_AT_accessibility(DW_ACCESS_public)
   14687              
   14688              $C$DW$1970      .dwtag  DW_TAG_member
   14689                      .dwattr $C$DW$1970, DW_AT_type(*$C$DW$T$103)
   14690                      .dwattr $C$DW$1970, DW_AT_name("Ctrl_Reg_08")
   14691                      .dwattr $C$DW$1970, DW_AT_TI_symbol_name("_Ctrl_Reg_08")
   14692                      .dwattr $C$DW$1970, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   14693                      .dwattr $C$DW$1970, DW_AT_accessibility(DW_ACCESS_public)
   14694              
   14695              $C$DW$1971      .dwtag  DW_TAG_member
   14696                      .dwattr $C$DW$1971, DW_AT_type(*$C$DW$T$104)
   14697                      .dwattr $C$DW$1971, DW_AT_name("Ctrl_Reg_09")
   14698                      .dwattr $C$DW$1971, DW_AT_TI_symbol_name("_Ctrl_Reg_09")
   14699                      .dwattr $C$DW$1971, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
   14700                      .dwattr $C$DW$1971, DW_AT_accessibility(DW_ACCESS_public)
   14701              
   14702              $C$DW$1972      .dwtag  DW_TAG_member
   14703                      .dwattr $C$DW$1972, DW_AT_type(*$C$DW$T$105)
   14704                      .dwattr $C$DW$1972, DW_AT_name("Ctrl_Reg_0A")
   14705                      .dwattr $C$DW$1972, DW_AT_TI_symbol_name("_Ctrl_Reg_0A")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{B1AA9D5F-D023-40CA-9F51-78BEEC10B83C} PAGE  277

   14706                      .dwattr $C$DW$1972, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
   14707                      .dwattr $C$DW$1972, DW_AT_accessibility(DW_ACCESS_public)
   14708              
   14709              $C$DW$1973      .dwtag  DW_TAG_member
   14710                      .dwattr $C$DW$1973, DW_AT_type(*$C$DW$T$106)
   14711                      .dwattr $C$DW$1973, DW_AT_name("Ctrl_Reg_0B")
   14712                      .dwattr $C$DW$1973, DW_AT_TI_symbol_name("_Ctrl_Reg_0B")
   14713                      .dwattr $C$DW$1973, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   14714                      .dwattr $C$DW$1973, DW_AT_accessibility(DW_ACCESS_public)
   14715              
   14716              $C$DW$1974      .dwtag  DW_TAG_member
   14717                      .dwattr $C$DW$1974, DW_AT_type(*$C$DW$T$107)
   14718                      .dwattr $C$DW$1974, DW_AT_name("Ctrl_Reg_0C")
   14719                      .dwattr $C$DW$1974, DW_AT_TI_symbol_name("_Ctrl_Reg_0C")
   14720                      .dwattr $C$DW$1974, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
   14721                      .dwattr $C$DW$1974, DW_AT_accessibility(DW_ACCESS_public)
   14722              
   14723              $C$DW$1975      .dwtag  DW_TAG_member
   14724                      .dwattr $C$DW$1975, DW_AT_type(*$C$DW$T$40)
   14725                      .dwattr $C$DW$1975, DW_AT_name("WriteCmd")
   14726                      .dwattr $C$DW$1975, DW_AT_TI_symbol_name("_WriteCmd")
   14727                      .dwattr $C$DW$1975, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
   14728                      .dwattr $C$DW$1975, DW_AT_accessibility(DW_ACCESS_public)
   14729              
   14730              $C$DW$1976      .dwtag  DW_TAG_member
   14731                      .dwattr $C$DW$1976, DW_AT_type(*$C$DW$T$40)
   14732                      .dwattr $C$DW$1976, DW_AT_name("ReadCmd")
   14733                      .dwattr $C$DW$1976, DW_AT_TI_symbol_name("_ReadCmd")
   14734                      .dwattr $C$DW$1976, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   14735                      .dwattr $C$DW$1976, DW_AT_accessibility(DW_ACCESS_public)
   14736              
   14737              $C$DW$1977      .dwtag  DW_TAG_member
   14738                      .dwattr $C$DW$1977, DW_AT_type(*$C$DW$T$21)
