TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E39FFD36-4446-47D0-A794-6BE46767ABB8} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Sun Jun 17 14:52:23 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/modules/offset/src/32b/offset.c
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("FILTER_FO_getNumCoeffs")

     509              ;*                                                             *
     510              ;* FUNCTION ENVIRONMENT                                        *
     511              ;*                                                             *
     512              ;* FUNCTION PROPERTIES                                         *
     513              ;*                            2 Parameter,  4 Auto,  0 SOE     *
     514              ;***************************************************************
     515              
     516              _OFFSET_getBeta:
     517              $C$DW$49        .dwtag  DW_TAG_variable
     518                      .dwattr $C$DW$49, DW_AT_name("b0")
     519                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_b0")
     520                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$21)
     521                      .dwattr $C$DW$49, DW_AT_location[DW_OP_breg20 -4]
     522              
     523              $C$DW$50        .dwtag  DW_TAG_variable
     524                      .dwattr $C$DW$50, DW_AT_name("b1")
     525                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_b1")
     526                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$21)
     527                      .dwattr $C$DW$50, DW_AT_location[DW_OP_breg20 -6]
     528              
     529              ;* AR4   assigned to _handle
     530              $C$DW$51        .dwtag  DW_TAG_variable
     531                      .dwattr $C$DW$51, DW_AT_name("handle")
     532                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_handle")
     533                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$37)
     534                      .dwattr $C$DW$51, DW_AT_location[DW_OP_reg12]
     535              
     536                      .dwcfi  cfa_offset, -2
     537                      .dwcfi  save_reg_to_mem, 26, 0
     538 00000038 FE06          ADDB      SP,#6                 ; [CPU_ARAU] 
     539                      .dwcfi  cfa_offset, -8
     540                      .dwpsn  file "D:/ti/motorware/motorware_1_01_00_18/sw/modules/offset/src/32b/offset.c",line 64,column
     541 00000039 5DAD          MOVZ      AR5,SP                ; [CPU_ALU] |64| 
     542 0000003a DD86          SUBB      XAR5,#6               ; [CPU_ARAU] |64| 
     543 0000003b 0EA5          MOVU      ACC,AR5               ; [CPU_ALU] |64| 
     544 0000003c 5DAD          MOVZ      AR5,SP                ; [CPU_ALU] |64| 
     545 0000003d D00E          MOVB      XAR0,#14              ; [CPU_ALU] |64| 
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E39FFD36-4446-47D0-A794-6BE46767ABB8} PAGE   11

     546 0000003e 1E42          MOVL      *-SP[2],ACC           ; [CPU_ALU] |64| 
     547 0000003f 8A94          MOVL      XAR4,*+XAR4[AR0]      ; [CPU_ALU] |64| 
     548 00000040 DD84          SUBB      XAR5,#4               ; [CPU_ARAU] |64| 
     549 00000041 5DA5          MOVZ      AR5,AR5               ; [CPU_ALU] |64| 
     550              $C$DW$52        .dwtag  DW_TAG_TI_branch
     551                      .dwattr $C$DW$52, DW_AT_low_pc(0x00)
     552                      .dwattr $C$DW$52, DW_AT_name("_FILTER_FO_getNumCoeffs")
     553                      .dwattr $C$DW$52, DW_AT_TI_call
     554              
     555 00000042 7640!         LCR       #_FILTER_FO_getNumCoeffs ; [CPU_ALU] |64| 
         00000043 0000 
     556                      ; call occurs [#_FILTER_FO_getNumCoeffs] ; [] |64| 
     557                      .dwpsn  file "D:/ti/motorware/motorware_1_01_00_18/sw/modules/offset/src/32b/offset.c",line 66,column
     558 00000044 0644          MOVL      ACC,*-SP[4]           ; [CPU_ALU] |66| 
     559 00000045 FE86          SUBB      SP,#6                 ; [CPU_ARAU] 
     560                      .dwcfi  cfa_offset, -2
     561              $C$DW$53        .dwtag  DW_TAG_TI_branch
     562                      .dwattr $C$DW$53, DW_AT_low_pc(0x00)
     563                      .dwattr $C$DW$53, DW_AT_TI_return
     564              
     565 00000046 0006          LRETR     ; [CPU_ALU] 
     566                      ; return occurs ; [] 
     567                      .dwattr $C$DW$47, DW_AT_TI_end_file("D:/ti/motorware/motorware_1_01_00_18/sw/modules/offset/src/32b/o
     568                      .dwattr $C$DW$47, DW_AT_TI_end_line(0x43)
     569                      .dwattr $C$DW$47, DW_AT_TI_end_column(0x01)
     570                      .dwendentry
     571                      .dwendtag $C$DW$47
     572              
     573              ;**************************************************************
     574              ;* UNDEFINED EXTERNAL REFERENCES                              *
     575              ;**************************************************************
     576                      .global _FILTER_FO_getNumCoeffs
     577                      .global _FILTER_FO_setNumCoeffs
     578                      .global _FILTER_FO_setDenCoeffs
     579                      .global _FILTER_FO_setInitialConditions
     580                      .global _FILTER_FO_init
     581              
     582              ;***************************************************************
     583              ;* TYPE INFORMATION                                            *
     584              ;***************************************************************
     585              
     586              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     587                      .dwattr $C$DW$T$22, DW_AT_name("_FILTER_FO_")
     588                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0a)
     589              $C$DW$54        .dwtag  DW_TAG_member
     590                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$21)
     591                      .dwattr $C$DW$54, DW_AT_name("a1")
     592                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_a1")
     593                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     594                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     595              
     596              $C$DW$55        .dwtag  DW_TAG_member
     597                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$21)
     598                      .dwattr $C$DW$55, DW_AT_name("b0")
     599                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_b0")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E39FFD36-4446-47D0-A794-6BE46767ABB8} PAGE   12

     600                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     601                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     602              
     603              $C$DW$56        .dwtag  DW_TAG_member
     604                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$21)
     605                      .dwattr $C$DW$56, DW_AT_name("b1")
     606                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_b1")
     607                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     608                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     609              
     610              $C$DW$57        .dwtag  DW_TAG_member
     611                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
     612                      .dwattr $C$DW$57, DW_AT_name("x1")
     613                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_x1")
     614                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     615                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     616              
     617              $C$DW$58        .dwtag  DW_TAG_member
     618                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$21)
     619                      .dwattr $C$DW$58, DW_AT_name("y1")
     620                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_y1")
     621                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     622                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     623              
     624                      .dwendtag $C$DW$T$22
     625              
     626              $C$DW$T$23      .dwtag  DW_TAG_typedef
     627                      .dwattr $C$DW$T$23, DW_AT_name("FILTER_FO_Obj")
     628                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     629                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     630              
     631              
     632              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     633                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
     634                      .dwattr $C$DW$T$19, DW_AT_declaration
     635                      .dwendtag $C$DW$T$19
     636              
     637              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
     638                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$19)
     639                      .dwattr $C$DW$T$24, DW_AT_address_class(0x20)
     640              
     641              $C$DW$T$25      .dwtag  DW_TAG_typedef
     642                      .dwattr $C$DW$T$25, DW_AT_name("FILTER_FO_Handle")
     643                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     644                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     645              
     646              
     647              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     648                      .dwattr $C$DW$T$26, DW_AT_name("_OFFSET_")
     649                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
     650              $C$DW$59        .dwtag  DW_TAG_member
     651                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
     652                      .dwattr $C$DW$59, DW_AT_name("value")
     653                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_value")
     654                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E39FFD36-4446-47D0-A794-6BE46767ABB8} PAGE   13

     655                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     656              
     657              $C$DW$60        .dwtag  DW_TAG_member
     658                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$21)
     659                      .dwattr $C$DW$60, DW_AT_name("bias")
     660                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_bias")
     661                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     662                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     663              
     664              $C$DW$61        .dwtag  DW_TAG_member
     665                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$23)
     666                      .dwattr $C$DW$61, DW_AT_name("filter")
     667                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_filter")
     668                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     669                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     670              
     671              $C$DW$62        .dwtag  DW_TAG_member
     672                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$25)
     673                      .dwattr $C$DW$62, DW_AT_name("filterHandle")
     674                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_filterHandle")
     675                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     676                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     677              
     678                      .dwendtag $C$DW$T$26
     679              
     680              $C$DW$T$33      .dwtag  DW_TAG_typedef
     681                      .dwattr $C$DW$T$33, DW_AT_name("OFFSET_Obj")
     682                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$26)
     683                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
     684              
     685              
     686              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     687                      .dwattr $C$DW$T$20, DW_AT_name("_OFFSET_Obj_")
     688                      .dwattr $C$DW$T$20, DW_AT_declaration
     689                      .dwendtag $C$DW$T$20
     690              
     691              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
     692                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$20)
     693                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
     694              
     695              $C$DW$T$36      .dwtag  DW_TAG_typedef
     696                      .dwattr $C$DW$T$36, DW_AT_name("OFFSET_Handle")
     697                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
     698                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
     699              
     700              $C$DW$63        .dwtag  DW_TAG_TI_far_type
     701                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$36)
     702              
     703              $C$DW$T$37      .dwtag  DW_TAG_const_type
     704                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$63)
     705              
     706              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     707                      .dwattr $C$DW$T$2, DW_AT_name("void")
     708              
     709              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E39FFD36-4446-47D0-A794-6BE46767ABB8} PAGE   14

     710                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     711                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     712              
     713              $C$DW$64        .dwtag  DW_TAG_TI_far_type
     714                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$3)
     715              
     716              $C$DW$T$41      .dwtag  DW_TAG_const_type
     717                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$64)
     718              
     719              $C$DW$T$4       .dwtag  DW_TAG_base_type
     720                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     721                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     722                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     723              
     724              $C$DW$T$5       .dwtag  DW_TAG_base_type
     725                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     726                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     727                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     728              
     729              $C$DW$T$6       .dwtag  DW_TAG_base_type
     730                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     731                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     732                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     733              
     734              $C$DW$T$7       .dwtag  DW_TAG_base_type
     735                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     736                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     737                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     738              
     739              $C$DW$T$8       .dwtag  DW_TAG_base_type
