TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{88D882AD-0C90-474B-896E-9344DE59ED54} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Sun Jun 17 14:52:26 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/modules/pid/src/32b/pid.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("PID_setRefValue")

      88              ;***************************************************************
      89              ;* FNAME: _PID_init                     FR SIZE:   0           *
      90              ;*                                                             *
      91              ;* FUNCTION ENVIRONMENT                                        *
      92              ;*                                                             *
      93              ;* FUNCTION PROPERTIES                                         *
      94              ;*                            0 Parameter,  0 Auto,  0 SOE     *
      95              ;***************************************************************
      96              
      97              _PID_init:
      98              ;* AR4   assigned to _pMemory
      99              $C$DW$13        .dwtag  DW_TAG_variable
     100                      .dwattr $C$DW$13, DW_AT_name("pMemory")
     101                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_pMemory")
     102                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$28)
     103                      .dwattr $C$DW$13, DW_AT_location[DW_OP_reg12]
     104              
     105              ;* AR6   assigned to _numBytes
     106              $C$DW$14        .dwtag  DW_TAG_variable
     107                      .dwattr $C$DW$14, DW_AT_name("numBytes")
     108                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_numBytes")
     109                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$25)
     110                      .dwattr $C$DW$14, DW_AT_location[DW_OP_reg16]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{88D882AD-0C90-474B-896E-9344DE59ED54} PAGE    3

     111              
     112                      .dwcfi  cfa_offset, -2
     113                      .dwcfi  save_reg_to_mem, 26, 0
     114 00000000 1EA6          MOVL      XAR6,ACC              ; [CPU_ALU] |57| 
     115                      .dwpsn  file "D:/ti/motorware/motorware_1_01_00_18/sw/modules/pid/src/32b/pid.c",line 61,column 3,is_
     116 00000001 0210          MOVB      ACC,#16               ; [CPU_ALU] |61| 
     117 00000002 0FA6          CMPL      ACC,XAR6              ; [CPU_ALU] |61| 
     118 00000003 6903          B         $C$L1,LOS             ; [CPU_ALU] |61| 
     119                      ; branchcc occurs ; [] |61| 
     120                      .dwcfi  remember_state
     121                      .dwpsn  file "D:/ti/motorware/motorware_1_01_00_18/sw/modules/pid/src/32b/pid.c",line 62,column 5,is_
     122 00000004 D400          MOVB      XAR4,#0               ; [CPU_ALU] |62| 
     123              $C$DW$15        .dwtag  DW_TAG_TI_branch
     124                      .dwattr $C$DW$15, DW_AT_low_pc(0x00)
     125                      .dwattr $C$DW$15, DW_AT_TI_return
     126              
     127 00000005 0006          LRETR     ; [CPU_ALU] 
     128                      ; return occurs ; [] 
     129                      .dwcfi  restore_state
     130 00000006       $C$L1:    
     131                      .dwpsn  file "D:/ti/motorware/motorware_1_01_00_18/sw/modules/pid/src/32b/pid.h",line 413,column 3,is
     132 00000006 0200          MOVB      ACC,#0                ; [CPU_ALU] |413| 
     133                      .dwpsn  file "D:/ti/motorware/motorware_1_01_00_18/sw/modules/pid/src/32b/pid.h",line 400,column 3,is
     134 00000007 D008          MOVB      XAR0,#8               ; [CPU_ALU] |400| 
     135                      .dwpsn  file "D:/ti/motorware/motorware_1_01_00_18/sw/modules/pid/src/32b/pid.h",line 413,column 3,is
     136 00000008 1EF4          MOVL      *+XAR4[6],ACC         ; [CPU_ALU] |413| 
     137                      .dwpsn  file "D:/ti/motorware/motorware_1_01_00_18/sw/modules/pid/src/32b/pid.h",line 400,column 3,is
     138 00000009 1E94          MOVL      *+XAR4[AR0],ACC       ; [CPU_ALU] |400| 
     139                      .dwpsn  file "D:/ti/motorware/motorware_1_01_00_18/sw/modules/pid/src/32b/pid.h",line 290,column 3,is
     140 0000000a D00A          MOVB      XAR0,#10              ; [CPU_ALU] |290| 
     141 0000000b 1E94          MOVL      *+XAR4[AR0],ACC       ; [CPU_ALU] |290| 
     142              $C$DW$16        .dwtag  DW_TAG_TI_branch
     143                      .dwattr $C$DW$16, DW_AT_low_pc(0x00)
     144                      .dwattr $C$DW$16, DW_AT_TI_return
     145              
     146 0000000c 0006          LRETR     ; [CPU_ALU] 
     147                      ; return occurs ; [] 
     148                      .dwattr $C$DW$10, DW_AT_TI_end_file("D:/ti/motorware/motorware_1_01_00_18/sw/modules/pid/src/32b/pid.
     149                      .dwattr $C$DW$10, DW_AT_TI_end_line(0x49)
     150                      .dwattr $C$DW$10, DW_AT_TI_end_column(0x01)
     151                      .dwendentry
     152                      .dwendtag $C$DW$10
     153              
     154              
     155              ;***************************************************************
     156              ;* TYPE INFORMATION                                            *
     157              ;***************************************************************
     158              
     159              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     160                      .dwattr $C$DW$T$20, DW_AT_name("_PID_Obj_")
     161                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x10)
     162              $C$DW$17        .dwtag  DW_TAG_member
     163                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     164                      .dwattr $C$DW$17, DW_AT_name("Kp")
     165                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_Kp")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{88D882AD-0C90-474B-896E-9344DE59ED54} PAGE    4

     166                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     167                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     168              
     169              $C$DW$18        .dwtag  DW_TAG_member
     170                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     171                      .dwattr $C$DW$18, DW_AT_name("Ki")
     172                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_Ki")
     173                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     174                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     175              
     176              $C$DW$19        .dwtag  DW_TAG_member
     177                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     178                      .dwattr $C$DW$19, DW_AT_name("Kd")
     179                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_Kd")
     180                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     181                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     182              
     183              $C$DW$20        .dwtag  DW_TAG_member
     184                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     185                      .dwattr $C$DW$20, DW_AT_name("Ui")
     186                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_Ui")
     187                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     188                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     189              
     190              $C$DW$21        .dwtag  DW_TAG_member
     191                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     192                      .dwattr $C$DW$21, DW_AT_name("refValue")
     193                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_refValue")
     194                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     195                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     196              
     197              $C$DW$22        .dwtag  DW_TAG_member
     198                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     199                      .dwattr $C$DW$22, DW_AT_name("fbackValue")
     200                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_fbackValue")
     201                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     202                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     203              
     204              $C$DW$23        .dwtag  DW_TAG_member
     205                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     206                      .dwattr $C$DW$23, DW_AT_name("outMin")
     207                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_outMin")
     208                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     209                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     210              
     211              $C$DW$24        .dwtag  DW_TAG_member
     212                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     213                      .dwattr $C$DW$24, DW_AT_name("outMax")
     214                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_outMax")
     215                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     216                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     217              
     218                      .dwendtag $C$DW$T$20
     219              
     220              $C$DW$T$21      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{88D882AD-0C90-474B-896E-9344DE59ED54} PAGE    5

     221                      .dwattr $C$DW$T$21, DW_AT_name("PID_Obj")
     222                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
     223                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     224              
     225              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     226                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
     227                      .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
     228              
     229              $C$DW$T$23      .dwtag  DW_TAG_typedef
     230                      .dwattr $C$DW$T$23, DW_AT_name("PID_Handle")
     231                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     232                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     233              
     234              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     235                      .dwattr $C$DW$T$2, DW_AT_name("void")
     236              
     237              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     238                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     239                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     240              
     241              $C$DW$25        .dwtag  DW_TAG_TI_far_type
     242                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$3)
     243              
     244              $C$DW$T$28      .dwtag  DW_TAG_const_type
     245                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$25)
     246              
     247              $C$DW$T$4       .dwtag  DW_TAG_base_type
     248                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     249                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     250                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     251              
     252              $C$DW$T$5       .dwtag  DW_TAG_base_type
     253                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     254                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     255                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     256              
     257              $C$DW$T$6       .dwtag  DW_TAG_base_type
     258                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     259                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     260                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     261              
     262              $C$DW$T$7       .dwtag  DW_TAG_base_type
     263                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     264                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     265                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     266              
     267              $C$DW$T$8       .dwtag  DW_TAG_base_type
     268                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     269                      .dwattr $C$DW$T$8, DW_AT_name("short")
     270                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     271              
     272              $C$DW$T$9       .dwtag  DW_TAG_base_type
     273                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     274                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     275                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
