TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Sun Jun 17 14:52:28 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/drivers/pie/src/32b/f28x/f2802x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;       D:\ti\ccsv8\tools\compiler\ti-cgt-c2000_18.1.2.LTS\bin\opt2000.exe C:\\Users\\haowp\\AppData\\Local\\

    2493                      .dwattr $C$DW$245, DW_AT_name("PIE_SystemInterrupts_ILLEGAL")
    2494                      .dwattr $C$DW$245, DW_AT_const_value(0x13)
    2495              
    2496              $C$DW$246       .dwtag  DW_TAG_enumerator
    2497                      .dwattr $C$DW$246, DW_AT_name("PIE_SystemInterrupts_USER1")
    2498                      .dwattr $C$DW$246, DW_AT_const_value(0x14)
    2499              
    2500              $C$DW$247       .dwtag  DW_TAG_enumerator
    2501                      .dwattr $C$DW$247, DW_AT_name("PIE_SystemInterrupts_USER2")
    2502                      .dwattr $C$DW$247, DW_AT_const_value(0x15)
    2503              
    2504              $C$DW$248       .dwtag  DW_TAG_enumerator
    2505                      .dwattr $C$DW$248, DW_AT_name("PIE_SystemInterrupts_USER3")
    2506                      .dwattr $C$DW$248, DW_AT_const_value(0x16)
    2507              
    2508              $C$DW$249       .dwtag  DW_TAG_enumerator
    2509                      .dwattr $C$DW$249, DW_AT_name("PIE_SystemInterrupts_USER4")
    2510                      .dwattr $C$DW$249, DW_AT_const_value(0x17)
    2511              
    2512              $C$DW$250       .dwtag  DW_TAG_enumerator
    2513                      .dwattr $C$DW$250, DW_AT_name("PIE_SystemInterrupts_USER5")
    2514                      .dwattr $C$DW$250, DW_AT_const_value(0x18)
    2515              
    2516              $C$DW$251       .dwtag  DW_TAG_enumerator
    2517                      .dwattr $C$DW$251, DW_AT_name("PIE_SystemInterrupts_USER6")
    2518                      .dwattr $C$DW$251, DW_AT_const_value(0x19)
    2519              
    2520              $C$DW$252       .dwtag  DW_TAG_enumerator
    2521                      .dwattr $C$DW$252, DW_AT_name("PIE_SystemInterrupts_USER7")
    2522                      .dwattr $C$DW$252, DW_AT_const_value(0x1a)
    2523              
    2524              $C$DW$253       .dwtag  DW_TAG_enumerator
    2525                      .dwattr $C$DW$253, DW_AT_name("PIE_SystemInterrupts_USER8")
    2526                      .dwattr $C$DW$253, DW_AT_const_value(0x1b)
    2527              
    2528              $C$DW$254       .dwtag  DW_TAG_enumerator
    2529                      .dwattr $C$DW$254, DW_AT_name("PIE_SystemInterrupts_USER9")
    2530                      .dwattr $C$DW$254, DW_AT_const_value(0x1c)
    2531              
    2532              $C$DW$255       .dwtag  DW_TAG_enumerator
    2533                      .dwattr $C$DW$255, DW_AT_name("PIE_SystemInterrupts_USER10")
    2534                      .dwattr $C$DW$255, DW_AT_const_value(0x1d)
    2535              
    2536              $C$DW$256       .dwtag  DW_TAG_enumerator
    2537                      .dwattr $C$DW$256, DW_AT_name("PIE_SystemInterrupts_USER11")
    2538                      .dwattr $C$DW$256, DW_AT_const_value(0x1e)
    2539              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   48

    2540              $C$DW$257       .dwtag  DW_TAG_enumerator
    2541                      .dwattr $C$DW$257, DW_AT_name("PIE_SystemInterrupts_USER12")
    2542                      .dwattr $C$DW$257, DW_AT_const_value(0x1f)
    2543              
    2544                      .dwendtag $C$DW$T$52
    2545              
    2546              $C$DW$T$53      .dwtag  DW_TAG_typedef
    2547                      .dwattr $C$DW$T$53, DW_AT_name("PIE_SystemInterrupts_e")
    2548                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2549                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2550              
    2551              
    2552              $C$DW$T$55      .dwtag  DW_TAG_enumeration_type
    2553                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    2554              $C$DW$258       .dwtag  DW_TAG_enumerator
    2555                      .dwattr $C$DW$258, DW_AT_name("PIE_ExtIntPolarity_FallingEdge")
    2556                      .dwattr $C$DW$258, DW_AT_const_value(0x00)
    2557              
    2558              $C$DW$259       .dwtag  DW_TAG_enumerator
    2559                      .dwattr $C$DW$259, DW_AT_name("PIE_ExtIntPolarity_RisingEdge")
    2560                      .dwattr $C$DW$259, DW_AT_const_value(0x04)
    2561              
    2562              $C$DW$260       .dwtag  DW_TAG_enumerator
    2563                      .dwattr $C$DW$260, DW_AT_name("PIE_ExtIntPolarity_RisingAndFallingEdge")
    2564                      .dwattr $C$DW$260, DW_AT_const_value(0x0c)
    2565              
    2566                      .dwendtag $C$DW$T$55
    2567              
    2568              $C$DW$T$56      .dwtag  DW_TAG_typedef
    2569                      .dwattr $C$DW$T$56, DW_AT_name("PIE_ExtIntPolarity_e")
    2570                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2571                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2572              
    2573              $C$DW$261       .dwtag  DW_TAG_TI_far_type
    2574                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$56)
    2575              
    2576              $C$DW$T$57      .dwtag  DW_TAG_const_type
    2577                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$261)
    2578              
    2579              
    2580              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2581                      .dwattr $C$DW$T$21, DW_AT_name("_PIE_IERIFR_t")
    2582                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x02)
    2583              $C$DW$262       .dwtag  DW_TAG_member
    2584                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    2585                      .dwattr $C$DW$262, DW_AT_name("IER")
    2586                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_IER")
    2587                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2588                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2589              
    2590              $C$DW$263       .dwtag  DW_TAG_member
    2591                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
    2592                      .dwattr $C$DW$263, DW_AT_name("IFR")
    2593                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_IFR")
    2594                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   49

    2595                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2596              
    2597                      .dwendtag $C$DW$T$21
    2598              
    2599              $C$DW$T$22      .dwtag  DW_TAG_typedef
    2600                      .dwattr $C$DW$T$22, DW_AT_name("PIE_IERIFR_t")
    2601                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    2602                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    2603              
    2604              $C$DW$264       .dwtag  DW_TAG_TI_far_type
    2605                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$22)
    2606              
    2607              $C$DW$T$23      .dwtag  DW_TAG_volatile_type
    2608                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$264)
    2609              
    2610              
    2611              $C$DW$T$24      .dwtag  DW_TAG_array_type
    2612                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    2613                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    2614                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x18)
    2615              $C$DW$265       .dwtag  DW_TAG_subrange_type
    2616                      .dwattr $C$DW$265, DW_AT_upper_bound(0x0b)
    2617              
    2618                      .dwendtag $C$DW$T$24
    2619              
    2620              
    2621              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2622                      .dwattr $C$DW$T$33, DW_AT_name("_PIE_Obj_")
    2623                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x639c)
    2624              $C$DW$266       .dwtag  DW_TAG_member
    2625                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    2626                      .dwattr $C$DW$266, DW_AT_name("PIECTRL")
    2627                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_PIECTRL")
    2628                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2629                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2630              
    2631              $C$DW$267       .dwtag  DW_TAG_member
    2632                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    2633                      .dwattr $C$DW$267, DW_AT_name("PIEACK")
    2634                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_PIEACK")
    2635                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2636                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2637              
    2638              $C$DW$268       .dwtag  DW_TAG_member
    2639                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$24)
    2640                      .dwattr $C$DW$268, DW_AT_name("PIEIER_PIEIFR")
    2641                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
    2642                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2643                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2644              
    2645              $C$DW$269       .dwtag  DW_TAG_member
    2646                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$25)
    2647                      .dwattr $C$DW$269, DW_AT_name("rsvd_1")
    2648                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_rsvd_1")
    2649                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   50

    2650                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2651              
    2652              $C$DW$270       .dwtag  DW_TAG_member
    2653                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$29)
    2654                      .dwattr $C$DW$270, DW_AT_name("Reset")
    2655                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_Reset")
    2656                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2657                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2658              
    2659              $C$DW$271       .dwtag  DW_TAG_member
    2660                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$29)
    2661                      .dwattr $C$DW$271, DW_AT_name("INT1")
    2662                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_INT1")
    2663                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2664                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2665              
    2666              $C$DW$272       .dwtag  DW_TAG_member
    2667                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$29)
    2668                      .dwattr $C$DW$272, DW_AT_name("INT2")
    2669                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_INT2")
    2670                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2671                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2672              
    2673              $C$DW$273       .dwtag  DW_TAG_member
    2674                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$29)
    2675                      .dwattr $C$DW$273, DW_AT_name("INT3")
    2676                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_INT3")
    2677                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2678                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2679              
    2680              $C$DW$274       .dwtag  DW_TAG_member
    2681                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$29)
    2682                      .dwattr $C$DW$274, DW_AT_name("INT4")
    2683                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_INT4")
    2684                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2685                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2686              
    2687              $C$DW$275       .dwtag  DW_TAG_member
    2688                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$29)
    2689                      .dwattr $C$DW$275, DW_AT_name("INT5")
    2690                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_INT5")
    2691                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2692                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2693              
    2694              $C$DW$276       .dwtag  DW_TAG_member
    2695                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$29)
    2696                      .dwattr $C$DW$276, DW_AT_name("INT6")
    2697                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_INT6")
    2698                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2699                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2700              
    2701              $C$DW$277       .dwtag  DW_TAG_member
    2702                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$29)
    2703                      .dwattr $C$DW$277, DW_AT_name("INT7")
    2704                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_INT7")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   51

    2705                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2706                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2707              
    2708              $C$DW$278       .dwtag  DW_TAG_member
    2709                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$29)
    2710                      .dwattr $C$DW$278, DW_AT_name("INT8")
    2711                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_INT8")
    2712                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2713                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2714              
    2715              $C$DW$279       .dwtag  DW_TAG_member
    2716                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$29)
    2717                      .dwattr $C$DW$279, DW_AT_name("INT9")
    2718                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_INT9")
    2719                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2720                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2721              
    2722              $C$DW$280       .dwtag  DW_TAG_member
    2723                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$29)
    2724                      .dwattr $C$DW$280, DW_AT_name("INT10")
    2725                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_INT10")
    2726                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2727                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2728              
    2729              $C$DW$281       .dwtag  DW_TAG_member
    2730                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$29)
    2731                      .dwattr $C$DW$281, DW_AT_name("INT11")
    2732                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_INT11")
    2733                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2734                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2735              
    2736              $C$DW$282       .dwtag  DW_TAG_member
    2737                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$29)
    2738                      .dwattr $C$DW$282, DW_AT_name("INT12")
    2739                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_INT12")
    2740                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2741                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2742              
    2743              $C$DW$283       .dwtag  DW_TAG_member
    2744                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$29)
    2745                      .dwattr $C$DW$283, DW_AT_name("TINT1")
    2746                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_TINT1")
    2747                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2748                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2749              
    2750              $C$DW$284       .dwtag  DW_TAG_member
    2751                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$29)
    2752                      .dwattr $C$DW$284, DW_AT_name("TINT2")
    2753                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_TINT2")
    2754                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2755                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2756              
    2757              $C$DW$285       .dwtag  DW_TAG_member
    2758                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$29)
    2759                      .dwattr $C$DW$285, DW_AT_name("DATALOG")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   52

    2760                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_DATALOG")
    2761                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2762                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2763              
    2764              $C$DW$286       .dwtag  DW_TAG_member
    2765                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$29)
    2766                      .dwattr $C$DW$286, DW_AT_name("RTOSINT")
    2767                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_RTOSINT")
    2768                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2769                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2770              
    2771              $C$DW$287       .dwtag  DW_TAG_member
    2772                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$29)
    2773                      .dwattr $C$DW$287, DW_AT_name("EMUINT")
    2774                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_EMUINT")
    2775                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2776                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2777              
    2778              $C$DW$288       .dwtag  DW_TAG_member
    2779                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$29)
    2780                      .dwattr $C$DW$288, DW_AT_name("NMI")
    2781                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_NMI")
    2782                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2783                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2784              
    2785              $C$DW$289       .dwtag  DW_TAG_member
    2786                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$29)
    2787                      .dwattr $C$DW$289, DW_AT_name("ILLEGAL")
    2788                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_ILLEGAL")
    2789                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2790                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2791              
    2792              $C$DW$290       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$29)
    2794                      .dwattr $C$DW$290, DW_AT_name("USER1")
    2795                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_USER1")
    2796                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2797                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2798              
    2799              $C$DW$291       .dwtag  DW_TAG_member
    2800                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$29)
    2801                      .dwattr $C$DW$291, DW_AT_name("USER2")
    2802                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_USER2")
    2803                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2804                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2805              
    2806              $C$DW$292       .dwtag  DW_TAG_member
    2807                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$29)
    2808                      .dwattr $C$DW$292, DW_AT_name("USER3")
    2809                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_USER3")
    2810                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2811                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2812              
    2813              $C$DW$293       .dwtag  DW_TAG_member
    2814                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   53

    2815                      .dwattr $C$DW$293, DW_AT_name("USER4")
    2816                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_USER4")
    2817                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2818                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2819              
    2820              $C$DW$294       .dwtag  DW_TAG_member
    2821                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$29)
    2822                      .dwattr $C$DW$294, DW_AT_name("USER5")
    2823                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_USER5")
    2824                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2825                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2826              
    2827              $C$DW$295       .dwtag  DW_TAG_member
    2828                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$29)
    2829                      .dwattr $C$DW$295, DW_AT_name("USER6")
    2830                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_USER6")
    2831                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2832                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2833              
    2834              $C$DW$296       .dwtag  DW_TAG_member
    2835                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$29)
    2836                      .dwattr $C$DW$296, DW_AT_name("USER7")
    2837                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_USER7")
    2838                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2839                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2840              
    2841              $C$DW$297       .dwtag  DW_TAG_member
    2842                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$29)
    2843                      .dwattr $C$DW$297, DW_AT_name("USER8")
    2844                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_USER8")
    2845                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2846                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2847              
    2848              $C$DW$298       .dwtag  DW_TAG_member
    2849                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$29)
    2850                      .dwattr $C$DW$298, DW_AT_name("USER9")
    2851                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_USER9")
    2852                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2853                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2854              
    2855              $C$DW$299       .dwtag  DW_TAG_member
    2856                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$29)
    2857                      .dwattr $C$DW$299, DW_AT_name("USER10")
    2858                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_USER10")
    2859                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2860                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2861              
    2862              $C$DW$300       .dwtag  DW_TAG_member
    2863                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$29)
    2864                      .dwattr $C$DW$300, DW_AT_name("USER11")
    2865                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_USER11")
    2866                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2867                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2868              
    2869              $C$DW$301       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   54

    2870                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$29)
    2871                      .dwattr $C$DW$301, DW_AT_name("USER12")
    2872                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_USER12")
    2873                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2874                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2875              
    2876              $C$DW$302       .dwtag  DW_TAG_member
    2877                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$29)
    2878                      .dwattr $C$DW$302, DW_AT_name("ADCINT1_HP")
    2879                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_ADCINT1_HP")
    2880                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2881                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2882              
    2883              $C$DW$303       .dwtag  DW_TAG_member
    2884                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$29)
    2885                      .dwattr $C$DW$303, DW_AT_name("ADCINT2_HP")
    2886                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_ADCINT2_HP")
    2887                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2888                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2889              
    2890              $C$DW$304       .dwtag  DW_TAG_member
    2891                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$29)
    2892                      .dwattr $C$DW$304, DW_AT_name("rsvd1_3")
    2893                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_rsvd1_3")
    2894                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2895                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2896              
    2897              $C$DW$305       .dwtag  DW_TAG_member
    2898                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$29)
    2899                      .dwattr $C$DW$305, DW_AT_name("XINT1")
    2900                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_XINT1")
    2901                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    2902                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2903              
    2904              $C$DW$306       .dwtag  DW_TAG_member
    2905                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$29)
    2906                      .dwattr $C$DW$306, DW_AT_name("XINT2")
    2907                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_XINT2")
    2908                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2909                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2910              
    2911              $C$DW$307       .dwtag  DW_TAG_member
    2912                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$29)
    2913                      .dwattr $C$DW$307, DW_AT_name("ADCINT9")
    2914                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_ADCINT9")
    2915                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    2916                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2917              
    2918              $C$DW$308       .dwtag  DW_TAG_member
    2919                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$29)
    2920                      .dwattr $C$DW$308, DW_AT_name("TINT0")
    2921                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_TINT0")
    2922                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2923                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2924              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   55

    2925              $C$DW$309       .dwtag  DW_TAG_member
    2926                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$29)
    2927                      .dwattr $C$DW$309, DW_AT_name("WAKEINT")
    2928                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_WAKEINT")
    2929                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2930                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2931              
    2932              $C$DW$310       .dwtag  DW_TAG_member
    2933                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$29)
    2934                      .dwattr $C$DW$310, DW_AT_name("EPWM1_TZINT")
    2935                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_EPWM1_TZINT")
    2936                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2937                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2938              
    2939              $C$DW$311       .dwtag  DW_TAG_member
    2940                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$29)
    2941                      .dwattr $C$DW$311, DW_AT_name("EPWM2_TZINT")
    2942                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_EPWM2_TZINT")
    2943                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    2944                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2945              
    2946              $C$DW$312       .dwtag  DW_TAG_member
    2947                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$29)
    2948                      .dwattr $C$DW$312, DW_AT_name("EPWM3_TZINT")
    2949                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_EPWM3_TZINT")
    2950                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2951                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2952              
    2953              $C$DW$313       .dwtag  DW_TAG_member
    2954                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$29)
    2955                      .dwattr $C$DW$313, DW_AT_name("EPWM4_TZINT")
    2956                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_EPWM4_TZINT")
    2957                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2958                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2959              
    2960              $C$DW$314       .dwtag  DW_TAG_member
    2961                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$29)
    2962                      .dwattr $C$DW$314, DW_AT_name("rsvd2_5")
    2963                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_rsvd2_5")
    2964                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2965                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2966              
    2967              $C$DW$315       .dwtag  DW_TAG_member
    2968                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$29)
    2969                      .dwattr $C$DW$315, DW_AT_name("rsvd2_6")
    2970                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_rsvd2_6")
    2971                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2972                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2973              
    2974              $C$DW$316       .dwtag  DW_TAG_member
    2975                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$29)
    2976                      .dwattr $C$DW$316, DW_AT_name("rsvd2_7")
    2977                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_rsvd2_7")
    2978                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2979                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   56

    2980              
    2981              $C$DW$317       .dwtag  DW_TAG_member
    2982                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$29)
    2983                      .dwattr $C$DW$317, DW_AT_name("rsvd2_8")
    2984                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_rsvd2_8")
    2985                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    2986                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2987              
    2988              $C$DW$318       .dwtag  DW_TAG_member
    2989                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$29)
    2990                      .dwattr $C$DW$318, DW_AT_name("EPWM1_INT")
    2991                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_EPWM1_INT")
    2992                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2993                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2994              
    2995              $C$DW$319       .dwtag  DW_TAG_member
    2996                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$29)
    2997                      .dwattr $C$DW$319, DW_AT_name("EPWM2_INT")
    2998                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_EPWM2_INT")
    2999                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    3000                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3001              
    3002              $C$DW$320       .dwtag  DW_TAG_member
    3003                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$29)
    3004                      .dwattr $C$DW$320, DW_AT_name("EPWM3_INT")
    3005                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_EPWM3_INT")
    3006                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3007                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3008              
    3009              $C$DW$321       .dwtag  DW_TAG_member
    3010                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$29)
    3011                      .dwattr $C$DW$321, DW_AT_name("EPWM4_INT")
    3012                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_EPWM4_INT")
    3013                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    3014                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3015              
    3016              $C$DW$322       .dwtag  DW_TAG_member
    3017                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$29)
    3018                      .dwattr $C$DW$322, DW_AT_name("rsvd3_5")
    3019                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_rsvd3_5")
    3020                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    3021                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3022              
    3023              $C$DW$323       .dwtag  DW_TAG_member
    3024                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$29)
    3025                      .dwattr $C$DW$323, DW_AT_name("rsvd3_6")
    3026                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_rsvd3_6")
    3027                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    3028                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3029              
    3030              $C$DW$324       .dwtag  DW_TAG_member
    3031                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$29)
    3032                      .dwattr $C$DW$324, DW_AT_name("rsvd3_7")
    3033                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_rsvd3_7")
    3034                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   57

    3035                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3036              
    3037              $C$DW$325       .dwtag  DW_TAG_member
    3038                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$29)
    3039                      .dwattr $C$DW$325, DW_AT_name("rsvd3_8")
    3040                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_rsvd3_8")
    3041                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    3042                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3043              
    3044              $C$DW$326       .dwtag  DW_TAG_member
    3045                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$29)
    3046                      .dwattr $C$DW$326, DW_AT_name("ECAP1_INT")
    3047                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_ECAP1_INT")
    3048                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    3049                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3050              
    3051              $C$DW$327       .dwtag  DW_TAG_member
    3052                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$29)
    3053                      .dwattr $C$DW$327, DW_AT_name("rsvd4_2")
    3054                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_rsvd4_2")
    3055                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3056                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3057              
    3058              $C$DW$328       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$29)
    3060                      .dwattr $C$DW$328, DW_AT_name("rsvd4_3")
    3061                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_rsvd4_3")
    3062                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    3063                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3064              
    3065              $C$DW$329       .dwtag  DW_TAG_member
    3066                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$29)
    3067                      .dwattr $C$DW$329, DW_AT_name("rsvd4_4")
    3068                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_rsvd4_4")
    3069                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    3070                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3071              
    3072              $C$DW$330       .dwtag  DW_TAG_member
    3073                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$29)
    3074                      .dwattr $C$DW$330, DW_AT_name("rsvd4_5")
    3075                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_rsvd4_5")
    3076                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    3077                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3078              
    3079              $C$DW$331       .dwtag  DW_TAG_member
    3080                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$29)
    3081                      .dwattr $C$DW$331, DW_AT_name("rsvd4_6")
    3082                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_rsvd4_6")
    3083                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3084                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3085              
    3086              $C$DW$332       .dwtag  DW_TAG_member
    3087                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$29)
    3088                      .dwattr $C$DW$332, DW_AT_name("rsvd4_7")
    3089                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_rsvd4_7")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   58

    3090                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3091                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3092              
    3093              $C$DW$333       .dwtag  DW_TAG_member
    3094                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$29)
    3095                      .dwattr $C$DW$333, DW_AT_name("rsvd4_8")
    3096                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_rsvd4_8")
    3097                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3098                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3099              
    3100              $C$DW$334       .dwtag  DW_TAG_member
    3101                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$29)
    3102                      .dwattr $C$DW$334, DW_AT_name("rsvd5_1")
    3103                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_rsvd5_1")
    3104                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3105                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3106              
    3107              $C$DW$335       .dwtag  DW_TAG_member
    3108                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$29)
    3109                      .dwattr $C$DW$335, DW_AT_name("rsvd5_2")
    3110                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_rsvd5_2")
    3111                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3112                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3113              
    3114              $C$DW$336       .dwtag  DW_TAG_member
    3115                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$29)
    3116                      .dwattr $C$DW$336, DW_AT_name("rsvd5_3")
    3117                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_rsvd5_3")
    3118                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3119                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3120              
    3121              $C$DW$337       .dwtag  DW_TAG_member
    3122                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$29)
    3123                      .dwattr $C$DW$337, DW_AT_name("rsvd5_4")
    3124                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_rsvd5_4")
    3125                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3126                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3127              
    3128              $C$DW$338       .dwtag  DW_TAG_member
    3129                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$29)
    3130                      .dwattr $C$DW$338, DW_AT_name("rsvd5_5")
    3131                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_rsvd5_5")
    3132                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3133                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3134              
    3135              $C$DW$339       .dwtag  DW_TAG_member
    3136                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$29)
    3137                      .dwattr $C$DW$339, DW_AT_name("rsvd5_6")
    3138                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_rsvd5_6")
    3139                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3140                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3141              
    3142              $C$DW$340       .dwtag  DW_TAG_member
    3143                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$29)
    3144                      .dwattr $C$DW$340, DW_AT_name("rsvd5_7")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   59

    3145                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_rsvd5_7")
    3146                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    3147                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3148              
    3149              $C$DW$341       .dwtag  DW_TAG_member
    3150                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$29)
    3151                      .dwattr $C$DW$341, DW_AT_name("rsvd5_8")
    3152                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_rsvd5_8")
    3153                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3154                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3155              
    3156              $C$DW$342       .dwtag  DW_TAG_member
    3157                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$29)
    3158                      .dwattr $C$DW$342, DW_AT_name("SPIRXINTA")
    3159                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_SPIRXINTA")
    3160                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    3161                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3162              
    3163              $C$DW$343       .dwtag  DW_TAG_member
    3164                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$29)
    3165                      .dwattr $C$DW$343, DW_AT_name("SPITXINTA")
    3166                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_SPITXINTA")
    3167                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3168                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3169              
    3170              $C$DW$344       .dwtag  DW_TAG_member
    3171                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$29)
    3172                      .dwattr $C$DW$344, DW_AT_name("rsvd6_3")
    3173                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_rsvd6_3")
    3174                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    3175                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3176              
    3177              $C$DW$345       .dwtag  DW_TAG_member
    3178                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$29)
    3179                      .dwattr $C$DW$345, DW_AT_name("rsvd6_4")
    3180                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_rsvd6_4")
    3181                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3182                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3183              
    3184              $C$DW$346       .dwtag  DW_TAG_member
    3185                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$29)
    3186                      .dwattr $C$DW$346, DW_AT_name("rsvd6_5")
    3187                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_rsvd6_5")
    3188                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    3189                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3190              
    3191              $C$DW$347       .dwtag  DW_TAG_member
    3192                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$29)
    3193                      .dwattr $C$DW$347, DW_AT_name("rsvd6_6")
    3194                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_rsvd6_6")
    3195                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3196                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3197              
    3198              $C$DW$348       .dwtag  DW_TAG_member
    3199                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   60

    3200                      .dwattr $C$DW$348, DW_AT_name("rsvd6_7")
    3201                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_rsvd6_7")
    3202                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3203                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3204              
    3205              $C$DW$349       .dwtag  DW_TAG_member
    3206                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$29)
    3207                      .dwattr $C$DW$349, DW_AT_name("rsvd6_8")
    3208                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_rsvd6_8")
    3209                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    3210                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3211              
    3212              $C$DW$350       .dwtag  DW_TAG_member
    3213                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$29)
    3214                      .dwattr $C$DW$350, DW_AT_name("rsvd7_1")
    3215                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_rsvd7_1")
    3216                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3217                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3218              
    3219              $C$DW$351       .dwtag  DW_TAG_member
    3220                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$29)
    3221                      .dwattr $C$DW$351, DW_AT_name("rsvd7_2")
    3222                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_rsvd7_2")
    3223                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    3224                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3225              
    3226              $C$DW$352       .dwtag  DW_TAG_member
    3227                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$29)
    3228                      .dwattr $C$DW$352, DW_AT_name("rsvd7_3")
    3229                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_rsvd7_3")
    3230                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3231                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3232              
    3233              $C$DW$353       .dwtag  DW_TAG_member
    3234                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$29)
    3235                      .dwattr $C$DW$353, DW_AT_name("rsvd7_4")
    3236                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_rsvd7_4")
    3237                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3238                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3239              
    3240              $C$DW$354       .dwtag  DW_TAG_member
    3241                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$29)
    3242                      .dwattr $C$DW$354, DW_AT_name("rsvd7_5")
    3243                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_rsvd7_5")
    3244                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3245                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3246              
    3247              $C$DW$355       .dwtag  DW_TAG_member
    3248                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$29)
    3249                      .dwattr $C$DW$355, DW_AT_name("rsvd7_6")
    3250                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_rsvd7_6")
    3251                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3252                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3253              
    3254              $C$DW$356       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   61

    3255                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$29)
    3256                      .dwattr $C$DW$356, DW_AT_name("rsvd7_7")
    3257                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_rsvd7_7")
    3258                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3259                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3260              
    3261              $C$DW$357       .dwtag  DW_TAG_member
    3262                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$29)
    3263                      .dwattr $C$DW$357, DW_AT_name("rsvd7_8")
    3264                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_rsvd7_8")
    3265                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3266                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3267              
    3268              $C$DW$358       .dwtag  DW_TAG_member
    3269                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$29)
    3270                      .dwattr $C$DW$358, DW_AT_name("I2CINT1A")
    3271                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_I2CINT1A")
    3272                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3273                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3274              
    3275              $C$DW$359       .dwtag  DW_TAG_member
    3276                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$29)
    3277                      .dwattr $C$DW$359, DW_AT_name("I2CINT2A")
    3278                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_I2CINT2A")
    3279                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3280                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3281              
    3282              $C$DW$360       .dwtag  DW_TAG_member
    3283                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$29)
    3284                      .dwattr $C$DW$360, DW_AT_name("rsvd8_3")
    3285                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_rsvd8_3")
    3286                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3287                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3288              
    3289              $C$DW$361       .dwtag  DW_TAG_member
    3290                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$29)
    3291                      .dwattr $C$DW$361, DW_AT_name("rsvd8_4")
    3292                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_rsvd8_4")
    3293                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3294                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3295              
    3296              $C$DW$362       .dwtag  DW_TAG_member
    3297                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$29)
    3298                      .dwattr $C$DW$362, DW_AT_name("rsvd8_5")
    3299                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_rsvd8_5")
    3300                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3301                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3302              
    3303              $C$DW$363       .dwtag  DW_TAG_member
    3304                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$29)
    3305                      .dwattr $C$DW$363, DW_AT_name("rsvd8_6")
    3306                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_rsvd8_6")
    3307                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3308                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3309              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   62

    3310              $C$DW$364       .dwtag  DW_TAG_member
    3311                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$29)
    3312                      .dwattr $C$DW$364, DW_AT_name("rsvd8_7")
    3313                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_rsvd8_7")
    3314                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3315                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3316              
    3317              $C$DW$365       .dwtag  DW_TAG_member
    3318                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$29)
    3319                      .dwattr $C$DW$365, DW_AT_name("rsvd8_8")
    3320                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_rsvd8_8")
    3321                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3322                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3323              
    3324              $C$DW$366       .dwtag  DW_TAG_member
    3325                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$29)
    3326                      .dwattr $C$DW$366, DW_AT_name("SCIRXINTA")
    3327                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_SCIRXINTA")
    3328                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3329                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3330              
    3331              $C$DW$367       .dwtag  DW_TAG_member
    3332                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$29)
    3333                      .dwattr $C$DW$367, DW_AT_name("SCITXINTA")
    3334                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_SCITXINTA")
    3335                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3336                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3337              
    3338              $C$DW$368       .dwtag  DW_TAG_member
    3339                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$29)
    3340                      .dwattr $C$DW$368, DW_AT_name("rsvd9_3")
    3341                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_rsvd9_3")
    3342                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    3343                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3344              
    3345              $C$DW$369       .dwtag  DW_TAG_member
    3346                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$29)
    3347                      .dwattr $C$DW$369, DW_AT_name("rsvd9_4")
    3348                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_rsvd9_4")
    3349                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3350                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3351              
    3352              $C$DW$370       .dwtag  DW_TAG_member
    3353                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$29)
    3354                      .dwattr $C$DW$370, DW_AT_name("rsvd9_5")
    3355                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_rsvd9_5")
    3356                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3357                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3358              
    3359              $C$DW$371       .dwtag  DW_TAG_member
    3360                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$29)
    3361                      .dwattr $C$DW$371, DW_AT_name("rsvd9_6")
    3362                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_rsvd9_6")
    3363                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3364                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   63

    3365              
    3366              $C$DW$372       .dwtag  DW_TAG_member
    3367                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$29)
    3368                      .dwattr $C$DW$372, DW_AT_name("rsvd9_7")
    3369                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_rsvd9_7")
    3370                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3371                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3372              
    3373              $C$DW$373       .dwtag  DW_TAG_member
    3374                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$29)
    3375                      .dwattr $C$DW$373, DW_AT_name("rsvd9_8")
    3376                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_rsvd9_8")
    3377                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3378                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3379              
    3380              $C$DW$374       .dwtag  DW_TAG_member
    3381                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$29)
    3382                      .dwattr $C$DW$374, DW_AT_name("ADCINT1")
    3383                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_ADCINT1")
    3384                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3385                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3386              
    3387              $C$DW$375       .dwtag  DW_TAG_member
    3388                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$29)
    3389                      .dwattr $C$DW$375, DW_AT_name("ADCINT2")
    3390                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_ADCINT2")
    3391                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3392                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3393              
    3394              $C$DW$376       .dwtag  DW_TAG_member
    3395                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$29)
    3396                      .dwattr $C$DW$376, DW_AT_name("ADCINT3")
    3397                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_ADCINT3")
    3398                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3399                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3400              
    3401              $C$DW$377       .dwtag  DW_TAG_member
    3402                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$29)
    3403                      .dwattr $C$DW$377, DW_AT_name("ADCINT4")
    3404                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_ADCINT4")
    3405                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3406                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3407              
    3408              $C$DW$378       .dwtag  DW_TAG_member
    3409                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$29)
    3410                      .dwattr $C$DW$378, DW_AT_name("ADCINT5")
    3411                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_ADCINT5")
    3412                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    3413                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3414              
    3415              $C$DW$379       .dwtag  DW_TAG_member
    3416                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$29)
    3417                      .dwattr $C$DW$379, DW_AT_name("ADCINT6")
    3418                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_ADCINT6")
    3419                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   64

    3420                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3421              
    3422              $C$DW$380       .dwtag  DW_TAG_member
    3423                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$29)
    3424                      .dwattr $C$DW$380, DW_AT_name("ADCINT7")
    3425                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_ADCINT7")
    3426                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    3427                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3428              
    3429              $C$DW$381       .dwtag  DW_TAG_member
    3430                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$29)
    3431                      .dwattr $C$DW$381, DW_AT_name("ADCINT8")
    3432                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_ADCINT8")
    3433                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3434                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3435              
    3436              $C$DW$382       .dwtag  DW_TAG_member
    3437                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$29)
    3438                      .dwattr $C$DW$382, DW_AT_name("rsvd11_1")
    3439                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_rsvd11_1")
    3440                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3441                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3442              
    3443              $C$DW$383       .dwtag  DW_TAG_member
    3444                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$29)
    3445                      .dwattr $C$DW$383, DW_AT_name("rsvd11_2")
    3446                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_rsvd11_2")
    3447                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3448                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3449              
    3450              $C$DW$384       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$29)
    3452                      .dwattr $C$DW$384, DW_AT_name("rsvd11_3")
    3453                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_rsvd11_3")
    3454                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3455                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3456              
    3457              $C$DW$385       .dwtag  DW_TAG_member
    3458                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$29)
    3459                      .dwattr $C$DW$385, DW_AT_name("rsvd11_4")
    3460                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_rsvd11_4")
    3461                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3462                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3463              
    3464              $C$DW$386       .dwtag  DW_TAG_member
    3465                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$29)
    3466                      .dwattr $C$DW$386, DW_AT_name("rsvd11_5")
    3467                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_rsvd11_5")
    3468                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    3469                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3470              
    3471              $C$DW$387       .dwtag  DW_TAG_member
    3472                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$29)
    3473                      .dwattr $C$DW$387, DW_AT_name("rsvd11_6")
    3474                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_rsvd11_6")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   65

    3475                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    3476                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3477              
    3478              $C$DW$388       .dwtag  DW_TAG_member
    3479                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$29)
    3480                      .dwattr $C$DW$388, DW_AT_name("rsvd11_7")
    3481                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_rsvd11_7")
    3482                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    3483                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3484              
    3485              $C$DW$389       .dwtag  DW_TAG_member
    3486                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$29)
    3487                      .dwattr $C$DW$389, DW_AT_name("rsvd11_8")
    3488                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_rsvd11_8")
    3489                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    3490                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3491              
    3492              $C$DW$390       .dwtag  DW_TAG_member
    3493                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$29)
    3494                      .dwattr $C$DW$390, DW_AT_name("XINT3")
    3495                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_XINT3")
    3496                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    3497                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3498              
    3499              $C$DW$391       .dwtag  DW_TAG_member
    3500                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$29)
    3501                      .dwattr $C$DW$391, DW_AT_name("rsvd12_2")
    3502                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_rsvd12_2")
    3503                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    3504                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3505              
    3506              $C$DW$392       .dwtag  DW_TAG_member
    3507                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$29)
    3508                      .dwattr $C$DW$392, DW_AT_name("rsvd12_3")
    3509                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_rsvd12_3")
    3510                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    3511                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3512              
    3513              $C$DW$393       .dwtag  DW_TAG_member
    3514                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$29)
    3515                      .dwattr $C$DW$393, DW_AT_name("rsvd12_4")
    3516                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_rsvd12_4")
    3517                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    3518                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3519              
    3520              $C$DW$394       .dwtag  DW_TAG_member
    3521                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$29)
    3522                      .dwattr $C$DW$394, DW_AT_name("rsvd12_5")
    3523                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_rsvd12_5")
    3524                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    3525                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3526              
    3527              $C$DW$395       .dwtag  DW_TAG_member
    3528                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$29)
    3529                      .dwattr $C$DW$395, DW_AT_name("rsvd12_6")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   66

    3530                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_rsvd12_6")
    3531                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x11a]
    3532                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3533              
    3534              $C$DW$396       .dwtag  DW_TAG_member
    3535                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$29)
    3536                      .dwattr $C$DW$396, DW_AT_name("rsvd12_7")
    3537                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_rsvd12_7")
    3538                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    3539                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3540              
    3541              $C$DW$397       .dwtag  DW_TAG_member
    3542                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$29)
    3543                      .dwattr $C$DW$397, DW_AT_name("rsvd12_8")
    3544                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_rsvd12_8")
    3545                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x11e]
    3546                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3547              
    3548              $C$DW$398       .dwtag  DW_TAG_member
    3549                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$30)
    3550                      .dwattr $C$DW$398, DW_AT_name("rsvd13")
    3551                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_rsvd13")
    3552                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    3553                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3554              
    3555              $C$DW$399       .dwtag  DW_TAG_member
    3556                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$31)
    3557                      .dwattr $C$DW$399, DW_AT_name("XINTnCR")
    3558                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_XINTnCR")
    3559                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x6390]
    3560                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3561              
    3562              $C$DW$400       .dwtag  DW_TAG_member
    3563                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$32)
    3564                      .dwattr $C$DW$400, DW_AT_name("rsvd14")
    3565                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_rsvd14")
    3566                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x6393]
    3567                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3568              
    3569              $C$DW$401       .dwtag  DW_TAG_member
    3570                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$31)
    3571                      .dwattr $C$DW$401, DW_AT_name("XINTnCTR")
    3572                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_XINTnCTR")
    3573                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x6398]
    3574                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3575              
    3576                      .dwendtag $C$DW$T$33
    3577              
    3578              $C$DW$T$60      .dwtag  DW_TAG_typedef
    3579                      .dwattr $C$DW$T$60, DW_AT_name("PIE_Obj")
    3580                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$33)
    3581                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3582              
    3583              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    3584                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{E1607E84-39DF-45CF-9F74-4081A0734BE8} PAGE   67

    3585                      .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    3586              
    3587              $C$DW$T$62      .dwtag  DW_TAG_typedef
    3588                      .dwattr $C$DW$T$62, DW_AT_name("PIE_Handle")
    3589                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    3590                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3591              
    3592              $C$DW$402       .dwtag  DW_TAG_TI_far_type
    3593                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$62)
    3594              
    3595              $C$DW$T$63      .dwtag  DW_TAG_const_type
    3596                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$402)
    3597              
    3598              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3599                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3600              
    3601              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3602                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3603                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3604              
    3605              
    3606              $C$DW$T$26      .dwtag  DW_TAG_subroutine_type
    3607                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    3608                      .dwendtag $C$DW$T$26
    3609              
    3610              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    3611                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    3612                      .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    3613              
    3614              $C$DW$T$28      .dwtag  DW_TAG_typedef
    3615                      .dwattr $C$DW$T$28, DW_AT_name("PIE_IntVec_t")
    3616                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    3617                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3618              
    3619              $C$DW$403       .dwtag  DW_TAG_TI_far_type
    3620                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$28)
    3621              
    3622              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    3623                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$403)
    3624              
    3625              $C$DW$404       .dwtag  DW_TAG_TI_far_type
    3626                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$28)
    3627              
    3628              $C$DW$T$70      .dwtag  DW_TAG_const_type
    3629                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$404)
    3630              
    3631              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    3632                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$28)
    3633                      .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    3634              
    3635              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3636                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3637                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3638                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3639              
