TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Sun Jun 17 14:52:31 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    4976                      .dwattr $C$DW$673, DW_AT_name("PIE_GroupNumber_7")
    4977                      .dwattr $C$DW$673, DW_AT_const_value(0x06)
    4978              
    4979              $C$DW$674       .dwtag  DW_TAG_enumerator
    4980                      .dwattr $C$DW$674, DW_AT_name("PIE_GroupNumber_8")
    4981                      .dwattr $C$DW$674, DW_AT_const_value(0x07)
    4982              
    4983              $C$DW$675       .dwtag  DW_TAG_enumerator
    4984                      .dwattr $C$DW$675, DW_AT_name("PIE_GroupNumber_9")
    4985                      .dwattr $C$DW$675, DW_AT_const_value(0x08)
    4986              
    4987              $C$DW$676       .dwtag  DW_TAG_enumerator
    4988                      .dwattr $C$DW$676, DW_AT_name("PIE_GroupNumber_10")
    4989                      .dwattr $C$DW$676, DW_AT_const_value(0x09)
    4990              
    4991              $C$DW$677       .dwtag  DW_TAG_enumerator
    4992                      .dwattr $C$DW$677, DW_AT_name("PIE_GroupNumber_11")
    4993                      .dwattr $C$DW$677, DW_AT_const_value(0x0a)
    4994              
    4995              $C$DW$678       .dwtag  DW_TAG_enumerator
    4996                      .dwattr $C$DW$678, DW_AT_name("PIE_GroupNumber_12")
    4997                      .dwattr $C$DW$678, DW_AT_const_value(0x0b)
    4998              
    4999                      .dwendtag $C$DW$T$254
    5000              
    5001              $C$DW$T$255     .dwtag  DW_TAG_typedef
    5002                      .dwattr $C$DW$T$255, DW_AT_name("PIE_GroupNumber_e")
    5003                      .dwattr $C$DW$T$255, DW_AT_type(*$C$DW$T$254)
    5004                      .dwattr $C$DW$T$255, DW_AT_language(DW_LANG_C)
    5005              
    5006              $C$DW$679       .dwtag  DW_TAG_TI_far_type
    5007                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$255)
    5008              
    5009              $C$DW$T$256     .dwtag  DW_TAG_const_type
    5010                      .dwattr $C$DW$T$256, DW_AT_type(*$C$DW$679)
    5011              
    5012              
    5013              $C$DW$T$257     .dwtag  DW_TAG_enumeration_type
    5014                      .dwattr $C$DW$T$257, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE   97

    5015              $C$DW$680       .dwtag  DW_TAG_enumerator
    5016                      .dwattr $C$DW$680, DW_AT_name("CTRL_Type_PID_spd")
    5017                      .dwattr $C$DW$680, DW_AT_const_value(0x00)
    5018              
    5019              $C$DW$681       .dwtag  DW_TAG_enumerator
    5020                      .dwattr $C$DW$681, DW_AT_name("CTRL_Type_PID_Id")
    5021                      .dwattr $C$DW$681, DW_AT_const_value(0x01)
    5022              
    5023              $C$DW$682       .dwtag  DW_TAG_enumerator
    5024                      .dwattr $C$DW$682, DW_AT_name("CTRL_Type_PID_Iq")
    5025                      .dwattr $C$DW$682, DW_AT_const_value(0x02)
    5026              
    5027                      .dwendtag $C$DW$T$257
    5028              
    5029              $C$DW$T$258     .dwtag  DW_TAG_typedef
    5030                      .dwattr $C$DW$T$258, DW_AT_name("CTRL_Type_e")
    5031                      .dwattr $C$DW$T$258, DW_AT_type(*$C$DW$T$257)
    5032                      .dwattr $C$DW$T$258, DW_AT_language(DW_LANG_C)
    5033              
    5034              $C$DW$683       .dwtag  DW_TAG_TI_far_type
    5035                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$258)
    5036              
    5037              $C$DW$T$259     .dwtag  DW_TAG_const_type
    5038                      .dwattr $C$DW$T$259, DW_AT_type(*$C$DW$683)
    5039              
    5040              
    5041              $C$DW$T$260     .dwtag  DW_TAG_enumeration_type
    5042                      .dwattr $C$DW$T$260, DW_AT_byte_size(0x01)
    5043              $C$DW$684       .dwtag  DW_TAG_enumerator
    5044                      .dwattr $C$DW$684, DW_AT_name("HAL_SensorType_Current")
    5045                      .dwattr $C$DW$684, DW_AT_const_value(0x00)
    5046              
    5047              $C$DW$685       .dwtag  DW_TAG_enumerator
    5048                      .dwattr $C$DW$685, DW_AT_name("HAL_SensorType_Voltage")
    5049                      .dwattr $C$DW$685, DW_AT_const_value(0x01)
    5050              
    5051                      .dwendtag $C$DW$T$260
    5052              
    5053              $C$DW$T$261     .dwtag  DW_TAG_typedef
    5054                      .dwattr $C$DW$T$261, DW_AT_name("HAL_SensorType_e")
    5055                      .dwattr $C$DW$T$261, DW_AT_type(*$C$DW$T$260)
    5056                      .dwattr $C$DW$T$261, DW_AT_language(DW_LANG_C)
    5057              
    5058              $C$DW$686       .dwtag  DW_TAG_TI_far_type
    5059                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$261)
    5060              
    5061              $C$DW$T$262     .dwtag  DW_TAG_const_type
    5062                      .dwattr $C$DW$T$262, DW_AT_type(*$C$DW$686)
    5063              
    5064              
    5065              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5066                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    5067                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    5068              $C$DW$687       .dwtag  DW_TAG_member
    5069                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE   98

    5070                      .dwattr $C$DW$687, DW_AT_name("ADCRESULT")
    5071                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_ADCRESULT")
    5072                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5073                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    5074              
    5075              $C$DW$688       .dwtag  DW_TAG_member
    5076                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$25)
    5077                      .dwattr $C$DW$688, DW_AT_name("resvd_1")
    5078                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_resvd_1")
    5079                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5080                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    5081              
    5082              $C$DW$689       .dwtag  DW_TAG_member
    5083                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$23)
    5084                      .dwattr $C$DW$689, DW_AT_name("ADCCTL1")
    5085                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_ADCCTL1")
    5086                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    5087                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    5088              
    5089              $C$DW$690       .dwtag  DW_TAG_member
    5090                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$23)
    5091                      .dwattr $C$DW$690, DW_AT_name("ADCCTL2")
    5092                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_ADCCTL2")
    5093                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    5094                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    5095              
    5096              $C$DW$691       .dwtag  DW_TAG_member
    5097                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$26)
    5098                      .dwattr $C$DW$691, DW_AT_name("rsvd_2")
    5099                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd_2")
    5100                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    5101                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    5102              
    5103              $C$DW$692       .dwtag  DW_TAG_member
    5104                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$23)
    5105                      .dwattr $C$DW$692, DW_AT_name("ADCINTFLG")
    5106                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ADCINTFLG")
    5107                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    5108                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    5109              
    5110              $C$DW$693       .dwtag  DW_TAG_member
    5111                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$23)
    5112                      .dwattr $C$DW$693, DW_AT_name("ADCINTFLGCLR")
    5113                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    5114                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    5115                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    5116              
    5117              $C$DW$694       .dwtag  DW_TAG_member
    5118                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$23)
    5119                      .dwattr $C$DW$694, DW_AT_name("ADCINTOVF")
    5120                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_ADCINTOVF")
    5121                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    5122                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    5123              
    5124              $C$DW$695       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE   99

    5125                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$23)
    5126                      .dwattr $C$DW$695, DW_AT_name("ADCINTOVFCLR")
    5127                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    5128                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    5129                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    5130              
    5131              $C$DW$696       .dwtag  DW_TAG_member
    5132                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$27)
    5133                      .dwattr $C$DW$696, DW_AT_name("INTSELxNy")
    5134                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_INTSELxNy")
    5135                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    5136                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    5137              
    5138              $C$DW$697       .dwtag  DW_TAG_member
    5139                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$28)
    5140                      .dwattr $C$DW$697, DW_AT_name("rsvd_3")
    5141                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_rsvd_3")
    5142                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    5143                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    5144              
    5145              $C$DW$698       .dwtag  DW_TAG_member
    5146                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$23)
    5147                      .dwattr $C$DW$698, DW_AT_name("SOCPRICTRL")
    5148                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_SOCPRICTRL")
    5149                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    5150                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    5151              
    5152              $C$DW$699       .dwtag  DW_TAG_member
    5153                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$23)
    5154                      .dwattr $C$DW$699, DW_AT_name("rsvd_4")
    5155                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_rsvd_4")
    5156                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    5157                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    5158              
    5159              $C$DW$700       .dwtag  DW_TAG_member
    5160                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$23)
    5161                      .dwattr $C$DW$700, DW_AT_name("ADCSAMPLEMODE")
    5162                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    5163                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    5164                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    5165              
    5166              $C$DW$701       .dwtag  DW_TAG_member
    5167                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$23)
    5168                      .dwattr $C$DW$701, DW_AT_name("rsvd_5")
    5169                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_rsvd_5")
    5170                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    5171                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    5172              
    5173              $C$DW$702       .dwtag  DW_TAG_member
    5174                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$23)
    5175                      .dwattr $C$DW$702, DW_AT_name("ADCINTSOCSEL1")
    5176                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    5177                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    5178                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    5179              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  100

    5180              $C$DW$703       .dwtag  DW_TAG_member
    5181                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$23)
    5182                      .dwattr $C$DW$703, DW_AT_name("ADCINTSOCSEL2")
    5183                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    5184                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    5185                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    5186              
    5187              $C$DW$704       .dwtag  DW_TAG_member
    5188                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$26)
    5189                      .dwattr $C$DW$704, DW_AT_name("rsvd_6")
    5190                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_rsvd_6")
    5191                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    5192                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    5193              
    5194              $C$DW$705       .dwtag  DW_TAG_member
    5195                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$23)
    5196                      .dwattr $C$DW$705, DW_AT_name("ADCSOCFLG1")
    5197                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    5198                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    5199                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    5200              
    5201              $C$DW$706       .dwtag  DW_TAG_member
    5202                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$23)
    5203                      .dwattr $C$DW$706, DW_AT_name("rsvd_7")
    5204                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_rsvd_7")
    5205                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    5206                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    5207              
    5208              $C$DW$707       .dwtag  DW_TAG_member
    5209                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$23)
    5210                      .dwattr $C$DW$707, DW_AT_name("ADCSOCFRC1")
    5211                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    5212                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    5213                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    5214              
    5215              $C$DW$708       .dwtag  DW_TAG_member
    5216                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$23)
    5217                      .dwattr $C$DW$708, DW_AT_name("rsvd_8")
    5218                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_rsvd_8")
    5219                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    5220                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    5221              
    5222              $C$DW$709       .dwtag  DW_TAG_member
    5223                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$23)
    5224                      .dwattr $C$DW$709, DW_AT_name("ADCSOCOVF1")
    5225                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    5226                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    5227                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    5228              
    5229              $C$DW$710       .dwtag  DW_TAG_member
    5230                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$23)
    5231                      .dwattr $C$DW$710, DW_AT_name("rsvd_9")
    5232                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_rsvd_9")
    5233                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    5234                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  101

    5235              
    5236              $C$DW$711       .dwtag  DW_TAG_member
    5237                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$23)
    5238                      .dwattr $C$DW$711, DW_AT_name("ADCSOCOVFCLR1")
    5239                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    5240                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    5241                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    5242              
    5243              $C$DW$712       .dwtag  DW_TAG_member
    5244                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$23)
    5245                      .dwattr $C$DW$712, DW_AT_name("rsvd_10")
    5246                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_rsvd_10")
    5247                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    5248                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    5249              
    5250              $C$DW$713       .dwtag  DW_TAG_member
    5251                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$24)
    5252                      .dwattr $C$DW$713, DW_AT_name("ADCSOCxCTL")
    5253                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    5254                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    5255                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    5256              
    5257              $C$DW$714       .dwtag  DW_TAG_member
    5258                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$24)
    5259                      .dwattr $C$DW$714, DW_AT_name("rsvd_11")
    5260                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_rsvd_11")
    5261                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    5262                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    5263              
    5264              $C$DW$715       .dwtag  DW_TAG_member
    5265                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$23)
    5266                      .dwattr $C$DW$715, DW_AT_name("ADCREFTRIM")
    5267                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_ADCREFTRIM")
    5268                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    5269                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    5270              
    5271              $C$DW$716       .dwtag  DW_TAG_member
    5272                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$23)
    5273                      .dwattr $C$DW$716, DW_AT_name("ADCOFFTRIM")
    5274                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    5275                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    5276                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    5277              
    5278              $C$DW$717       .dwtag  DW_TAG_member
    5279                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$29)
    5280                      .dwattr $C$DW$717, DW_AT_name("resvd_12")
    5281                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_resvd_12")
    5282                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    5283                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    5284              
    5285              $C$DW$718       .dwtag  DW_TAG_member
    5286                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$23)
    5287                      .dwattr $C$DW$718, DW_AT_name("ADCREV")
    5288                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_ADCREV")
    5289                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  102

    5290                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    5291              
    5292                      .dwendtag $C$DW$T$30
    5293              
    5294              $C$DW$T$263     .dwtag  DW_TAG_typedef
    5295                      .dwattr $C$DW$T$263, DW_AT_name("ADC_Obj")
    5296                      .dwattr $C$DW$T$263, DW_AT_type(*$C$DW$T$30)
    5297                      .dwattr $C$DW$T$263, DW_AT_language(DW_LANG_C)
    5298              
    5299              $C$DW$T$156     .dwtag  DW_TAG_pointer_type
    5300                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$30)
    5301                      .dwattr $C$DW$T$156, DW_AT_address_class(0x20)
    5302              
    5303              $C$DW$T$157     .dwtag  DW_TAG_typedef
    5304                      .dwattr $C$DW$T$157, DW_AT_name("ADC_Handle")
    5305                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$156)
    5306                      .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    5307              
    5308              
    5309              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5310                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    5311                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    5312              $C$DW$719       .dwtag  DW_TAG_member
    5313                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$31)
    5314                      .dwattr $C$DW$719, DW_AT_name("alpha_sf")
    5315                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_alpha_sf")
    5316                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5317                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    5318              
    5319              $C$DW$720       .dwtag  DW_TAG_member
    5320                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$31)
    5321                      .dwattr $C$DW$720, DW_AT_name("beta_sf")
    5322                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_beta_sf")
    5323                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5324                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    5325              
    5326              $C$DW$721       .dwtag  DW_TAG_member
    5327                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$32)
    5328                      .dwattr $C$DW$721, DW_AT_name("numSensors")
    5329                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_numSensors")
    5330                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5331                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    5332              
    5333                      .dwendtag $C$DW$T$33
    5334              
    5335              $C$DW$T$44      .dwtag  DW_TAG_typedef
    5336                      .dwattr $C$DW$T$44, DW_AT_name("CLARKE_Obj")
    5337                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    5338                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    5339              
    5340              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    5341                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    5342                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    5343              
    5344              $C$DW$T$43      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  103

    5345                      .dwattr $C$DW$T$43, DW_AT_name("CLARKE_Handle")
    5346                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    5347                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    5348              
    5349              
    5350              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5351                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    5352                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    5353              $C$DW$722       .dwtag  DW_TAG_member
    5354                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$23)
    5355                      .dwattr $C$DW$722, DW_AT_name("XCLK")
    5356                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_XCLK")
    5357                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5358                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    5359              
    5360              $C$DW$723       .dwtag  DW_TAG_member
    5361                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$23)
    5362                      .dwattr $C$DW$723, DW_AT_name("rsvd_1")
    5363                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_rsvd_1")
    5364                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5365                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    5366              
    5367              $C$DW$724       .dwtag  DW_TAG_member
    5368                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$23)
    5369                      .dwattr $C$DW$724, DW_AT_name("CLKCTL")
    5370                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_CLKCTL")
    5371                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5372                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    5373              
    5374              $C$DW$725       .dwtag  DW_TAG_member
    5375                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$34)
    5376                      .dwattr $C$DW$725, DW_AT_name("rsvd_2")
    5377                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_rsvd_2")
    5378                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5379                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    5380              
    5381              $C$DW$726       .dwtag  DW_TAG_member
    5382                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$23)
    5383                      .dwattr $C$DW$726, DW_AT_name("LOSPCP")
    5384                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_LOSPCP")
    5385                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5386                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    5387              
    5388              $C$DW$727       .dwtag  DW_TAG_member
    5389                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$23)
    5390                      .dwattr $C$DW$727, DW_AT_name("PCLKCR0")
    5391                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_PCLKCR0")
    5392                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5393                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    5394              
    5395              $C$DW$728       .dwtag  DW_TAG_member
    5396                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$23)
    5397                      .dwattr $C$DW$728, DW_AT_name("PCLKCR1")
    5398                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_PCLKCR1")
    5399                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  104

    5400                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    5401              
    5402              $C$DW$729       .dwtag  DW_TAG_member
    5403                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$26)
    5404                      .dwattr $C$DW$729, DW_AT_name("rsvd_3")
    5405                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_rsvd_3")
    5406                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5407                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    5408              
    5409              $C$DW$730       .dwtag  DW_TAG_member
    5410                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$23)
    5411                      .dwattr $C$DW$730, DW_AT_name("PCLKCR3")
    5412                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_PCLKCR3")
    5413                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5414                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    5415              
    5416                      .dwendtag $C$DW$T$35
    5417              
    5418              $C$DW$T$158     .dwtag  DW_TAG_pointer_type
    5419                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$35)
    5420                      .dwattr $C$DW$T$158, DW_AT_address_class(0x20)
    5421              
    5422              $C$DW$T$159     .dwtag  DW_TAG_typedef
    5423                      .dwattr $C$DW$T$159, DW_AT_name("CLK_Handle")
    5424                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$158)
    5425                      .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    5426              
    5427              
    5428              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5429                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    5430                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    5431              $C$DW$731       .dwtag  DW_TAG_member
    5432                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$32)
    5433                      .dwattr $C$DW$731, DW_AT_name("tmp")
    5434                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_tmp")
    5435                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5436                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    5437              
    5438                      .dwendtag $C$DW$T$36
    5439              
    5440              $C$DW$T$160     .dwtag  DW_TAG_pointer_type
    5441                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$36)
    5442                      .dwattr $C$DW$T$160, DW_AT_address_class(0x20)
    5443              
    5444              $C$DW$T$161     .dwtag  DW_TAG_typedef
    5445                      .dwattr $C$DW$T$161, DW_AT_name("CPU_Handle")
    5446                      .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$160)
    5447                      .dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
    5448              
    5449              
    5450              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    5451                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    5452                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    5453              $C$DW$732       .dwtag  DW_TAG_member
    5454                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  105

    5455                      .dwattr $C$DW$732, DW_AT_name("version")
    5456                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_version")
    5457                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5458                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    5459              
    5460              $C$DW$733       .dwtag  DW_TAG_member
    5461                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$39)
    5462                      .dwattr $C$DW$733, DW_AT_name("state")
    5463                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_state")
    5464                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5465                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    5466              
    5467              $C$DW$734       .dwtag  DW_TAG_member
    5468                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$39)
    5469                      .dwattr $C$DW$734, DW_AT_name("prevState")
    5470                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_prevState")
    5471                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5472                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    5473              
    5474              $C$DW$735       .dwtag  DW_TAG_member
    5475                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$41)
    5476                      .dwattr $C$DW$735, DW_AT_name("errorCode")
    5477                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_errorCode")
    5478                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5479                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    5480              
    5481              $C$DW$736       .dwtag  DW_TAG_member
    5482                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$43)
    5483                      .dwattr $C$DW$736, DW_AT_name("clarkeHandle_I")
    5484                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_clarkeHandle_I")
    5485                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5486                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    5487              
    5488              $C$DW$737       .dwtag  DW_TAG_member
    5489                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$44)
    5490                      .dwattr $C$DW$737, DW_AT_name("clarke_I")
    5491                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_clarke_I")
    5492                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5493                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    5494              
    5495              $C$DW$738       .dwtag  DW_TAG_member
    5496                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$43)
    5497                      .dwattr $C$DW$738, DW_AT_name("clarkeHandle_V")
    5498                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_clarkeHandle_V")
    5499                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5500                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    5501              
    5502              $C$DW$739       .dwtag  DW_TAG_member
    5503                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$44)
    5504                      .dwattr $C$DW$739, DW_AT_name("clarke_V")
    5505                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_clarke_V")
    5506                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5507                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    5508              
    5509              $C$DW$740       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  106

    5510                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$46)
    5511                      .dwattr $C$DW$740, DW_AT_name("estHandle")
    5512                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_estHandle")
    5513                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5514                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    5515              
    5516              $C$DW$741       .dwtag  DW_TAG_member
    5517                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$48)
    5518                      .dwattr $C$DW$741, DW_AT_name("parkHandle")
    5519                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_parkHandle")
    5520                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5521                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    5522              
    5523              $C$DW$742       .dwtag  DW_TAG_member
    5524                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$49)
    5525                      .dwattr $C$DW$742, DW_AT_name("park")
    5526                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_park")
    5527                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5528                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    5529              
    5530              $C$DW$743       .dwtag  DW_TAG_member
    5531                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$51)
    5532                      .dwattr $C$DW$743, DW_AT_name("pidHandle_Id")
    5533                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_pidHandle_Id")
    5534                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5535                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    5536              
    5537              $C$DW$744       .dwtag  DW_TAG_member
    5538                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$52)
    5539                      .dwattr $C$DW$744, DW_AT_name("pid_Id")
    5540                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_pid_Id")
    5541                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5542                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    5543              
    5544              $C$DW$745       .dwtag  DW_TAG_member
    5545                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$51)
    5546                      .dwattr $C$DW$745, DW_AT_name("pidHandle_Iq")
    5547                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_pidHandle_Iq")
    5548                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    5549                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    5550              
    5551              $C$DW$746       .dwtag  DW_TAG_member
    5552                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$52)
    5553                      .dwattr $C$DW$746, DW_AT_name("pid_Iq")
    5554                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_pid_Iq")
    5555                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5556                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    5557              
    5558              $C$DW$747       .dwtag  DW_TAG_member
    5559                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$51)
    5560                      .dwattr $C$DW$747, DW_AT_name("pidHandle_spd")
    5561                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_pidHandle_spd")
    5562                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5563                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    5564              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  107

    5565              $C$DW$748       .dwtag  DW_TAG_member
    5566                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$52)
    5567                      .dwattr $C$DW$748, DW_AT_name("pid_spd")
    5568                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_pid_spd")
    5569                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5570                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    5571              
    5572              $C$DW$749       .dwtag  DW_TAG_member
    5573                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$54)
    5574                      .dwattr $C$DW$749, DW_AT_name("iparkHandle")
    5575                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_iparkHandle")
    5576                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    5577                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    5578              
    5579              $C$DW$750       .dwtag  DW_TAG_member
    5580                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$55)
    5581                      .dwattr $C$DW$750, DW_AT_name("ipark")
    5582                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_ipark")
    5583                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5584                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    5585              
    5586              $C$DW$751       .dwtag  DW_TAG_member
    5587                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$57)
    5588                      .dwattr $C$DW$751, DW_AT_name("svgenHandle")
    5589                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_svgenHandle")
    5590                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5591                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    5592              
    5593              $C$DW$752       .dwtag  DW_TAG_member
    5594                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$58)
    5595                      .dwattr $C$DW$752, DW_AT_name("svgen")
    5596                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_svgen")
    5597                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5598                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    5599              
    5600              $C$DW$753       .dwtag  DW_TAG_member
    5601                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$60)
    5602                      .dwattr $C$DW$753, DW_AT_name("trajHandle_Id")
    5603                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_trajHandle_Id")
    5604                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5605                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    5606              
    5607              $C$DW$754       .dwtag  DW_TAG_member
    5608                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$61)
    5609                      .dwattr $C$DW$754, DW_AT_name("traj_Id")
    5610                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_traj_Id")
    5611                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    5612                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    5613              
    5614              $C$DW$755       .dwtag  DW_TAG_member
    5615                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$60)
    5616                      .dwattr $C$DW$755, DW_AT_name("trajHandle_spd")
    5617                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_trajHandle_spd")
    5618                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    5619                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  108

    5620              
    5621              $C$DW$756       .dwtag  DW_TAG_member
    5622                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$61)
    5623                      .dwattr $C$DW$756, DW_AT_name("traj_spd")
    5624                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_traj_spd")
    5625                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    5626                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    5627              
    5628              $C$DW$757       .dwtag  DW_TAG_member
    5629                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$60)
    5630                      .dwattr $C$DW$757, DW_AT_name("trajHandle_spdMax")
    5631                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    5632                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5633                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    5634              
    5635              $C$DW$758       .dwtag  DW_TAG_member
    5636                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$61)
    5637                      .dwattr $C$DW$758, DW_AT_name("traj_spdMax")
    5638                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_traj_spdMax")
    5639                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    5640                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    5641              
    5642              $C$DW$759       .dwtag  DW_TAG_member
    5643                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$62)
    5644                      .dwattr $C$DW$759, DW_AT_name("motorParams")
    5645                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_motorParams")
    5646                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    5647                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    5648              
    5649              $C$DW$760       .dwtag  DW_TAG_member
    5650                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$65)
    5651                      .dwattr $C$DW$760, DW_AT_name("waitTimes")
    5652                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_waitTimes")
    5653                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    5654                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    5655              
    5656              $C$DW$761       .dwtag  DW_TAG_member
    5657                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$64)
    5658                      .dwattr $C$DW$761, DW_AT_name("counter_state")
    5659                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_counter_state")
    5660                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    5661                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    5662              
    5663              $C$DW$762       .dwtag  DW_TAG_member
    5664                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$66)
    5665                      .dwattr $C$DW$762, DW_AT_name("numIsrTicksPerCtrlTick")
    5666                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    5667                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    5668                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    5669              
    5670              $C$DW$763       .dwtag  DW_TAG_member
    5671                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$66)
    5672                      .dwattr $C$DW$763, DW_AT_name("numCtrlTicksPerCurrentTick")
    5673                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    5674                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  109

    5675                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    5676              
    5677              $C$DW$764       .dwtag  DW_TAG_member
    5678                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$66)
    5679                      .dwattr $C$DW$764, DW_AT_name("numCtrlTicksPerSpeedTick")
    5680                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    5681                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    5682                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    5683              
    5684              $C$DW$765       .dwtag  DW_TAG_member
    5685                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$66)
    5686                      .dwattr $C$DW$765, DW_AT_name("numCtrlTicksPerTrajTick")
    5687                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    5688                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    5689                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    5690              
    5691              $C$DW$766       .dwtag  DW_TAG_member
    5692                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$64)
    5693                      .dwattr $C$DW$766, DW_AT_name("ctrlFreq_Hz")
    5694                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    5695                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    5696                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    5697              
    5698              $C$DW$767       .dwtag  DW_TAG_member
    5699                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$64)
    5700                      .dwattr $C$DW$767, DW_AT_name("trajFreq_Hz")
    5701                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_trajFreq_Hz")
    5702                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    5703                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    5704              
    5705              $C$DW$768       .dwtag  DW_TAG_member
    5706                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$31)
    5707                      .dwattr $C$DW$768, DW_AT_name("trajPeriod_sec")
    5708                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_trajPeriod_sec")
    5709                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    5710                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    5711              
    5712              $C$DW$769       .dwtag  DW_TAG_member
    5713                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$67)
    5714                      .dwattr $C$DW$769, DW_AT_name("ctrlPeriod_sec")
    5715                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    5716                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    5717                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    5718              
    5719              $C$DW$770       .dwtag  DW_TAG_member
    5720                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$31)
    5721                      .dwattr $C$DW$770, DW_AT_name("maxVsMag_pu")
    5722                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_maxVsMag_pu")
    5723                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    5724                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    5725              
    5726              $C$DW$771       .dwtag  DW_TAG_member
    5727                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$68)
    5728                      .dwattr $C$DW$771, DW_AT_name("Iab_in")
    5729                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Iab_in")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  110

    5730                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    5731                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    5732              
    5733              $C$DW$772       .dwtag  DW_TAG_member
    5734                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$68)
    5735                      .dwattr $C$DW$772, DW_AT_name("Iab_filt")
    5736                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_Iab_filt")
    5737                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    5738                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    5739              
    5740              $C$DW$773       .dwtag  DW_TAG_member
    5741                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$68)
    5742                      .dwattr $C$DW$773, DW_AT_name("Idq_in")
    5743                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Idq_in")
    5744                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    5745                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    5746              
    5747              $C$DW$774       .dwtag  DW_TAG_member
    5748                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$68)
    5749                      .dwattr $C$DW$774, DW_AT_name("Vab_in")
    5750                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_Vab_in")
    5751                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    5752                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    5753              
    5754              $C$DW$775       .dwtag  DW_TAG_member
    5755                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$31)
    5756                      .dwattr $C$DW$775, DW_AT_name("spd_out")
    5757                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_spd_out")
    5758                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    5759                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    5760              
    5761              $C$DW$776       .dwtag  DW_TAG_member
    5762                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$68)
    5763                      .dwattr $C$DW$776, DW_AT_name("Vab_out")
    5764                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Vab_out")
    5765                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    5766                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    5767              
    5768              $C$DW$777       .dwtag  DW_TAG_member
    5769                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$68)
    5770                      .dwattr $C$DW$777, DW_AT_name("Vdq_out")
    5771                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Vdq_out")
    5772                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    5773                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    5774              
    5775              $C$DW$778       .dwtag  DW_TAG_member
    5776                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$67)
    5777                      .dwattr $C$DW$778, DW_AT_name("Rhf")
    5778                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Rhf")
    5779                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    5780                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    5781              
    5782              $C$DW$779       .dwtag  DW_TAG_member
    5783                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$67)
    5784                      .dwattr $C$DW$779, DW_AT_name("Lhf")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  111

    5785                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_Lhf")
    5786                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    5787                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    5788              
    5789              $C$DW$780       .dwtag  DW_TAG_member
    5790                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$67)
    5791                      .dwattr $C$DW$780, DW_AT_name("RoverL")
    5792                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_RoverL")
    5793                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    5794                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    5795              
    5796              $C$DW$781       .dwtag  DW_TAG_member
    5797                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$31)
    5798                      .dwattr $C$DW$781, DW_AT_name("Kp_Id")
    5799                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Kp_Id")
    5800                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    5801                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    5802              
    5803              $C$DW$782       .dwtag  DW_TAG_member
    5804                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$31)
    5805                      .dwattr $C$DW$782, DW_AT_name("Kp_Iq")
    5806                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_Kp_Iq")
    5807                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    5808                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    5809              
    5810              $C$DW$783       .dwtag  DW_TAG_member
    5811                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$31)
    5812                      .dwattr $C$DW$783, DW_AT_name("Kp_spd")
    5813                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_Kp_spd")
    5814                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    5815                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    5816              
    5817              $C$DW$784       .dwtag  DW_TAG_member
    5818                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$31)
    5819                      .dwattr $C$DW$784, DW_AT_name("Ki_Id")
    5820                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_Ki_Id")
    5821                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    5822                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    5823              
    5824              $C$DW$785       .dwtag  DW_TAG_member
    5825                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$31)
    5826                      .dwattr $C$DW$785, DW_AT_name("Ki_Iq")
    5827                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_Ki_Iq")
    5828                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    5829                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    5830              
    5831              $C$DW$786       .dwtag  DW_TAG_member
    5832                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$31)
    5833                      .dwattr $C$DW$786, DW_AT_name("Ki_spd")
    5834                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_Ki_spd")
    5835                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    5836                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    5837              
    5838              $C$DW$787       .dwtag  DW_TAG_member
    5839                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  112

    5840                      .dwattr $C$DW$787, DW_AT_name("Kd_Id")
    5841                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_Kd_Id")
    5842                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    5843                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    5844              
    5845              $C$DW$788       .dwtag  DW_TAG_member
    5846                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$31)
    5847                      .dwattr $C$DW$788, DW_AT_name("Kd_Iq")
    5848                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_Kd_Iq")
    5849                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    5850                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    5851              
    5852              $C$DW$789       .dwtag  DW_TAG_member
    5853                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$31)
    5854                      .dwattr $C$DW$789, DW_AT_name("Kd_spd")
    5855                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_Kd_spd")
    5856                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    5857                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    5858              
    5859              $C$DW$790       .dwtag  DW_TAG_member
    5860                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$31)
    5861                      .dwattr $C$DW$790, DW_AT_name("Ui_Id")
    5862                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_Ui_Id")
    5863                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    5864                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    5865              
    5866              $C$DW$791       .dwtag  DW_TAG_member
    5867                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$31)
    5868                      .dwattr $C$DW$791, DW_AT_name("Ui_Iq")
    5869                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_Ui_Iq")
    5870                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    5871                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    5872              
    5873              $C$DW$792       .dwtag  DW_TAG_member
    5874                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$31)
    5875                      .dwattr $C$DW$792, DW_AT_name("Ui_spd")
    5876                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_Ui_spd")
    5877                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    5878                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    5879              
    5880              $C$DW$793       .dwtag  DW_TAG_member
    5881                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$68)
    5882                      .dwattr $C$DW$793, DW_AT_name("Idq_ref")
    5883                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_Idq_ref")
    5884                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    5885                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    5886              
    5887              $C$DW$794       .dwtag  DW_TAG_member
    5888                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$31)
    5889                      .dwattr $C$DW$794, DW_AT_name("IdRated")
    5890                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_IdRated")
    5891                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    5892                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    5893              
    5894              $C$DW$795       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  113

    5895                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$31)
    5896                      .dwattr $C$DW$795, DW_AT_name("spd_ref")
    5897                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_spd_ref")
    5898                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    5899                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    5900              
    5901              $C$DW$796       .dwtag  DW_TAG_member
    5902                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$31)
    5903                      .dwattr $C$DW$796, DW_AT_name("spd_max")
    5904                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_spd_max")
    5905                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    5906                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    5907              
    5908              $C$DW$797       .dwtag  DW_TAG_member
    5909                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$66)
    5910                      .dwattr $C$DW$797, DW_AT_name("counter_current")
    5911                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_counter_current")
    5912                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    5913                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    5914              
    5915              $C$DW$798       .dwtag  DW_TAG_member
    5916                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$66)
    5917                      .dwattr $C$DW$798, DW_AT_name("counter_isr")
    5918                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_counter_isr")
    5919                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    5920                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    5921              
    5922              $C$DW$799       .dwtag  DW_TAG_member
    5923                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$66)
    5924                      .dwattr $C$DW$799, DW_AT_name("counter_speed")
    5925                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_counter_speed")
    5926                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    5927                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    5928              
    5929              $C$DW$800       .dwtag  DW_TAG_member
    5930                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$66)
    5931                      .dwattr $C$DW$800, DW_AT_name("counter_traj")
    5932                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_counter_traj")
    5933                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    5934                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    5935              
    5936              $C$DW$801       .dwtag  DW_TAG_member
    5937                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$69)
    5938                      .dwattr $C$DW$801, DW_AT_name("flag_enableCtrl")
    5939                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_flag_enableCtrl")
    5940                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    5941                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    5942              
    5943              $C$DW$802       .dwtag  DW_TAG_member
    5944                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$69)
    5945                      .dwattr $C$DW$802, DW_AT_name("flag_enableDcBusComp")
    5946                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    5947                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    5948                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    5949              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  114

    5950              $C$DW$803       .dwtag  DW_TAG_member
    5951                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$69)
    5952                      .dwattr $C$DW$803, DW_AT_name("flag_enablePowerWarp")
    5953                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    5954                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    5955                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    5956              
    5957              $C$DW$804       .dwtag  DW_TAG_member
    5958                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$69)
    5959                      .dwattr $C$DW$804, DW_AT_name("flag_enableOffset")
    5960                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_flag_enableOffset")
    5961                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    5962                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    5963              
    5964              $C$DW$805       .dwtag  DW_TAG_member
    5965                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$69)
    5966                      .dwattr $C$DW$805, DW_AT_name("flag_enableSpeedCtrl")
    5967                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    5968                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    5969                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    5970              
    5971              $C$DW$806       .dwtag  DW_TAG_member
    5972                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$69)
    5973                      .dwattr $C$DW$806, DW_AT_name("flag_enableUserMotorParams")
    5974                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    5975                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    5976                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    5977              
    5978              $C$DW$807       .dwtag  DW_TAG_member
    5979                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$68)
    5980                      .dwattr $C$DW$807, DW_AT_name("Idq_offset_pu")
    5981                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_Idq_offset_pu")
    5982                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    5983                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    5984              
    5985              $C$DW$808       .dwtag  DW_TAG_member
    5986                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$68)
    5987                      .dwattr $C$DW$808, DW_AT_name("Vdq_offset_pu")
    5988                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    5989                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    5990                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    5991              
    5992              $C$DW$809       .dwtag  DW_TAG_member
    5993                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$31)
    5994                      .dwattr $C$DW$809, DW_AT_name("angle_pu")
    5995                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_angle_pu")
    5996                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    5997                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    5998              
    5999              $C$DW$810       .dwtag  DW_TAG_member
    6000                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$31)
    6001                      .dwattr $C$DW$810, DW_AT_name("speed_ref_pu")
    6002                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_speed_ref_pu")
    6003                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    6004                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  115

    6005              
    6006              $C$DW$811       .dwtag  DW_TAG_member
    6007                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$31)
    6008                      .dwattr $C$DW$811, DW_AT_name("speed_fb_pu")
    6009                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_speed_fb_pu")
    6010                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    6011                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    6012              
    6013              $C$DW$812       .dwtag  DW_TAG_member
    6014                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$31)
    6015                      .dwattr $C$DW$812, DW_AT_name("speed_outMax_pu")
    6016                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_speed_outMax_pu")
    6017                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    6018                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    6019              
    6020              $C$DW$813       .dwtag  DW_TAG_member
    6021                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$69)
    6022                      .dwattr $C$DW$813, DW_AT_name("flag_enableCurrentCtrl")
    6023                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    6024                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    6025                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    6026              
    6027                      .dwendtag $C$DW$T$70
    6028              
    6029              $C$DW$T$264     .dwtag  DW_TAG_typedef
    6030                      .dwattr $C$DW$T$264, DW_AT_name("CTRL_Obj")
    6031                      .dwattr $C$DW$T$264, DW_AT_type(*$C$DW$T$70)
    6032                      .dwattr $C$DW$T$264, DW_AT_language(DW_LANG_C)
    6033              
    6034              $C$DW$T$265     .dwtag  DW_TAG_pointer_type
    6035                      .dwattr $C$DW$T$265, DW_AT_type(*$C$DW$T$264)
    6036                      .dwattr $C$DW$T$265, DW_AT_address_class(0x20)
    6037              
    6038              $C$DW$T$236     .dwtag  DW_TAG_pointer_type
    6039                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$70)
    6040                      .dwattr $C$DW$T$236, DW_AT_address_class(0x20)
    6041              
    6042              $C$DW$T$237     .dwtag  DW_TAG_typedef
    6043                      .dwattr $C$DW$T$237, DW_AT_name("CTRL_Handle")
    6044                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
    6045                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
    6046              
    6047              $C$DW$814       .dwtag  DW_TAG_TI_far_type
    6048                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$237)
    6049              
    6050              $C$DW$T$266     .dwtag  DW_TAG_const_type
    6051                      .dwattr $C$DW$T$266, DW_AT_type(*$C$DW$814)
    6052              
    6053              
    6054              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    6055                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
    6056                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
    6057              $C$DW$815       .dwtag  DW_TAG_member
    6058                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$22)
    6059                      .dwattr $C$DW$815, DW_AT_name("rsvd")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  116

    6060                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_rsvd")
    6061                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6062                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    6063              
    6064              $C$DW$816       .dwtag  DW_TAG_member
    6065                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$72)
    6066                      .dwattr $C$DW$816, DW_AT_name("targetProc")
    6067                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_targetProc")
    6068                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6069                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    6070              
    6071              $C$DW$817       .dwtag  DW_TAG_member
    6072                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$22)
    6073                      .dwattr $C$DW$817, DW_AT_name("major")
    6074                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_major")
    6075                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6076                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    6077              
    6078              $C$DW$818       .dwtag  DW_TAG_member
    6079                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$22)
    6080                      .dwattr $C$DW$818, DW_AT_name("minor")
    6081                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_minor")
    6082                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6083                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    6084              
    6085                      .dwendtag $C$DW$T$73
    6086              
    6087              $C$DW$T$37      .dwtag  DW_TAG_typedef
    6088                      .dwattr $C$DW$T$37, DW_AT_name("CTRL_Version")
    6089                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
    6090                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    6091              
    6092              $C$DW$T$274     .dwtag  DW_TAG_pointer_type
    6093                      .dwattr $C$DW$T$274, DW_AT_type(*$C$DW$T$37)
    6094                      .dwattr $C$DW$T$274, DW_AT_address_class(0x20)
    6095              
    6096              
    6097              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    6098                      .dwattr $C$DW$T$80, DW_AT_name("_DRV8305_Obj_")
    6099                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    6100              $C$DW$819       .dwtag  DW_TAG_member
    6101                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$75)
    6102                      .dwattr $C$DW$819, DW_AT_name("spiHandle")
    6103                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_spiHandle")
    6104                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6105                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    6106              
    6107              $C$DW$820       .dwtag  DW_TAG_member
    6108                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$77)
    6109                      .dwattr $C$DW$820, DW_AT_name("gpioHandle")
    6110                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_gpioHandle")
    6111                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6112                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    6113              
    6114              $C$DW$821       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  117

    6115                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$79)
    6116                      .dwattr $C$DW$821, DW_AT_name("gpioNumber")
    6117                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_gpioNumber")
    6118                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6119                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    6120              
    6121              $C$DW$822       .dwtag  DW_TAG_member
    6122                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$69)
    6123                      .dwattr $C$DW$822, DW_AT_name("RxTimeOut")
    6124                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_RxTimeOut")
    6125                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6126                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    6127              
    6128              $C$DW$823       .dwtag  DW_TAG_member
    6129                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$69)
    6130                      .dwattr $C$DW$823, DW_AT_name("enableTimeOut")
    6131                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_enableTimeOut")
    6132                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6133                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    6134              
    6135                      .dwendtag $C$DW$T$80
    6136              
    6137              $C$DW$T$189     .dwtag  DW_TAG_typedef
    6138                      .dwattr $C$DW$T$189, DW_AT_name("DRV8305_Obj")
    6139                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$80)
    6140                      .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    6141              
    6142              $C$DW$T$187     .dwtag  DW_TAG_pointer_type
    6143                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$80)
    6144                      .dwattr $C$DW$T$187, DW_AT_address_class(0x20)
    6145              
    6146              $C$DW$T$188     .dwtag  DW_TAG_typedef
    6147                      .dwattr $C$DW$T$188, DW_AT_name("DRV8305_Handle")
    6148                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$187)
    6149                      .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    6150              
    6151              
    6152              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    6153                      .dwattr $C$DW$T$87, DW_AT_name("_DRV_SPI_8305_Ctrl05_t_")
    6154                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x04)
    6155              $C$DW$824       .dwtag  DW_TAG_member
    6156                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$82)
    6157                      .dwattr $C$DW$824, DW_AT_name("IDRIVEP_HS")
    6158                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_IDRIVEP_HS")
    6159                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6160                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    6161              
    6162              $C$DW$825       .dwtag  DW_TAG_member
    6163                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$84)
    6164                      .dwattr $C$DW$825, DW_AT_name("IDRIVEN_HS")
    6165                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_IDRIVEN_HS")
    6166                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6167                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    6168              
    6169              $C$DW$826       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  118

    6170                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$86)
    6171                      .dwattr $C$DW$826, DW_AT_name("TDRIVEN")
    6172                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_TDRIVEN")
    6173                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6174                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    6175              
    6176              $C$DW$827       .dwtag  DW_TAG_member
    6177                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$69)
    6178                      .dwattr $C$DW$827, DW_AT_name("CTRL05_RSV1")
    6179                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_CTRL05_RSV1")
    6180                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6181                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    6182              
    6183                      .dwendtag $C$DW$T$87
    6184              
    6185              $C$DW$T$139     .dwtag  DW_TAG_typedef
    6186                      .dwattr $C$DW$T$139, DW_AT_name("DRV_SPI_8305_Ctrl05_t_")
    6187                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$87)
    6188                      .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    6189              
    6190              
    6191              $C$DW$T$94      .dwtag  DW_TAG_structure_type
    6192                      .dwattr $C$DW$T$94, DW_AT_name("_DRV_SPI_8305_Ctrl06_t_")
    6193                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x04)
    6194              $C$DW$828       .dwtag  DW_TAG_member
    6195                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$89)
    6196                      .dwattr $C$DW$828, DW_AT_name("IDRIVEP_LS")
    6197                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_IDRIVEP_LS")
    6198                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6199                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    6200              
    6201              $C$DW$829       .dwtag  DW_TAG_member
    6202                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$91)
    6203                      .dwattr $C$DW$829, DW_AT_name("IDRIVEN_LS")
    6204                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_IDRIVEN_LS")
    6205                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6206                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    6207              
    6208              $C$DW$830       .dwtag  DW_TAG_member
    6209                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$93)
    6210                      .dwattr $C$DW$830, DW_AT_name("TDRIVEP")
    6211                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_TDRIVEP")
    6212                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6213                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    6214              
    6215              $C$DW$831       .dwtag  DW_TAG_member
    6216                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$69)
    6217                      .dwattr $C$DW$831, DW_AT_name("CTRL06_RSV1")
    6218                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_CTRL06_RSV1")
    6219                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6220                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    6221              
    6222                      .dwendtag $C$DW$T$94
    6223              
    6224              $C$DW$T$140     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  119

    6225                      .dwattr $C$DW$T$140, DW_AT_name("DRV_SPI_8305_Ctrl06_t_")
    6226                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$94)
    6227                      .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    6228              
    6229              
    6230              $C$DW$T$105     .dwtag  DW_TAG_structure_type
    6231                      .dwattr $C$DW$T$105, DW_AT_name("_DRV_SPI_8305_Ctrl07_t_")
    6232                      .dwattr $C$DW$T$105, DW_AT_byte_size(0x06)
    6233              $C$DW$832       .dwtag  DW_TAG_member
    6234                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$96)
    6235                      .dwattr $C$DW$832, DW_AT_name("TVDS")
    6236                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_TVDS")
    6237                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6238                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    6239              
    6240              $C$DW$833       .dwtag  DW_TAG_member
    6241                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$98)
    6242                      .dwattr $C$DW$833, DW_AT_name("TBLANK")
    6243                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_TBLANK")
    6244                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6245                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    6246              
    6247              $C$DW$834       .dwtag  DW_TAG_member
    6248                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$100)
    6249                      .dwattr $C$DW$834, DW_AT_name("DEAD_TIME")
    6250                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_DEAD_TIME")
    6251                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6252                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    6253              
    6254              $C$DW$835       .dwtag  DW_TAG_member
    6255                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$102)
    6256                      .dwattr $C$DW$835, DW_AT_name("PWM_MODE")
    6257                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_PWM_MODE")
    6258                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6259                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    6260              
    6261              $C$DW$836       .dwtag  DW_TAG_member
    6262                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$104)
    6263                      .dwattr $C$DW$836, DW_AT_name("COMM_OPT")
    6264                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_COMM_OPT")
    6265                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6266                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    6267              
    6268              $C$DW$837       .dwtag  DW_TAG_member
    6269                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$69)
    6270                      .dwattr $C$DW$837, DW_AT_name("CTRL07_RSV1")
    6271                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_CTRL07_RSV1")
    6272                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6273                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    6274              
    6275                      .dwendtag $C$DW$T$105
    6276              
    6277              $C$DW$T$141     .dwtag  DW_TAG_typedef
    6278                      .dwattr $C$DW$T$141, DW_AT_name("DRV_SPI_8305_Ctrl07_t_")
    6279                      .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$105)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{81472915-7FA4-430D-8ACB-BFB8F401620C} PAGE  120

    6280                      .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    6281              
    6282              
    6283              $C$DW$T$106     .dwtag  DW_TAG_structure_type
    6284                      .dwattr $C$DW$T$106, DW_AT_name("_DRV_SPI_8305_Ctrl08_t_")
    6285                      .dwattr $C$DW$T$106, DW_AT_byte_size(0x01)
    6286              $C$DW$838       .dwtag  DW_TAG_member
    6287                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$22)
    6288                      .dwattr $C$DW$838, DW_AT_name("CTRL08_RSV1")
    6289                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_CTRL08_RSV1")
    6290                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6291                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    6292              
    6293                      .dwendtag $C$DW$T$106
    6294              
    6295              $C$DW$T$142     .dwtag  DW_TAG_typedef
    6296                      .dwattr $C$DW$T$142, DW_AT_name("DRV_SPI_8305_Ctrl08_t_")
    6297                      .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$106)
    6298                      .dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
    6299              
    6300              
    6301              $C$DW$T$109     .dwtag  DW_TAG_structure_type
    6302                      .dwattr $C$DW$T$109, DW_AT_name("_DRV_SPI_8305_Ctrl09_t_")
    6303                      .dwattr $C$DW$T$109, DW_AT_byte_size(0x0a)
    6304              $C$DW$839       .dwtag  DW_TAG_member
    6305                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$69)
    6306                      .dwattr $C$DW$839, DW_AT_name("SET_VCPH_UV")
    6307                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_SET_VCPH_UV")
    6308                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6309                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    6310              
    6311              $C$DW$840       .dwtag  DW_TAG_member
    6312                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$69)
    6313                      .dwattr $C$DW$840, DW_AT_name("CLR_FLTS")
    6314                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_CLR_FLTS")
    6315                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6316                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    6317              
    6318              $C$DW$841       .dwtag  DW_TAG_member
    6319                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$69)
    6320                      .dwattr $C$DW$841, DW_AT_name("SLEEP")
    6321                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_SLEEP")
    6322                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6323                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    6324              
    6325              $C$DW$842       .dwtag  DW_TAG_member
    6326                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$69)
    6327                      .dwattr $C$DW$842, DW_AT_name("WD_EN")
    6328                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_WD_EN")
    6329                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6330                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    6331              
    6332              $C$DW$843       .dwtag  DW_TAG_member
    6333                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$69)
