TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{2610D5B4-5CBC-4747-A1C3-229C8FD63D4F} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Sun Jun 17 14:52:33 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/drivers/pwm/src/32b/f28x/f2802x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;       D:\ti\ccsv8\tools\compiler\ti-cgt-c2000_18.1.2.LTS\bin\opt2000.exe C:\\Users\\haowp\\AppData\\Local\\

    8667                      .dwendtag $C$DW$T$117
    8668              
    8669              $C$DW$T$118     .dwtag  DW_TAG_typedef
    8670                      .dwattr $C$DW$T$118, DW_AT_name("PWM_SyncMode_e")
    8671                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    8672                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    8673              
    8674              $C$DW$754       .dwtag  DW_TAG_TI_far_type
    8675                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$118)
    8676              
    8677              $C$DW$T$119     .dwtag  DW_TAG_const_type
    8678                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$754)
    8679              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{2610D5B4-5CBC-4747-A1C3-229C8FD63D4F} PAGE  161

    8680              
    8681              $C$DW$T$120     .dwtag  DW_TAG_enumeration_type
    8682                      .dwattr $C$DW$T$120, DW_AT_byte_size(0x01)
    8683              $C$DW$755       .dwtag  DW_TAG_enumerator
    8684                      .dwattr $C$DW$755, DW_AT_name("PWM_TripZoneDCEventSel_Disabled")
    8685                      .dwattr $C$DW$755, DW_AT_const_value(0x00)
    8686              
    8687              $C$DW$756       .dwtag  DW_TAG_enumerator
    8688                      .dwattr $C$DW$756, DW_AT_name("PWM_TripZoneDCEventSel_DCxHL_DCxLX")
    8689                      .dwattr $C$DW$756, DW_AT_const_value(0x01)
    8690              
    8691              $C$DW$757       .dwtag  DW_TAG_enumerator
    8692                      .dwattr $C$DW$757, DW_AT_name("PWM_TripZoneDCEventSel_DCxHH_DCxLX")
    8693                      .dwattr $C$DW$757, DW_AT_const_value(0x02)
    8694              
    8695              $C$DW$758       .dwtag  DW_TAG_enumerator
    8696                      .dwattr $C$DW$758, DW_AT_name("PWM_TripZoneDCEventSel_DCxHx_DCxLL")
    8697                      .dwattr $C$DW$758, DW_AT_const_value(0x03)
    8698              
    8699              $C$DW$759       .dwtag  DW_TAG_enumerator
    8700                      .dwattr $C$DW$759, DW_AT_name("PWM_TripZoneDCEventSel_DCxHx_DCxLH")
    8701                      .dwattr $C$DW$759, DW_AT_const_value(0x04)
    8702              
    8703              $C$DW$760       .dwtag  DW_TAG_enumerator
    8704                      .dwattr $C$DW$760, DW_AT_name("PWM_TripZoneDCEventSel_DCxHL_DCxLH")
    8705                      .dwattr $C$DW$760, DW_AT_const_value(0x05)
    8706              
    8707                      .dwendtag $C$DW$T$120
    8708              
    8709              $C$DW$T$121     .dwtag  DW_TAG_typedef
    8710                      .dwattr $C$DW$T$121, DW_AT_name("PWM_TripZoneDCEventSel_e")
    8711                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    8712                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    8713              
    8714              $C$DW$761       .dwtag  DW_TAG_TI_far_type
    8715                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$121)
    8716              
    8717              $C$DW$T$122     .dwtag  DW_TAG_const_type
    8718                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$761)
    8719              
    8720              
    8721              $C$DW$T$123     .dwtag  DW_TAG_enumeration_type
    8722                      .dwattr $C$DW$T$123, DW_AT_byte_size(0x01)
    8723              $C$DW$762       .dwtag  DW_TAG_enumerator
    8724                      .dwattr $C$DW$762, DW_AT_name("PWM_TripZoneState_HighImp")
    8725                      .dwattr $C$DW$762, DW_AT_const_value(0x00)
    8726              
    8727              $C$DW$763       .dwtag  DW_TAG_enumerator
    8728                      .dwattr $C$DW$763, DW_AT_name("PWM_TripZoneState_EPWM_High")
    8729                      .dwattr $C$DW$763, DW_AT_const_value(0x01)
    8730              
    8731              $C$DW$764       .dwtag  DW_TAG_enumerator
    8732                      .dwattr $C$DW$764, DW_AT_name("PWM_TripZoneState_EPWM_Low")
    8733                      .dwattr $C$DW$764, DW_AT_const_value(0x02)
    8734              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{2610D5B4-5CBC-4747-A1C3-229C8FD63D4F} PAGE  162

    8735              $C$DW$765       .dwtag  DW_TAG_enumerator
    8736                      .dwattr $C$DW$765, DW_AT_name("PWM_TripZoneState_DoNothing")
    8737                      .dwattr $C$DW$765, DW_AT_const_value(0x03)
    8738              
    8739                      .dwendtag $C$DW$T$123
    8740              
    8741              $C$DW$T$124     .dwtag  DW_TAG_typedef
    8742                      .dwattr $C$DW$T$124, DW_AT_name("PWM_TripZoneState_e")
    8743                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
    8744                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    8745              
    8746              $C$DW$766       .dwtag  DW_TAG_TI_far_type
    8747                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$124)
    8748              
    8749              $C$DW$T$125     .dwtag  DW_TAG_const_type
    8750                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$766)
    8751              
    8752              
    8753              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    8754                      .dwattr $C$DW$T$23, DW_AT_name("_PWM_Obj_")
    8755                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x3a)
    8756              $C$DW$767       .dwtag  DW_TAG_member
    8757                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$20)
    8758                      .dwattr $C$DW$767, DW_AT_name("TBCTL")
    8759                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_TBCTL")
    8760                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8761                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    8762              
    8763              $C$DW$768       .dwtag  DW_TAG_member
    8764                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$20)
    8765                      .dwattr $C$DW$768, DW_AT_name("TBSTS")
    8766                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_TBSTS")
    8767                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8768                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    8769              
    8770              $C$DW$769       .dwtag  DW_TAG_member
    8771                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$20)
    8772                      .dwattr $C$DW$769, DW_AT_name("TBPHSHR")
    8773                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_TBPHSHR")
    8774                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8775                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    8776              
    8777              $C$DW$770       .dwtag  DW_TAG_member
    8778                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$20)
    8779                      .dwattr $C$DW$770, DW_AT_name("TBPHS")
    8780                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_TBPHS")
    8781                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8782                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    8783              
    8784              $C$DW$771       .dwtag  DW_TAG_member
    8785                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$20)
    8786                      .dwattr $C$DW$771, DW_AT_name("TBCTR")
    8787                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_TBCTR")
    8788                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8789                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{2610D5B4-5CBC-4747-A1C3-229C8FD63D4F} PAGE  163

    8790              
    8791              $C$DW$772       .dwtag  DW_TAG_member
    8792                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$20)
    8793                      .dwattr $C$DW$772, DW_AT_name("TBPRD")
    8794                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_TBPRD")
    8795                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8796                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    8797              
    8798              $C$DW$773       .dwtag  DW_TAG_member
    8799                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$20)
    8800                      .dwattr $C$DW$773, DW_AT_name("TBPRDHR")
    8801                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_TBPRDHR")
    8802                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8803                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    8804              
    8805              $C$DW$774       .dwtag  DW_TAG_member
    8806                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$20)
    8807                      .dwattr $C$DW$774, DW_AT_name("CMPCTL")
    8808                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_CMPCTL")
    8809                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8810                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    8811              
    8812              $C$DW$775       .dwtag  DW_TAG_member
    8813                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$20)
    8814                      .dwattr $C$DW$775, DW_AT_name("CMPAHR")
    8815                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_CMPAHR")
    8816                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8817                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    8818              
    8819              $C$DW$776       .dwtag  DW_TAG_member
    8820                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$20)
    8821                      .dwattr $C$DW$776, DW_AT_name("CMPA")
    8822                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_CMPA")
    8823                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8824                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    8825              
    8826              $C$DW$777       .dwtag  DW_TAG_member
    8827                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$20)
    8828                      .dwattr $C$DW$777, DW_AT_name("CMPB")
    8829                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_CMPB")
    8830                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8831                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    8832              
    8833              $C$DW$778       .dwtag  DW_TAG_member
    8834                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$20)
    8835                      .dwattr $C$DW$778, DW_AT_name("AQCTLA")
    8836                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_AQCTLA")
    8837                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8838                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    8839              
    8840              $C$DW$779       .dwtag  DW_TAG_member
    8841                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$20)
    8842                      .dwattr $C$DW$779, DW_AT_name("AQCTLB")
    8843                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_AQCTLB")
    8844                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{2610D5B4-5CBC-4747-A1C3-229C8FD63D4F} PAGE  164

    8845                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    8846              
    8847              $C$DW$780       .dwtag  DW_TAG_member
    8848                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$20)
    8849                      .dwattr $C$DW$780, DW_AT_name("AQSFRC")
    8850                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_AQSFRC")
    8851                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8852                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    8853              
    8854              $C$DW$781       .dwtag  DW_TAG_member
    8855                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$20)
    8856                      .dwattr $C$DW$781, DW_AT_name("AQCSFRC")
    8857                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_AQCSFRC")
    8858                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8859                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    8860              
    8861              $C$DW$782       .dwtag  DW_TAG_member
    8862                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$20)
    8863                      .dwattr $C$DW$782, DW_AT_name("DBCTL")
    8864                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_DBCTL")
    8865                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    8866                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    8867              
    8868              $C$DW$783       .dwtag  DW_TAG_member
    8869                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$20)
    8870                      .dwattr $C$DW$783, DW_AT_name("DBRED")
    8871                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_DBRED")
    8872                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8873                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    8874              
    8875              $C$DW$784       .dwtag  DW_TAG_member
    8876                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$20)
    8877                      .dwattr $C$DW$784, DW_AT_name("DBFED")
    8878                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_DBFED")
    8879                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    8880                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    8881              
    8882              $C$DW$785       .dwtag  DW_TAG_member
    8883                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$20)
    8884                      .dwattr $C$DW$785, DW_AT_name("TZSEL")
    8885                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_TZSEL")
    8886                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8887                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    8888              
    8889              $C$DW$786       .dwtag  DW_TAG_member
    8890                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$20)
    8891                      .dwattr $C$DW$786, DW_AT_name("TZDCSEL")
    8892                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_TZDCSEL")
    8893                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    8894                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    8895              
    8896              $C$DW$787       .dwtag  DW_TAG_member
    8897                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$20)
    8898                      .dwattr $C$DW$787, DW_AT_name("TZCTL")
    8899                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_TZCTL")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{2610D5B4-5CBC-4747-A1C3-229C8FD63D4F} PAGE  165

    8900                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8901                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    8902              
    8903              $C$DW$788       .dwtag  DW_TAG_member
    8904                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$20)
    8905                      .dwattr $C$DW$788, DW_AT_name("TZEINT")
    8906                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_TZEINT")
    8907                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8908                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    8909              
    8910              $C$DW$789       .dwtag  DW_TAG_member
    8911                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$20)
    8912                      .dwattr $C$DW$789, DW_AT_name("TZFLG")
    8913                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_TZFLG")
    8914                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8915                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    8916              
    8917              $C$DW$790       .dwtag  DW_TAG_member
    8918                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$20)
    8919                      .dwattr $C$DW$790, DW_AT_name("TZCLR")
    8920                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_TZCLR")
    8921                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    8922                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    8923              
    8924              $C$DW$791       .dwtag  DW_TAG_member
    8925                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$20)
    8926                      .dwattr $C$DW$791, DW_AT_name("TZFRC")
    8927                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_TZFRC")
    8928                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8929                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    8930              
    8931              $C$DW$792       .dwtag  DW_TAG_member
    8932                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$20)
    8933                      .dwattr $C$DW$792, DW_AT_name("ETSEL")
    8934                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_ETSEL")
    8935                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    8936                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    8937              
    8938              $C$DW$793       .dwtag  DW_TAG_member
    8939                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$20)
    8940                      .dwattr $C$DW$793, DW_AT_name("ETPS")
    8941                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_ETPS")
    8942                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8943                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    8944              
    8945              $C$DW$794       .dwtag  DW_TAG_member
    8946                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$20)
    8947                      .dwattr $C$DW$794, DW_AT_name("ETFLG")
    8948                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_ETFLG")
    8949                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    8950                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    8951              
    8952              $C$DW$795       .dwtag  DW_TAG_member
    8953                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$20)
    8954                      .dwattr $C$DW$795, DW_AT_name("ETCLR")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{2610D5B4-5CBC-4747-A1C3-229C8FD63D4F} PAGE  166

    8955                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_ETCLR")
    8956                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8957                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    8958              
    8959              $C$DW$796       .dwtag  DW_TAG_member
    8960                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$20)
    8961                      .dwattr $C$DW$796, DW_AT_name("ETFRC")
    8962                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_ETFRC")
    8963                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    8964                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    8965              
    8966              $C$DW$797       .dwtag  DW_TAG_member
    8967                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$20)
    8968                      .dwattr $C$DW$797, DW_AT_name("PCCTL")
    8969                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_PCCTL")
    8970                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    8971                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    8972              
    8973              $C$DW$798       .dwtag  DW_TAG_member
    8974                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$20)
    8975                      .dwattr $C$DW$798, DW_AT_name("rsvd_1")
    8976                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_rsvd_1")
    8977                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    8978                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    8979              
    8980              $C$DW$799       .dwtag  DW_TAG_member
    8981                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$20)
    8982                      .dwattr $C$DW$799, DW_AT_name("HRCNFG")
    8983                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_HRCNFG")
    8984                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8985                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    8986              
    8987              $C$DW$800       .dwtag  DW_TAG_member
    8988                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$20)
    8989                      .dwattr $C$DW$800, DW_AT_name("HRPWR")
    8990                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_HRPWR")
    8991                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    8992                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    8993              
    8994              $C$DW$801       .dwtag  DW_TAG_member
    8995                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$21)
    8996                      .dwattr $C$DW$801, DW_AT_name("rsvd_2")
    8997                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_rsvd_2")
    8998                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8999                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    9000              
    9001              $C$DW$802       .dwtag  DW_TAG_member
    9002                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$20)
    9003                      .dwattr $C$DW$802, DW_AT_name("HRMSTEP")
    9004                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_HRMSTEP")
    9005                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    9006                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    9007              
    9008              $C$DW$803       .dwtag  DW_TAG_member
    9009                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{2610D5B4-5CBC-4747-A1C3-229C8FD63D4F} PAGE  167

    9010                      .dwattr $C$DW$803, DW_AT_name("rsvd_3")
    9011                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_rsvd_3")
    9012                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    9013                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    9014              
    9015              $C$DW$804       .dwtag  DW_TAG_member
    9016                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$20)
    9017                      .dwattr $C$DW$804, DW_AT_name("HRPCTL")
    9018                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_HRPCTL")
    9019                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    9020                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    9021              
    9022              $C$DW$805       .dwtag  DW_TAG_member
    9023                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$20)
    9024                      .dwattr $C$DW$805, DW_AT_name("rsvd_4")
    9025                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_rsvd_4")
    9026                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    9027                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    9028              
    9029              $C$DW$806       .dwtag  DW_TAG_member
    9030                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$20)
    9031                      .dwattr $C$DW$806, DW_AT_name("TBPRDHRM")
    9032                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_TBPRDHRM")
    9033                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    9034                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    9035              
    9036              $C$DW$807       .dwtag  DW_TAG_member
    9037                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$20)
    9038                      .dwattr $C$DW$807, DW_AT_name("TBPRDM")
    9039                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_TBPRDM")
    9040                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    9041                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    9042              
    9043              $C$DW$808       .dwtag  DW_TAG_member
    9044                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$20)
    9045                      .dwattr $C$DW$808, DW_AT_name("CMPAHRM")
    9046                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_CMPAHRM")
    9047                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9048                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    9049              
    9050              $C$DW$809       .dwtag  DW_TAG_member
    9051                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$20)
    9052                      .dwattr $C$DW$809, DW_AT_name("CMPAM")
    9053                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_CMPAM")
    9054                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    9055                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    9056              
    9057              $C$DW$810       .dwtag  DW_TAG_member
    9058                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$22)
    9059                      .dwattr $C$DW$810, DW_AT_name("rsvd_5")
    9060                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_rsvd_5")
    9061                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    9062                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    9063              
    9064              $C$DW$811       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{2610D5B4-5CBC-4747-A1C3-229C8FD63D4F} PAGE  168

    9065                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$20)
    9066                      .dwattr $C$DW$811, DW_AT_name("DCTRIPSEL")
    9067                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_DCTRIPSEL")
    9068                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    9069                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    9070              
    9071              $C$DW$812       .dwtag  DW_TAG_member
    9072                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$20)
    9073                      .dwattr $C$DW$812, DW_AT_name("DCACTL")
    9074                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_DCACTL")
    9075                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    9076                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    9077              
    9078              $C$DW$813       .dwtag  DW_TAG_member
    9079                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$20)
    9080                      .dwattr $C$DW$813, DW_AT_name("DCBCTL")
    9081                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_DCBCTL")
    9082                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9083                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    9084              
    9085              $C$DW$814       .dwtag  DW_TAG_member
    9086                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$20)
    9087                      .dwattr $C$DW$814, DW_AT_name("DCFCTL")
    9088                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_DCFCTL")
    9089                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    9090                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    9091              
    9092              $C$DW$815       .dwtag  DW_TAG_member
    9093                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$20)
    9094                      .dwattr $C$DW$815, DW_AT_name("DCCAPCTL")
    9095                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_DCCAPCTL")
    9096                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9097                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    9098              
    9099              $C$DW$816       .dwtag  DW_TAG_member
    9100                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$20)
    9101                      .dwattr $C$DW$816, DW_AT_name("DCFOFFSET")
    9102                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_DCFOFFSET")
    9103                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    9104                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    9105              
    9106              $C$DW$817       .dwtag  DW_TAG_member
    9107                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$20)
    9108                      .dwattr $C$DW$817, DW_AT_name("DCFOFFSETCNT")
    9109                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_DCFOFFSETCNT")
    9110                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    9111                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    9112              
    9113              $C$DW$818       .dwtag  DW_TAG_member
    9114                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$20)
    9115                      .dwattr $C$DW$818, DW_AT_name("DCFWINDOW")
    9116                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_DCFWINDOW")
    9117                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    9118                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    9119              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{2610D5B4-5CBC-4747-A1C3-229C8FD63D4F} PAGE  169

    9120              $C$DW$819       .dwtag  DW_TAG_member
    9121                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$20)
    9122                      .dwattr $C$DW$819, DW_AT_name("DCFWINDOWCNT")
    9123                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_DCFWINDOWCNT")
    9124                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9125                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    9126              
    9127              $C$DW$820       .dwtag  DW_TAG_member
    9128                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$20)
    9129                      .dwattr $C$DW$820, DW_AT_name("DCCAP")
    9130                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_DCCAP")
    9131                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    9132                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    9133              
    9134                      .dwendtag $C$DW$T$23
    9135              
    9136              $C$DW$T$126     .dwtag  DW_TAG_typedef
    9137                      .dwattr $C$DW$T$126, DW_AT_name("PWM_Obj")
    9138                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$23)
    9139                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    9140              
    9141              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    9142                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$23)
    9143                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    9144              
    9145              $C$DW$T$33      .dwtag  DW_TAG_typedef
    9146                      .dwattr $C$DW$T$33, DW_AT_name("PWM_Handle")
    9147                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    9148                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    9149              
    9150              $C$DW$821       .dwtag  DW_TAG_TI_far_type
    9151                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$33)
    9152              
    9153              $C$DW$T$127     .dwtag  DW_TAG_const_type
    9154                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$821)
    9155              
    9156              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    9157                      .dwattr $C$DW$T$2, DW_AT_name("void")
    9158              
    9159              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    9160                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    9161                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    9162              
    9163              $C$DW$T$4       .dwtag  DW_TAG_base_type
    9164                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    9165                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    9166                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    9167              
    9168              $C$DW$T$5       .dwtag  DW_TAG_base_type
    9169                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    9170                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    9171                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    9172              
    9173              $C$DW$T$6       .dwtag  DW_TAG_base_type
    9174                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{2610D5B4-5CBC-4747-A1C3-229C8FD63D4F} PAGE  170

    9175                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    9176                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    9177              
    9178              $C$DW$T$7       .dwtag  DW_TAG_base_type
    9179                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    9180                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    9181                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    9182              
    9183              $C$DW$T$8       .dwtag  DW_TAG_base_type
    9184                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    9185                      .dwattr $C$DW$T$8, DW_AT_name("short")
    9186                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    9187              
    9188              $C$DW$T$9       .dwtag  DW_TAG_base_type
    9189                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    9190                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    9191                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    9192              
    9193              $C$DW$T$10      .dwtag  DW_TAG_base_type
