TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Sun Jun 17 14:52:41 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("EST_setLs_d_pu")

    3355                      .dwattr $C$DW$335, DW_AT_name("USER_ErrorCode_estFreq_Hz_High")
    3356                      .dwattr $C$DW$335, DW_AT_const_value(0x60)
    3357              
    3358              $C$DW$336       .dwtag  DW_TAG_enumerator
    3359                      .dwattr $C$DW$336, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low")
    3360                      .dwattr $C$DW$336, DW_AT_const_value(0x61)
    3361              
    3362              $C$DW$337       .dwtag  DW_TAG_enumerator
    3363                      .dwattr $C$DW$337, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High")
    3364                      .dwattr $C$DW$337, DW_AT_const_value(0x62)
    3365              
    3366              $C$DW$338       .dwtag  DW_TAG_enumerator
    3367                      .dwattr $C$DW$338, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low")
    3368                      .dwattr $C$DW$338, DW_AT_const_value(0x63)
    3369              
    3370              $C$DW$339       .dwtag  DW_TAG_enumerator
    3371                      .dwattr $C$DW$339, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High")
    3372                      .dwattr $C$DW$339, DW_AT_const_value(0x64)
    3373              
    3374              $C$DW$340       .dwtag  DW_TAG_enumerator
    3375                      .dwattr $C$DW$340, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low")
    3376                      .dwattr $C$DW$340, DW_AT_const_value(0x65)
    3377              
    3378              $C$DW$341       .dwtag  DW_TAG_enumerator
    3379                      .dwattr $C$DW$341, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High")
    3380                      .dwattr $C$DW$341, DW_AT_const_value(0x66)
    3381              
    3382              $C$DW$342       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   67

    3383                      .dwattr $C$DW$342, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low")
    3384                      .dwattr $C$DW$342, DW_AT_const_value(0x67)
    3385              
    3386              $C$DW$343       .dwtag  DW_TAG_enumerator
    3387                      .dwattr $C$DW$343, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High")
    3388                      .dwattr $C$DW$343, DW_AT_const_value(0x68)
    3389              
    3390              $C$DW$344       .dwtag  DW_TAG_enumerator
    3391                      .dwattr $C$DW$344, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low")
    3392                      .dwattr $C$DW$344, DW_AT_const_value(0x69)
    3393              
    3394              $C$DW$345       .dwtag  DW_TAG_enumerator
    3395                      .dwattr $C$DW$345, DW_AT_name("USER_numErrorCodes")
    3396                      .dwattr $C$DW$345, DW_AT_const_value(0x6a)
    3397              
    3398                      .dwendtag $C$DW$T$74
    3399              
    3400              $C$DW$T$75      .dwtag  DW_TAG_typedef
    3401                      .dwattr $C$DW$T$75, DW_AT_name("USER_ErrorCode_e")
    3402                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3403                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3404              
    3405              $C$DW$346       .dwtag  DW_TAG_TI_far_type
    3406                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$75)
    3407              
    3408              $C$DW$T$77      .dwtag  DW_TAG_const_type
    3409                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$346)
    3410              
    3411              
    3412              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    3413                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    3414              $C$DW$347       .dwtag  DW_TAG_enumerator
    3415                      .dwattr $C$DW$347, DW_AT_name("CTRL_Type_PID_spd")
    3416                      .dwattr $C$DW$347, DW_AT_const_value(0x00)
    3417              
    3418              $C$DW$348       .dwtag  DW_TAG_enumerator
    3419                      .dwattr $C$DW$348, DW_AT_name("CTRL_Type_PID_Id")
    3420                      .dwattr $C$DW$348, DW_AT_const_value(0x01)
    3421              
    3422              $C$DW$349       .dwtag  DW_TAG_enumerator
    3423                      .dwattr $C$DW$349, DW_AT_name("CTRL_Type_PID_Iq")
    3424                      .dwattr $C$DW$349, DW_AT_const_value(0x02)
    3425              
    3426                      .dwendtag $C$DW$T$82
    3427              
    3428              $C$DW$T$83      .dwtag  DW_TAG_typedef
    3429                      .dwattr $C$DW$T$83, DW_AT_name("CTRL_Type_e")
    3430                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    3431                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3432              
    3433              $C$DW$350       .dwtag  DW_TAG_TI_far_type
    3434                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$83)
    3435              
    3436              $C$DW$T$84      .dwtag  DW_TAG_const_type
    3437                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$350)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   68

    3438              
    3439              
    3440              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3441                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    3442                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    3443              $C$DW$351       .dwtag  DW_TAG_member
    3444                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$20)
    3445                      .dwattr $C$DW$351, DW_AT_name("alpha_sf")
    3446                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_alpha_sf")
    3447                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3448                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3449              
    3450              $C$DW$352       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$20)
    3452                      .dwattr $C$DW$352, DW_AT_name("beta_sf")
    3453                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_beta_sf")
    3454                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3455                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3456              
    3457              $C$DW$353       .dwtag  DW_TAG_member
    3458                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$22)
    3459                      .dwattr $C$DW$353, DW_AT_name("numSensors")
    3460                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_numSensors")
    3461                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3462                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3463              
    3464                      .dwendtag $C$DW$T$23
    3465              
    3466              $C$DW$T$31      .dwtag  DW_TAG_typedef
    3467                      .dwattr $C$DW$T$31, DW_AT_name("CLARKE_Obj")
    3468                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    3469                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3470              
    3471              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3472                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    3473                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3474              
    3475              $C$DW$T$30      .dwtag  DW_TAG_typedef
    3476                      .dwattr $C$DW$T$30, DW_AT_name("CLARKE_Handle")
    3477                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3478                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3479              
    3480              
    3481              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3482                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    3483                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    3484              $C$DW$354       .dwtag  DW_TAG_member
    3485                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$24)
    3486                      .dwattr $C$DW$354, DW_AT_name("version")
    3487                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_version")
    3488                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3489                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3490              
    3491              $C$DW$355       .dwtag  DW_TAG_member
    3492                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   69

    3493                      .dwattr $C$DW$355, DW_AT_name("state")
    3494                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_state")
    3495                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3496                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3497              
    3498              $C$DW$356       .dwtag  DW_TAG_member
    3499                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$26)
    3500                      .dwattr $C$DW$356, DW_AT_name("prevState")
    3501                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_prevState")
    3502                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3503                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3504              
    3505              $C$DW$357       .dwtag  DW_TAG_member
    3506                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$28)
    3507                      .dwattr $C$DW$357, DW_AT_name("errorCode")
    3508                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_errorCode")
    3509                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3510                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3511              
    3512              $C$DW$358       .dwtag  DW_TAG_member
    3513                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$30)
    3514                      .dwattr $C$DW$358, DW_AT_name("clarkeHandle_I")
    3515                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3516                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3517                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3518              
    3519              $C$DW$359       .dwtag  DW_TAG_member
    3520                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$31)
    3521                      .dwattr $C$DW$359, DW_AT_name("clarke_I")
    3522                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_clarke_I")
    3523                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3524                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3525              
    3526              $C$DW$360       .dwtag  DW_TAG_member
    3527                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$30)
    3528                      .dwattr $C$DW$360, DW_AT_name("clarkeHandle_V")
    3529                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3530                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3531                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3532              
    3533              $C$DW$361       .dwtag  DW_TAG_member
    3534                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$31)
    3535                      .dwattr $C$DW$361, DW_AT_name("clarke_V")
    3536                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_clarke_V")
    3537                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3538                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3539              
    3540              $C$DW$362       .dwtag  DW_TAG_member
    3541                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$33)
    3542                      .dwattr $C$DW$362, DW_AT_name("estHandle")
    3543                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_estHandle")
    3544                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3545                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3546              
    3547              $C$DW$363       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   70

    3548                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$35)
    3549                      .dwattr $C$DW$363, DW_AT_name("parkHandle")
    3550                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_parkHandle")
    3551                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3552                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3553              
    3554              $C$DW$364       .dwtag  DW_TAG_member
    3555                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$36)
    3556                      .dwattr $C$DW$364, DW_AT_name("park")
    3557                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_park")
    3558                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3559                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3560              
    3561              $C$DW$365       .dwtag  DW_TAG_member
    3562                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$38)
    3563                      .dwattr $C$DW$365, DW_AT_name("pidHandle_Id")
    3564                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_pidHandle_Id")
    3565                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3566                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3567              
    3568              $C$DW$366       .dwtag  DW_TAG_member
    3569                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$39)
    3570                      .dwattr $C$DW$366, DW_AT_name("pid_Id")
    3571                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_pid_Id")
    3572                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3573                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3574              
    3575              $C$DW$367       .dwtag  DW_TAG_member
    3576                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$38)
    3577                      .dwattr $C$DW$367, DW_AT_name("pidHandle_Iq")
    3578                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3579                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3580                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3581              
    3582              $C$DW$368       .dwtag  DW_TAG_member
    3583                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$39)
    3584                      .dwattr $C$DW$368, DW_AT_name("pid_Iq")
    3585                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_pid_Iq")
    3586                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3587                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3588              
    3589              $C$DW$369       .dwtag  DW_TAG_member
    3590                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$38)
    3591                      .dwattr $C$DW$369, DW_AT_name("pidHandle_spd")
    3592                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_pidHandle_spd")
    3593                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3594                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3595              
    3596              $C$DW$370       .dwtag  DW_TAG_member
    3597                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$39)
    3598                      .dwattr $C$DW$370, DW_AT_name("pid_spd")
    3599                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_pid_spd")
    3600                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3601                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3602              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   71

    3603              $C$DW$371       .dwtag  DW_TAG_member
    3604                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$41)
    3605                      .dwattr $C$DW$371, DW_AT_name("iparkHandle")
    3606                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_iparkHandle")
    3607                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3608                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3609              
    3610              $C$DW$372       .dwtag  DW_TAG_member
    3611                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$42)
    3612                      .dwattr $C$DW$372, DW_AT_name("ipark")
    3613                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_ipark")
    3614                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3615                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3616              
    3617              $C$DW$373       .dwtag  DW_TAG_member
    3618                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$44)
    3619                      .dwattr $C$DW$373, DW_AT_name("svgenHandle")
    3620                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_svgenHandle")
    3621                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3622                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3623              
    3624              $C$DW$374       .dwtag  DW_TAG_member
    3625                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$45)
    3626                      .dwattr $C$DW$374, DW_AT_name("svgen")
    3627                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_svgen")
    3628                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3629                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3630              
    3631              $C$DW$375       .dwtag  DW_TAG_member
    3632                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$47)
    3633                      .dwattr $C$DW$375, DW_AT_name("trajHandle_Id")
    3634                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_trajHandle_Id")
    3635                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3636                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3637              
    3638              $C$DW$376       .dwtag  DW_TAG_member
    3639                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$48)
    3640                      .dwattr $C$DW$376, DW_AT_name("traj_Id")
    3641                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_traj_Id")
    3642                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3643                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3644              
    3645              $C$DW$377       .dwtag  DW_TAG_member
    3646                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$47)
    3647                      .dwattr $C$DW$377, DW_AT_name("trajHandle_spd")
    3648                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_trajHandle_spd")
    3649                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3650                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3651              
    3652              $C$DW$378       .dwtag  DW_TAG_member
    3653                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$48)
    3654                      .dwattr $C$DW$378, DW_AT_name("traj_spd")
    3655                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_traj_spd")
    3656                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3657                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   72

    3658              
    3659              $C$DW$379       .dwtag  DW_TAG_member
    3660                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$47)
    3661                      .dwattr $C$DW$379, DW_AT_name("trajHandle_spdMax")
    3662                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3663                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3664                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3665              
    3666              $C$DW$380       .dwtag  DW_TAG_member
    3667                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$48)
    3668                      .dwattr $C$DW$380, DW_AT_name("traj_spdMax")
    3669                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_traj_spdMax")
    3670                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3671                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3672              
    3673              $C$DW$381       .dwtag  DW_TAG_member
    3674                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$49)
    3675                      .dwattr $C$DW$381, DW_AT_name("motorParams")
    3676                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_motorParams")
    3677                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3678                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3679              
    3680              $C$DW$382       .dwtag  DW_TAG_member
    3681                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$52)
    3682                      .dwattr $C$DW$382, DW_AT_name("waitTimes")
    3683                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_waitTimes")
    3684                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3685                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3686              
    3687              $C$DW$383       .dwtag  DW_TAG_member
    3688                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$51)
    3689                      .dwattr $C$DW$383, DW_AT_name("counter_state")
    3690                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_counter_state")
    3691                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3692                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3693              
    3694              $C$DW$384       .dwtag  DW_TAG_member
    3695                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$53)
    3696                      .dwattr $C$DW$384, DW_AT_name("numIsrTicksPerCtrlTick")
    3697                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3698                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3699                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3700              
    3701              $C$DW$385       .dwtag  DW_TAG_member
    3702                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$53)
    3703                      .dwattr $C$DW$385, DW_AT_name("numCtrlTicksPerCurrentTick")
    3704                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3705                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3706                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3707              
    3708              $C$DW$386       .dwtag  DW_TAG_member
    3709                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$53)
    3710                      .dwattr $C$DW$386, DW_AT_name("numCtrlTicksPerSpeedTick")
    3711                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3712                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   73

    3713                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3714              
    3715              $C$DW$387       .dwtag  DW_TAG_member
    3716                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$53)
    3717                      .dwattr $C$DW$387, DW_AT_name("numCtrlTicksPerTrajTick")
    3718                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3719                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3720                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3721              
    3722              $C$DW$388       .dwtag  DW_TAG_member
    3723                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$51)
    3724                      .dwattr $C$DW$388, DW_AT_name("ctrlFreq_Hz")
    3725                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3726                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3727                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3728              
    3729              $C$DW$389       .dwtag  DW_TAG_member
    3730                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$51)
    3731                      .dwattr $C$DW$389, DW_AT_name("trajFreq_Hz")
    3732                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3733                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3734                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3735              
    3736              $C$DW$390       .dwtag  DW_TAG_member
    3737                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$20)
    3738                      .dwattr $C$DW$390, DW_AT_name("trajPeriod_sec")
    3739                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3740                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3741                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3742              
    3743              $C$DW$391       .dwtag  DW_TAG_member
    3744                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$54)
    3745                      .dwattr $C$DW$391, DW_AT_name("ctrlPeriod_sec")
    3746                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3747                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3748                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3749              
    3750              $C$DW$392       .dwtag  DW_TAG_member
    3751                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$20)
    3752                      .dwattr $C$DW$392, DW_AT_name("maxVsMag_pu")
    3753                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3754                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3755                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3756              
    3757              $C$DW$393       .dwtag  DW_TAG_member
    3758                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$55)
    3759                      .dwattr $C$DW$393, DW_AT_name("Iab_in")
    3760                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_Iab_in")
    3761                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3762                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3763              
    3764              $C$DW$394       .dwtag  DW_TAG_member
    3765                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$55)
    3766                      .dwattr $C$DW$394, DW_AT_name("Iab_filt")
    3767                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_Iab_filt")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   74

    3768                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3769                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3770              
    3771              $C$DW$395       .dwtag  DW_TAG_member
    3772                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$55)
    3773                      .dwattr $C$DW$395, DW_AT_name("Idq_in")
    3774                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_Idq_in")
    3775                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3776                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3777              
    3778              $C$DW$396       .dwtag  DW_TAG_member
    3779                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$55)
    3780                      .dwattr $C$DW$396, DW_AT_name("Vab_in")
    3781                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_Vab_in")
    3782                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3783                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3784              
    3785              $C$DW$397       .dwtag  DW_TAG_member
    3786                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$20)
    3787                      .dwattr $C$DW$397, DW_AT_name("spd_out")
    3788                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_spd_out")
    3789                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3790                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3791              
    3792              $C$DW$398       .dwtag  DW_TAG_member
    3793                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$55)
    3794                      .dwattr $C$DW$398, DW_AT_name("Vab_out")
    3795                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_Vab_out")
    3796                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3797                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3798              
    3799              $C$DW$399       .dwtag  DW_TAG_member
    3800                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$55)
    3801                      .dwattr $C$DW$399, DW_AT_name("Vdq_out")
    3802                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_Vdq_out")
    3803                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3804                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3805              
    3806              $C$DW$400       .dwtag  DW_TAG_member
    3807                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$54)
    3808                      .dwattr $C$DW$400, DW_AT_name("Rhf")
    3809                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_Rhf")
    3810                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3811                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3812              
    3813              $C$DW$401       .dwtag  DW_TAG_member
    3814                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$54)
    3815                      .dwattr $C$DW$401, DW_AT_name("Lhf")
    3816                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_Lhf")
    3817                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3818                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3819              
    3820              $C$DW$402       .dwtag  DW_TAG_member
    3821                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$54)
    3822                      .dwattr $C$DW$402, DW_AT_name("RoverL")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   75

    3823                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_RoverL")
    3824                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3825                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3826              
    3827              $C$DW$403       .dwtag  DW_TAG_member
    3828                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$20)
    3829                      .dwattr $C$DW$403, DW_AT_name("Kp_Id")
    3830                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_Kp_Id")
    3831                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3832                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3833              
    3834              $C$DW$404       .dwtag  DW_TAG_member
    3835                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
    3836                      .dwattr $C$DW$404, DW_AT_name("Kp_Iq")
    3837                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_Kp_Iq")
    3838                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3839                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3840              
    3841              $C$DW$405       .dwtag  DW_TAG_member
    3842                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    3843                      .dwattr $C$DW$405, DW_AT_name("Kp_spd")
    3844                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_Kp_spd")
    3845                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3846                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3847              
    3848              $C$DW$406       .dwtag  DW_TAG_member
    3849                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    3850                      .dwattr $C$DW$406, DW_AT_name("Ki_Id")
    3851                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_Ki_Id")
    3852                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3853                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3854              
    3855              $C$DW$407       .dwtag  DW_TAG_member
    3856                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    3857                      .dwattr $C$DW$407, DW_AT_name("Ki_Iq")
    3858                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_Ki_Iq")
    3859                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3860                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3861              
    3862              $C$DW$408       .dwtag  DW_TAG_member
    3863                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
    3864                      .dwattr $C$DW$408, DW_AT_name("Ki_spd")
    3865                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Ki_spd")
    3866                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3867                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3868              
    3869              $C$DW$409       .dwtag  DW_TAG_member
    3870                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
    3871                      .dwattr $C$DW$409, DW_AT_name("Kd_Id")
    3872                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Kd_Id")
    3873                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3874                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3875              
    3876              $C$DW$410       .dwtag  DW_TAG_member
    3877                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   76

    3878                      .dwattr $C$DW$410, DW_AT_name("Kd_Iq")
    3879                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Kd_Iq")
    3880                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3881                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3882              
    3883              $C$DW$411       .dwtag  DW_TAG_member
    3884                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    3885                      .dwattr $C$DW$411, DW_AT_name("Kd_spd")
    3886                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Kd_spd")
    3887                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3888                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3889              
    3890              $C$DW$412       .dwtag  DW_TAG_member
    3891                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
    3892                      .dwattr $C$DW$412, DW_AT_name("Ui_Id")
    3893                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Ui_Id")
    3894                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3895                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3896              
    3897              $C$DW$413       .dwtag  DW_TAG_member
    3898                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$20)
    3899                      .dwattr $C$DW$413, DW_AT_name("Ui_Iq")
    3900                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Ui_Iq")
    3901                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3902                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3903              
    3904              $C$DW$414       .dwtag  DW_TAG_member
    3905                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    3906                      .dwattr $C$DW$414, DW_AT_name("Ui_spd")
    3907                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Ui_spd")
    3908                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3909                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3910              
    3911              $C$DW$415       .dwtag  DW_TAG_member
    3912                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$55)
    3913                      .dwattr $C$DW$415, DW_AT_name("Idq_ref")
    3914                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_Idq_ref")
    3915                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3916                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3917              
    3918              $C$DW$416       .dwtag  DW_TAG_member
    3919                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
    3920                      .dwattr $C$DW$416, DW_AT_name("IdRated")
    3921                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_IdRated")
    3922                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3923                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3924              
    3925              $C$DW$417       .dwtag  DW_TAG_member
    3926                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    3927                      .dwattr $C$DW$417, DW_AT_name("spd_ref")
    3928                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_spd_ref")
    3929                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3930                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3931              
    3932              $C$DW$418       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   77

    3933                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    3934                      .dwattr $C$DW$418, DW_AT_name("spd_max")
    3935                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_spd_max")
    3936                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3937                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3938              
    3939              $C$DW$419       .dwtag  DW_TAG_member
    3940                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$53)
    3941                      .dwattr $C$DW$419, DW_AT_name("counter_current")
    3942                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_counter_current")
    3943                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3944                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3945              
    3946              $C$DW$420       .dwtag  DW_TAG_member
    3947                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$53)
    3948                      .dwattr $C$DW$420, DW_AT_name("counter_isr")
    3949                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_counter_isr")
    3950                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3951                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3952              
    3953              $C$DW$421       .dwtag  DW_TAG_member
    3954                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$53)
    3955                      .dwattr $C$DW$421, DW_AT_name("counter_speed")
    3956                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_counter_speed")
    3957                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3958                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3959              
    3960              $C$DW$422       .dwtag  DW_TAG_member
    3961                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$53)
    3962                      .dwattr $C$DW$422, DW_AT_name("counter_traj")
    3963                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_counter_traj")
    3964                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3965                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3966              
    3967              $C$DW$423       .dwtag  DW_TAG_member
    3968                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$56)
    3969                      .dwattr $C$DW$423, DW_AT_name("flag_enableCtrl")
    3970                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3971                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3972                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3973              
    3974              $C$DW$424       .dwtag  DW_TAG_member
    3975                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$56)
    3976                      .dwattr $C$DW$424, DW_AT_name("flag_enableDcBusComp")
    3977                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3978                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3979                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3980              
    3981              $C$DW$425       .dwtag  DW_TAG_member
    3982                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$56)
    3983                      .dwattr $C$DW$425, DW_AT_name("flag_enablePowerWarp")
    3984                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3985                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3986                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3987              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   78

    3988              $C$DW$426       .dwtag  DW_TAG_member
    3989                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$56)
    3990                      .dwattr $C$DW$426, DW_AT_name("flag_enableOffset")
    3991                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_flag_enableOffset")
    3992                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3993                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3994              
    3995              $C$DW$427       .dwtag  DW_TAG_member
    3996                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$56)
    3997                      .dwattr $C$DW$427, DW_AT_name("flag_enableSpeedCtrl")
    3998                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3999                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4000                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4001              
    4002              $C$DW$428       .dwtag  DW_TAG_member
    4003                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$56)
    4004                      .dwattr $C$DW$428, DW_AT_name("flag_enableUserMotorParams")
    4005                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4006                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4007                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4008              
    4009              $C$DW$429       .dwtag  DW_TAG_member
    4010                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$55)
    4011                      .dwattr $C$DW$429, DW_AT_name("Idq_offset_pu")
    4012                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4013                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4014                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4015              
    4016              $C$DW$430       .dwtag  DW_TAG_member
    4017                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$55)
    4018                      .dwattr $C$DW$430, DW_AT_name("Vdq_offset_pu")
    4019                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4020                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4021                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4022              
    4023              $C$DW$431       .dwtag  DW_TAG_member
    4024                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    4025                      .dwattr $C$DW$431, DW_AT_name("angle_pu")
    4026                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_angle_pu")
    4027                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4028                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4029              
    4030              $C$DW$432       .dwtag  DW_TAG_member
    4031                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    4032                      .dwattr $C$DW$432, DW_AT_name("speed_ref_pu")
    4033                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_speed_ref_pu")
    4034                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4035                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4036              
    4037              $C$DW$433       .dwtag  DW_TAG_member
    4038                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
    4039                      .dwattr $C$DW$433, DW_AT_name("speed_fb_pu")
    4040                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_speed_fb_pu")
    4041                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4042                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   79

    4043              
    4044              $C$DW$434       .dwtag  DW_TAG_member
    4045                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
    4046                      .dwattr $C$DW$434, DW_AT_name("speed_outMax_pu")
    4047                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4048                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4049                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4050              
    4051              $C$DW$435       .dwtag  DW_TAG_member
    4052                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$56)
    4053                      .dwattr $C$DW$435, DW_AT_name("flag_enableCurrentCtrl")
    4054                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4055                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4056                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4057              
    4058                      .dwendtag $C$DW$T$57
    4059              
    4060              $C$DW$T$85      .dwtag  DW_TAG_typedef
    4061                      .dwattr $C$DW$T$85, DW_AT_name("CTRL_Obj")
    4062                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$57)
    4063                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    4064              
    4065              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    4066                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    4067                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    4068              
    4069              $C$DW$T$87      .dwtag  DW_TAG_typedef
    4070                      .dwattr $C$DW$T$87, DW_AT_name("CTRL_Handle")
    4071                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    4072                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4073              
    4074              $C$DW$436       .dwtag  DW_TAG_TI_far_type
    4075                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$87)
    4076              
    4077              $C$DW$T$88      .dwtag  DW_TAG_const_type
    4078                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$436)
    4079              
    4080              
    4081              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    4082                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    4083                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    4084              $C$DW$437       .dwtag  DW_TAG_member
    4085                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$21)
    4086                      .dwattr $C$DW$437, DW_AT_name("rsvd")
    4087                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_rsvd")
    4088                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4089                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4090              
    4091              $C$DW$438       .dwtag  DW_TAG_member
    4092                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$59)
    4093                      .dwattr $C$DW$438, DW_AT_name("targetProc")
    4094                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_targetProc")
    4095                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4096                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4097              
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   80

    4098              $C$DW$439       .dwtag  DW_TAG_member
    4099                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$21)
    4100                      .dwattr $C$DW$439, DW_AT_name("major")
    4101                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_major")
    4102                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4103                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4104              
    4105              $C$DW$440       .dwtag  DW_TAG_member
    4106                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$21)
    4107                      .dwattr $C$DW$440, DW_AT_name("minor")
    4108                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_minor")
    4109                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4110                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4111              
    4112                      .dwendtag $C$DW$T$60
    4113              
    4114              $C$DW$T$24      .dwtag  DW_TAG_typedef
    4115                      .dwattr $C$DW$T$24, DW_AT_name("CTRL_Version")
    4116                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    4117                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    4118              
    4119              
    4120              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4121                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    4122                      .dwattr $C$DW$T$19, DW_AT_declaration
    4123                      .dwendtag $C$DW$T$19
    4124              
    4125              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    4126                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    4127                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    4128              
    4129              $C$DW$T$33      .dwtag  DW_TAG_typedef
    4130                      .dwattr $C$DW$T$33, DW_AT_name("EST_Handle")
    4131                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4132                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4133              
    4134              
    4135              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    4136                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    4137                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    4138              $C$DW$441       .dwtag  DW_TAG_member
    4139                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$20)
    4140                      .dwattr $C$DW$441, DW_AT_name("sinTh")
    4141                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_sinTh")
    4142                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4143                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4144              
    4145              $C$DW$442       .dwtag  DW_TAG_member
    4146                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$20)
    4147                      .dwattr $C$DW$442, DW_AT_name("cosTh")
    4148                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_cosTh")
    4149                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4150                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4151              
    4152                      .dwendtag $C$DW$T$61
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   81

    4153              
    4154              $C$DW$T$42      .dwtag  DW_TAG_typedef
    4155                      .dwattr $C$DW$T$42, DW_AT_name("IPARK_Obj")
    4156                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    4157                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4158              
    4159              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    4160                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    4161                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    4162              
    4163              $C$DW$T$41      .dwtag  DW_TAG_typedef
    4164                      .dwattr $C$DW$T$41, DW_AT_name("IPARK_Handle")
    4165                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    4166                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4167              
    4168              
    4169              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4170                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    4171                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    4172              $C$DW$443       .dwtag  DW_TAG_member
    4173                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$62)
    4174                      .dwattr $C$DW$443, DW_AT_name("value")
    4175                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_value")
    4176                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4177                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4178              
    4179                      .dwendtag $C$DW$T$63
    4180              
    4181              $C$DW$T$55      .dwtag  DW_TAG_typedef
    4182                      .dwattr $C$DW$T$55, DW_AT_name("MATH_vec2")
    4183                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    4184                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4185              
    4186              
    4187              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4188                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    4189                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    4190              $C$DW$444       .dwtag  DW_TAG_member
    4191                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$65)
    4192                      .dwattr $C$DW$444, DW_AT_name("type")
    4193                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_type")
    4194                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4195                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4196              
    4197              $C$DW$445       .dwtag  DW_TAG_member
    4198                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$53)
    4199                      .dwattr $C$DW$445, DW_AT_name("numPolePairs")
    4200                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_numPolePairs")
    4201                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4202                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4203              
    4204              $C$DW$446       .dwtag  DW_TAG_member
    4205                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$54)
    4206                      .dwattr $C$DW$446, DW_AT_name("Lr_H")
    4207                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_Lr_H")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   82

    4208                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4209                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4210              
    4211              $C$DW$447       .dwtag  DW_TAG_member
    4212                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$54)
    4213                      .dwattr $C$DW$447, DW_AT_name("Ls_d_H")
    4214                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_Ls_d_H")
    4215                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4216                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4217              
    4218              $C$DW$448       .dwtag  DW_TAG_member
    4219                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$54)
    4220                      .dwattr $C$DW$448, DW_AT_name("Ls_q_H")
    4221                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_Ls_q_H")
    4222                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4223                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4224              
    4225              $C$DW$449       .dwtag  DW_TAG_member
    4226                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$54)
    4227                      .dwattr $C$DW$449, DW_AT_name("Rr_Ohm")
    4228                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_Rr_Ohm")
    4229                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4230                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4231              
    4232              $C$DW$450       .dwtag  DW_TAG_member
    4233                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$54)
    4234                      .dwattr $C$DW$450, DW_AT_name("Rs_Ohm")
    4235                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_Rs_Ohm")
    4236                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4237                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4238              
    4239              $C$DW$451       .dwtag  DW_TAG_member
    4240                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$54)
    4241                      .dwattr $C$DW$451, DW_AT_name("ratedFlux_VpHz")
    4242                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    4243                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4244                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4245              
    4246                      .dwendtag $C$DW$T$66
    4247              
    4248              $C$DW$T$49      .dwtag  DW_TAG_typedef
    4249                      .dwattr $C$DW$T$49, DW_AT_name("MOTOR_Params")
    4250                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    4251                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4252              
    4253              
    4254              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4255                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    4256                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    4257              $C$DW$452       .dwtag  DW_TAG_member
    4258                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    4259                      .dwattr $C$DW$452, DW_AT_name("sinTh")
    4260                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_sinTh")
    4261                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4262                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   83

    4263              
    4264              $C$DW$453       .dwtag  DW_TAG_member
    4265                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$20)
    4266                      .dwattr $C$DW$453, DW_AT_name("cosTh")
    4267                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_cosTh")
    4268                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4269                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4270              
    4271                      .dwendtag $C$DW$T$67
    4272              
    4273              $C$DW$T$36      .dwtag  DW_TAG_typedef
    4274                      .dwattr $C$DW$T$36, DW_AT_name("PARK_Obj")
    4275                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    4276                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4277              
    4278              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    4279                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    4280                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    4281              
    4282              $C$DW$T$35      .dwtag  DW_TAG_typedef
    4283                      .dwattr $C$DW$T$35, DW_AT_name("PARK_Handle")
    4284                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4285                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4286              
    4287              
    4288              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    4289                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    4290                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    4291              $C$DW$454       .dwtag  DW_TAG_member
    4292                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    4293                      .dwattr $C$DW$454, DW_AT_name("Kp")
    4294                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_Kp")
    4295                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4296                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4297              
    4298              $C$DW$455       .dwtag  DW_TAG_member
    4299                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
    4300                      .dwattr $C$DW$455, DW_AT_name("Ki")
    4301                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_Ki")
    4302                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4303                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4304              
    4305              $C$DW$456       .dwtag  DW_TAG_member
    4306                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
    4307                      .dwattr $C$DW$456, DW_AT_name("Kd")
    4308                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_Kd")
    4309                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4310                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4311              
    4312              $C$DW$457       .dwtag  DW_TAG_member
    4313                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
    4314                      .dwattr $C$DW$457, DW_AT_name("Ui")
    4315                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_Ui")
    4316                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4317                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   84

    4318              
    4319              $C$DW$458       .dwtag  DW_TAG_member
    4320                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
    4321                      .dwattr $C$DW$458, DW_AT_name("refValue")
    4322                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_refValue")
    4323                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4324                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4325              
    4326              $C$DW$459       .dwtag  DW_TAG_member
    4327                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$20)
    4328                      .dwattr $C$DW$459, DW_AT_name("fbackValue")
    4329                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_fbackValue")
    4330                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4331                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4332              
    4333              $C$DW$460       .dwtag  DW_TAG_member
    4334                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
    4335                      .dwattr $C$DW$460, DW_AT_name("outMin")
    4336                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_outMin")
    4337                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4338                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4339              
    4340              $C$DW$461       .dwtag  DW_TAG_member
    4341                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    4342                      .dwattr $C$DW$461, DW_AT_name("outMax")
    4343                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_outMax")
    4344                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4345                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4346              
    4347                      .dwendtag $C$DW$T$68
    4348              
    4349              $C$DW$T$39      .dwtag  DW_TAG_typedef
    4350                      .dwattr $C$DW$T$39, DW_AT_name("PID_Obj")
    4351                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    4352                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4353              
    4354              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4355                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    4356                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    4357              
    4358              $C$DW$T$38      .dwtag  DW_TAG_typedef
    4359                      .dwattr $C$DW$T$38, DW_AT_name("PID_Handle")
    4360                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4361                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4362              
    4363              
    4364              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    4365                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    4366                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    4367              $C$DW$462       .dwtag  DW_TAG_member
    4368                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    4369                      .dwattr $C$DW$462, DW_AT_name("maxModulation")
    4370                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_maxModulation")
    4371                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4372                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   85

    4373              
    4374                      .dwendtag $C$DW$T$69
    4375              
    4376              $C$DW$T$45      .dwtag  DW_TAG_typedef
    4377                      .dwattr $C$DW$T$45, DW_AT_name("SVGEN_Obj")
    4378                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    4379                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4380              
    4381              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4382                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    4383                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    4384              
    4385              $C$DW$T$44      .dwtag  DW_TAG_typedef
    4386                      .dwattr $C$DW$T$44, DW_AT_name("SVGEN_Handle")
    4387                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4388                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4389              
    4390              
    4391              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4392                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    4393                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    4394              $C$DW$463       .dwtag  DW_TAG_member
    4395                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$20)
    4396                      .dwattr $C$DW$463, DW_AT_name("targetValue")
    4397                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_targetValue")
    4398                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4399                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4400              
    4401              $C$DW$464       .dwtag  DW_TAG_member
    4402                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$20)
    4403                      .dwattr $C$DW$464, DW_AT_name("intValue")
    4404                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_intValue")
    4405                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4406                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4407              
    4408              $C$DW$465       .dwtag  DW_TAG_member
    4409                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$20)
    4410                      .dwattr $C$DW$465, DW_AT_name("minValue")
    4411                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_minValue")
    4412                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4413                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4414              
    4415              $C$DW$466       .dwtag  DW_TAG_member
    4416                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$20)
    4417                      .dwattr $C$DW$466, DW_AT_name("maxValue")
    4418                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_maxValue")
    4419                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4420                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4421              
    4422              $C$DW$467       .dwtag  DW_TAG_member
    4423                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$20)
    4424                      .dwattr $C$DW$467, DW_AT_name("maxDelta")
    4425                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_maxDelta")
    4426                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4427                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   86

    4428              
    4429                      .dwendtag $C$DW$T$70
    4430              
    4431              $C$DW$T$48      .dwtag  DW_TAG_typedef
    4432                      .dwattr $C$DW$T$48, DW_AT_name("TRAJ_Obj")
    4433                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    4434                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4435              
    4436              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4437                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    4438                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    4439              
    4440              $C$DW$T$47      .dwtag  DW_TAG_typedef
    4441                      .dwattr $C$DW$T$47, DW_AT_name("TRAJ_Handle")
    4442                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4443                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4444              
    4445              
    4446              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    4447                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    4448                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    4449              $C$DW$468       .dwtag  DW_TAG_member
    4450                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$54)
    4451                      .dwattr $C$DW$468, DW_AT_name("iqFullScaleCurrent_A")
    4452                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    4453                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4454                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4455              
    4456              $C$DW$469       .dwtag  DW_TAG_member
    4457                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$54)
    4458                      .dwattr $C$DW$469, DW_AT_name("iqFullScaleVoltage_V")
    4459                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    4460                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4461                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4462              
    4463              $C$DW$470       .dwtag  DW_TAG_member
    4464                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$54)
    4465                      .dwattr $C$DW$470, DW_AT_name("iqFullScaleFreq_Hz")
    4466                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    4467                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4468                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4469              
    4470              $C$DW$471       .dwtag  DW_TAG_member
    4471                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$53)
    4472                      .dwattr $C$DW$471, DW_AT_name("numIsrTicksPerCtrlTick")
    4473                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4474                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4475                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4476              
    4477              $C$DW$472       .dwtag  DW_TAG_member
    4478                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$53)
    4479                      .dwattr $C$DW$472, DW_AT_name("numCtrlTicksPerCurrentTick")
    4480                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4481                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4482                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   87

    4483              
    4484              $C$DW$473       .dwtag  DW_TAG_member
    4485                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$53)
    4486                      .dwattr $C$DW$473, DW_AT_name("numCtrlTicksPerEstTick")
    4487                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    4488                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4489                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4490              
    4491              $C$DW$474       .dwtag  DW_TAG_member
    4492                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$53)
    4493                      .dwattr $C$DW$474, DW_AT_name("numCtrlTicksPerSpeedTick")
    4494                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4495                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4496                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4497              
    4498              $C$DW$475       .dwtag  DW_TAG_member
    4499                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$53)
    4500                      .dwattr $C$DW$475, DW_AT_name("numCtrlTicksPerTrajTick")
    4501                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4502                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4503                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4504              
    4505              $C$DW$476       .dwtag  DW_TAG_member
    4506                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$22)
    4507                      .dwattr $C$DW$476, DW_AT_name("numCurrentSensors")
    4508                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_numCurrentSensors")
    4509                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4510                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4511              
    4512              $C$DW$477       .dwtag  DW_TAG_member
    4513                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$22)
    4514                      .dwattr $C$DW$477, DW_AT_name("numVoltageSensors")
    4515                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_numVoltageSensors")
    4516                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4517                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4518              
    4519              $C$DW$478       .dwtag  DW_TAG_member
    4520                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$54)
    4521                      .dwattr $C$DW$478, DW_AT_name("offsetPole_rps")
    4522                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_offsetPole_rps")
    4523                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4524                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4525              
    4526              $C$DW$479       .dwtag  DW_TAG_member
    4527                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$54)
    4528                      .dwattr $C$DW$479, DW_AT_name("fluxPole_rps")
    4529                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_fluxPole_rps")
    4530                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4531                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4532              
    4533              $C$DW$480       .dwtag  DW_TAG_member
    4534                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$54)
    4535                      .dwattr $C$DW$480, DW_AT_name("zeroSpeedLimit")
    4536                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    4537                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   88

    4538                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4539              
    4540              $C$DW$481       .dwtag  DW_TAG_member
    4541                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$54)
    4542                      .dwattr $C$DW$481, DW_AT_name("forceAngleFreq_Hz")
    4543                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    4544                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4545                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4546              
    4547              $C$DW$482       .dwtag  DW_TAG_member
    4548                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$54)
    4549                      .dwattr $C$DW$482, DW_AT_name("maxAccel_Hzps")
    4550                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    4551                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4552                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4553              
    4554              $C$DW$483       .dwtag  DW_TAG_member
    4555                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$54)
    4556                      .dwattr $C$DW$483, DW_AT_name("maxAccel_est_Hzps")
    4557                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    4558                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4559                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4560              
    4561              $C$DW$484       .dwtag  DW_TAG_member
    4562                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$54)
    4563                      .dwattr $C$DW$484, DW_AT_name("directionPole_rps")
    4564                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_directionPole_rps")
    4565                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4566                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4567              
    4568              $C$DW$485       .dwtag  DW_TAG_member
    4569                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$54)
    4570                      .dwattr $C$DW$485, DW_AT_name("speedPole_rps")
    4571                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_speedPole_rps")
    4572                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4573                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    4574              
    4575              $C$DW$486       .dwtag  DW_TAG_member
    4576                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$54)
    4577                      .dwattr $C$DW$486, DW_AT_name("dcBusPole_rps")
    4578                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_dcBusPole_rps")
    4579                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4580                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4581              
    4582              $C$DW$487       .dwtag  DW_TAG_member
    4583                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$54)
    4584                      .dwattr $C$DW$487, DW_AT_name("fluxFraction")
    4585                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_fluxFraction")
    4586                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4587                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4588              
    4589              $C$DW$488       .dwtag  DW_TAG_member
    4590                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$54)
    4591                      .dwattr $C$DW$488, DW_AT_name("indEst_speedMaxFraction")
    4592                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   89

    4593                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4594                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    4595              
    4596              $C$DW$489       .dwtag  DW_TAG_member
    4597                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$54)
    4598                      .dwattr $C$DW$489, DW_AT_name("powerWarpGain")
    4599                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_powerWarpGain")
    4600                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4601                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    4602              
    4603              $C$DW$490       .dwtag  DW_TAG_member
    4604                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$53)
    4605                      .dwattr $C$DW$490, DW_AT_name("systemFreq_MHz")
    4606                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_systemFreq_MHz")
    4607                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4608                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    4609              
    4610              $C$DW$491       .dwtag  DW_TAG_member
    4611                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$54)
    4612                      .dwattr $C$DW$491, DW_AT_name("pwmPeriod_usec")
    4613                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    4614                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4615                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    4616              
    4617              $C$DW$492       .dwtag  DW_TAG_member
    4618                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$54)
    4619                      .dwattr $C$DW$492, DW_AT_name("voltage_sf")
    4620                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_voltage_sf")
    4621                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4622                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    4623              
    4624              $C$DW$493       .dwtag  DW_TAG_member
    4625                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$54)
    4626                      .dwattr $C$DW$493, DW_AT_name("current_sf")
    4627                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_current_sf")
    4628                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4629                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    4630              
    4631              $C$DW$494       .dwtag  DW_TAG_member
    4632                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$54)
    4633                      .dwattr $C$DW$494, DW_AT_name("voltageFilterPole_rps")
    4634                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    4635                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4636                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    4637              
    4638              $C$DW$495       .dwtag  DW_TAG_member
    4639                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$54)
    4640                      .dwattr $C$DW$495, DW_AT_name("maxVsMag_pu")
    4641                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4642                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4643                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    4644              
    4645              $C$DW$496       .dwtag  DW_TAG_member
    4646                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$54)
    4647                      .dwattr $C$DW$496, DW_AT_name("estKappa")
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   90

    4648                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_estKappa")
    4649                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4650                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    4651              
    4652              $C$DW$497       .dwtag  DW_TAG_member
    4653                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$65)
    4654                      .dwattr $C$DW$497, DW_AT_name("motor_type")
    4655                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_motor_type")
    4656                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4657                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    4658              
    4659              $C$DW$498       .dwtag  DW_TAG_member
    4660                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$53)
    4661                      .dwattr $C$DW$498, DW_AT_name("motor_numPolePairs")
    4662                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_motor_numPolePairs")
    4663                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4664                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    4665              
    4666              $C$DW$499       .dwtag  DW_TAG_member
    4667                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$54)
    4668                      .dwattr $C$DW$499, DW_AT_name("motor_ratedFlux")
    4669                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_motor_ratedFlux")
    4670                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4671                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    4672              
    4673              $C$DW$500       .dwtag  DW_TAG_member
    4674                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$54)
    4675                      .dwattr $C$DW$500, DW_AT_name("motor_Rr")
    4676                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_motor_Rr")
    4677                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4678                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    4679              
    4680              $C$DW$501       .dwtag  DW_TAG_member
    4681                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$54)
    4682                      .dwattr $C$DW$501, DW_AT_name("motor_Rs")
    4683                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_motor_Rs")
    4684                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4685                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    4686              
    4687              $C$DW$502       .dwtag  DW_TAG_member
    4688                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$54)
    4689                      .dwattr $C$DW$502, DW_AT_name("motor_Ls_d")
    4690                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_motor_Ls_d")
    4691                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4692                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    4693              
    4694              $C$DW$503       .dwtag  DW_TAG_member
    4695                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$54)
    4696                      .dwattr $C$DW$503, DW_AT_name("motor_Ls_q")
    4697                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_motor_Ls_q")
    4698                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4699                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    4700              
    4701              $C$DW$504       .dwtag  DW_TAG_member
    4702                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v18.1.2 Sun Jun 17 14:52:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\haowp\AppData\Local\Temp\{5B068A4F-8169-4681-A9D2-D6DAB90A13E0} PAGE   91

    4703                      .dwattr $C$DW$504, DW_AT_name("maxCurrent")
    4704                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_maxCurrent")
    4705                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
